{
  "CryptoCurrency": [
    [
      "2025-07-28T15:19:10",
      "“Buy my bags”"
    ],
    [
      "2025-07-28T15:19:12",
      "Ha! 99% goes to living expenses"
    ],
    [
      "2025-07-28T15:19:27",
      "It shows every single transaction on that account. The date. The amounts. And the destination accounts. This didn't just happen. It's been happening for a very long time. Charges almost everyday to multiple times per day. You're screwed."
    ],
    [
      "2025-07-28T15:19:40",
      "Each of the past 8 US market opens have had an instant dump.\n\nWTF"
    ],
    [
      "2025-07-28T15:20:08",
      "So your brother alarmed his/your mother that money was gone while you and your mother did not touch anything and he (potentially) did as can be assumed by what your mother is thinking (and the fact that wallets don‘t have a life of their own?).\n\nNeedless to say we have a prime suspect in this case, Sir. The experts here may find the truth\n\nAdvice:\nAsk your mother to move all she got left off the wallet and into a trustworthy exchange like BISON. BISON is a 100% company of the Börse Stuttgart and I have all my crypto there. No hussle. No worries. No „private keys“ that can get lost."
    ],
    [
      "2025-07-28T15:20:43",
      "Law enforcement wouldn’t do anything, the brother had the keys to the account therefore he is just as much the owner as they are. Morally he’s in the wrong, legally it’s his account. And I’m well aware btc has been tracked but that relies on the brokerage he sends it to telling them who owns the account."
    ],
    [
      "2025-07-28T15:21:52",
      "Go see a counselor dude. You're miserable and have clearly expressed that with words...like all the time."
    ],
    [
      "2025-07-28T15:22:14",
      "bipolar charts meh"
    ],
    [
      "2025-07-28T15:22:49",
      "NY market never wants to buy"
    ],
    [
      "2025-07-28T15:23:47",
      "> Stablecoins are subject to the same type of censorship as PayPal and Visa. They're not the solution. They're part of the problem\n\nNot sure I agree with this, and fundamentally it's a relatively easy field to compete in, where one stablecoin very easily substitutes for another.\n\nI admit that we'll likely see some amount of regulatory capture given the new legal framework around stablecoins, but we still have programmatic stablecoins and the barrier to entry is far lower given you can pretty much just slot in any new stablecoin to a system with minimal effort."
    ],
    [
      "2025-07-28T15:24:08",
      "You answered your own question."
    ],
    [
      "2025-07-28T15:25:28",
      "If I had to guess, his comment about the transactions being fraudulent was probably around Steam being used as a way to launder dirty money that had ended up in crypto."
    ],
    [
      "2025-07-28T15:25:40",
      "Every morning, the Euros wait to dump until the US market opens. Good thing the Americans have enough money to always buy the dip!"
    ],
    [
      "2025-07-28T15:26:16",
      "Why do you need to use PayPal in the first place?"
    ],
    [
      "2025-07-28T15:27:16",
      "Unfortunately, even most stocks are \"buy my bags\" these days"
    ],
    [
      "2025-07-28T15:28:06",
      "Lol I was messing with you bro. \n\nI briefly looked at the addresses and there’s definitely some sketchy stuff going on. \n\nWhat’s the significance of each of the 3 addresses? One is your mother’s and the rest are what?"
    ],
    [
      "2025-07-28T15:31:08",
      "Ah yes, Americans never dump"
    ],
    [
      "2025-07-28T15:32:23",
      "I didn't say they would. I'm trying to be more helpful than, \"UR BRUDDER DID IT\". They don't even know they can look up their transactions. Get out of my face, you and I are on the same page now, yeah? \n\nHis family can hire forensics, they can litigate, they can match spending to events in their lives."
    ],
    [
      "2025-07-28T15:32:30",
      "At one point Tik Tok had access to 100% of our files on our phone.. that was one of the main reasons why the Government wanted to ban Tik Tok because they were stealing data from people. A week after I downloaded Tik Tok my bank reached out to me and told me someone tried accessing my account. I’m pretty sure it had something to do with it. I could be wrong tho but idk .. seems sus."
    ],
    [
      "2025-07-28T15:34:07",
      "all 3 are my mother the two are btc and 1 is solana its phantom wallet idk exactly how it works tho"
    ],
    [
      "2025-07-28T15:34:39",
      "Yes great, can’t wait for them to ban merchants that sell stuff that doesn’t align with PayPal’s views, this is exactly what Bitcoin was for! /s\n\nSatoshi must be rolling in the grave…"
    ],
    [
      "2025-07-28T15:34:51",
      "Nice try guy"
    ],
    [
      "2025-07-28T15:34:56",
      "Nah , its just a habit."
    ],
    [
      "2025-07-28T15:35:05",
      "This market is designed and manipulated in a way to funnel people to stocks 😂"
    ],
    [
      "2025-07-28T15:35:07",
      "You can sue in civil court, you can press charges. To do either, you need to gather evidence. This isn't your money, so stop giving shit advice."
    ],
    [
      "2025-07-28T15:35:14",
      "We probably arent at the top of anything until everyone you know is asking about crypto and spending money on crypto"
    ],
    [
      "2025-07-28T15:35:27",
      "Ah yes hire someone by spending more money to tell us what we already know. That’s helpful. And once again them knowing how to look at transactions helps almost nothing."
    ],
    [
      "2025-07-28T15:35:32",
      "85% fiat and equivalent sounds far more riskier to me"
    ],
    [
      "2025-07-28T15:36:17",
      "I don't think so... I think Tom Lee said it right when he talked about stable coins being built on ETH. But, id still be careful with other Alts and id still be ready to trade sideways forever..."
    ],
    [
      "2025-07-28T15:36:25",
      "so who was it? some application he connected, or he himself?"
    ],
    [
      "2025-07-28T15:36:42",
      "a hacker, or he himself?"
    ],
    [
      "2025-07-28T15:36:45",
      "So... MOONS, yeah?"
    ],
    [
      "2025-07-28T15:36:47",
      ">as a hedge against macroeconomic risks.\n\nLet that sink in.\n\nLatest with BlackRock's publication [Bitcoin: A Unique Diversifier](https://www.blackrock.com/us/financial-professionals/literature/whitepaper/bitcoin-a-unique-diversifier.pdf), more and more people see BTC as a risk off asset. Its protocol & supply cannot be changed by a government. It is extremely portable if you need to run from war, disease outbreaks, government oppression or natural catastrophes. Unlike most fiat currencies it's acceptance is global.\n\nSo next time a war breaks out or your country slides into political disaster, hold your Bitcoin even tighter."
    ],
    [
      "2025-07-28T15:36:55",
      "Just got blocked by Bob \"the paperhand\" Loukas on X after asking if he felt mad for selling 33% of his bitcoin at $77k in April. Can't imagine missing out on so many gains now. Rip Bob Loukas, gone too soon."
    ],
    [
      "2025-07-28T15:37:20",
      "Hello, \n\nDirect links to images are require an [r/ CryptoCurrency membership](https://www.reddit.com/r/CryptoCurrency/comments/1cyvqam/special_memberships_are_now_live_on_rcc/), as was [voted on](https://snapshot.org/#/cryptomods.eth/proposal/0x6fcc358f650cc7056395c8f16697d535b6b7fbf834e8541954f5e0dc60b8fa59) by this community.\n\nYour content may also be a good fit in one of our other subreddits:\n\n* r/CryptoCurrencyMemes - For memes\n* r/CryptoHelp - For questions, support, and beginner discussion\n* r/CryptoMarkets - For news, exchange, and trading discussion\n* r/CryptoCurrencyMoons - For Moons discussion\n* r/CryptoCurrencyMeta - For meta discussion about r/CryptoCurrency or networked subreddits\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "2025-07-28T15:37:39",
      "15%. Pussy!"
    ],
    [
      "2025-07-28T15:38:13",
      "Classic moving of the goalposts lol. You said it wouldn’t increase by more than 20%. It then increased by more than 40% within 2 months. You were wrong, accept it."
    ],
    [
      "2025-07-28T15:38:32",
      "I can't answer that. Either you pay more money to hire a forensics expert, find other evidence (like spending coincidences) and press charges, seek an attorney and go to civil court, or call it a loss. \n\nWho all had access to the account? \nThe perp is in that list most likely."
    ],
    [
      "2025-07-28T15:39:05",
      "The entire Moon pump has now been erased just as expected. The bears always win."
    ],
    [
      "2025-07-28T15:40:00",
      "Is the dip buying here with us right now?"
    ],
    [
      "2025-07-28T15:40:14",
      "If you think this is the dump, wait till tomorrow when Jpow opens his shit partisan mouth"
    ],
    [
      "2025-07-28T15:42:51",
      "Results + press conference are in 2 days"
    ],
    [
      "2025-07-28T15:42:57",
      "If you can sell them for money, how are they a scam?"
    ],
    [
      "2025-07-28T15:43:15",
      "With wich hashrate i cant find that info hm"
    ],
    [
      "2025-07-28T15:43:21",
      "-0.2% day\n\nComments: SEE YOU GUYS AT 23k"
    ],
    [
      "2025-07-28T15:43:53",
      "BTC sneeze alt bleed. Slowly bleeding out the monthly gains again"
    ],
    [
      "2025-07-28T15:43:57",
      "Yep, that's the reason I use multiple hardware wallets."
    ],
    [
      "2025-07-28T15:44:30",
      "Transactions happen in seconds. Volatility is irrelevant"
    ],
    [
      "2025-07-28T15:45:51",
      "Welcome to what it sounds like for 6 hours a day from the same 3 anti-burger posters lol. Meanwhile we're still over 118k btc and over 3800 eth. It's always just their worthless shitcoins that tank."
    ],
    [
      "2025-07-28T15:46:39",
      "15% is not even an allocation for ants when it comes to BTC 😎"
    ],
    [
      "2025-07-28T15:48:14",
      "Probably brute forced. Unlikely, but not impossible."
    ],
    [
      "2025-07-28T15:49:51",
      "I mean I don't think any body is keeping 85% of their investing money in cash. Stocks exist too."
    ],
    [
      "2025-07-29T11:57:53",
      "I use Tangem cold wallet and highly recommend it. The app is open source, it supports one of the largest ranges of tokens and has had zero hacks to date. Super easy to use and very secure, great option if you’re looking for solid cold storage with wide asset support."
    ],
    [
      "2025-07-29T11:58:16",
      "ETH is an alt"
    ],
    [
      "2025-07-29T11:58:47",
      "Audits aren't really applicable here."
    ],
    [
      "2025-07-29T12:51:49",
      "Sorry for the confusion, I keep 6 months of income in savings. Half in a normal hysa and the other on River. It's USD on River making interest in Bitcoin. \n\nI'm slowly converting River's savings into Bitcoin but will likely always keep 3 months worth in USD."
    ],
    [
      "2025-07-29T12:52:19",
      "That is not the question. Everyone knows Solana is shit. OP is arguing mechanics where they gather to reach consensus. \n\nWhat's wrong with the approach that they gather in discord channels to discuss rollbacks or resets"
    ],
    [
      "2025-07-29T12:52:54",
      "Which will ultimately go to zero because the security model doesn’t work because nobody actually uses the network. And nobody uses the network because block space is limited. The limited block space causes fees to be too low over time because once the transaction cap is reached, fees spike exponentially, which is not a stable equilibrium. The only stable equilibrium exists with low fees."
    ],
    [
      "2025-07-29T12:52:59",
      "Here we go again with the eyeing"
    ],
    [
      "2025-07-29T12:53:11",
      "All the responses are a perfect example of why its smart to go against sentiment here. Nobody knows what they are talking about lol."
    ],
    [
      "2025-07-29T12:53:13",
      "Burgers to save the day"
    ],
    [
      "2025-07-29T12:57:10",
      "So you think it will start later as expected in Q4 to first kill the last hope?"
    ],
    [
      "2025-07-29T12:58:07",
      "Not going to happen. The selling pressure would be insane even at $200k BTC. We were only $16k 3 years ago, and $50k 1 year ago. We're gearing up for a bear market in 2026 not a \"gigachad\" rally to $500k"
    ],
    [
      "2025-07-29T12:58:41",
      "Even Bitcoin has been rolled back before"
    ],
    [
      "2025-07-29T12:58:59",
      "it's always the same format, a guy saying he is making money with a trick he learnt from another guy, and he post the other guy nickname.\n\n\nThe same post in many subs, ever day!"
    ],
    [
      "2025-07-29T13:00:05",
      "tldr; Hacken and QANplatform have launched an open-source AI-powered blockchain threat modeling tool designed to enhance security audits for web3 projects. The tool, compatible with various AI models, helps developers identify threats, plan attack scenarios, and execute tests, significantly improving audit efficiency and depth. Initially used to audit QANplatform's QVM, the tool uncovered 22 potential issues from over 2800 test cases. It aims to empower secure and rapid blockchain development and is available on Hacken's GitHub.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "2025-07-30T00:15:11",
      "There’s some truth to all mythical creatures"
    ],
    [
      "2025-07-30T00:15:11",
      "Macro strategy"
    ],
    [
      "2025-07-30T00:15:31",
      "There certainly is a case for BTC to go up forever. Memecoins no, BTC yes."
    ],
    [
      "2025-07-30T00:16:23",
      "1 million people eliminated from ever being able to own a full BTC"
    ],
    [
      "2025-07-30T00:19:59",
      "Wonderful strategy - until everyone in their fund wants their money back all at once."
    ],
    [
      "2025-07-30T00:24:41",
      "Is there a way to check if my trezor uses a passphrase?? Had no idea this was a concept and would definitely want to confirm I have my passphrase somewhere lol"
    ],
    [
      "2025-07-30T00:25:51",
      "Only thing Powell is lowering is crypto prices…"
    ],
    [
      "2025-07-30T00:27:18",
      "It is, you're just late"
    ],
    [
      "2025-07-30T00:28:10",
      "Tether keeps printing and price keeps getting supported lol. 1.5 billion more in a week"
    ],
    [
      "2025-07-30T00:29:16",
      "It’s not a fund… it’s an equity. The long mstr holders can’t get there money back unless they sell and even then there’s no requirement for btc to be sold"
    ],
    [
      "2025-07-30T00:30:22",
      "Nobody said anything about indexes. Just pointing out that it has vastly beat inflation since the 2 time frames that this commenter claims it’s not keeping up with inflation. I think he’s literally comparing today’s gold price with 1970s homes prices, that’s the only way you’ll get 10 homes with a bar of gold, and it would still have to be a pretty big bar of gold lol."
    ],
    [
      "2025-07-30T00:31:12",
      "Well it’s certainly done well the last 15 years"
    ],
    [
      "2025-07-30T00:31:15",
      "I guess you could have more of a point if 2021 was the only bullrun that crypto has seen. I guess you mustve not known about the 2013 or 2017 runs. So of course it isnt a guarantee but it likely will run hard once fomo kicks in like it has done like a few times now."
    ],
    [
      "2025-07-30T00:32:44",
      "Question for anyone reading this.\n\nWith all the insane bullishness arising around keeta: kraken listing (totally hosted by them, no payment), whales starting to fomo in and mainnet going live very soon, what’s stopping you from getting in? \n\nGenuinely curious."
    ],
    [
      "2025-07-30T20:18:19",
      "It's a lot easier to say you're not missing a block when you purposefully forked the chain to undo some transactions that people didn't like. You might say that every transaction on Ethereum Classic since that fork is now missing from Ethereum's ledger, so I'd say that's a bunch of missing blocks."
    ],
    [
      "2025-07-30T20:18:19",
      "It's a lot easier to say you're not missing a block when you purposefully forked the chain to undo some transactions that people didn't like. You might say that every transaction on Ethereum Classic since that fork is now missing from Ethereum's ledger, so I'd say that's a bunch of missing blocks."
    ],
    [
      "2025-07-30T20:19:02",
      "Basically.\n\nIs this a bad thing? It has been much more successful for me than throwing $20k at XRP's new ATH and then losing 20% of it, and crying on reddit. 🤷‍♂️\n\nI'm open to criticism of the strategy. But I won't be taking criticism from bag holders, and I feel like a *lot* of people in here are exactly that."
    ],
    [
      "2025-07-30T20:19:12",
      "you're getting downvoted for shilling and using chat GPT to shill."
    ],
    [
      "2025-07-30T20:20:09",
      "Never even heard of it which is already an alarm bell ringing, having to contact on discord is another"
    ],
    [
      "2025-07-30T20:20:28",
      "Imma be real, I had no idea what swing trading even was, this was just a longer term strategy for making money in more volatile markets. \n\nIt's kept me from bag holding (something I have done year prior) and has been mostly successful so far."
    ],
    [
      "2025-07-30T20:20:31",
      "Market cap has nothing to do with profits."
    ],
    [
      "2025-07-30T20:20:53",
      "I like XRP, its made me a not inconsequential amount of money"
    ],
    [
      "2025-07-30T20:21:03",
      "And we’re back to .70 what a ride"
    ],
    [
      "2025-07-30T20:21:18",
      "That wasn’t the argument. The argument is purely based on people saying that certain price projections are impossible based on “market cap”"
    ],
    [
      "2025-07-30T20:21:36",
      "What does a digital assets report have to do with Powell? Sounds like you're confusing this with FOMC today."
    ],
    [
      "2025-07-30T20:22:15",
      "Legit lol’d"
    ],
    [
      "2025-07-30T20:22:56",
      "Not necessarily bad.  But it doesn't prove anything about this type of market like you were trying to say.  Its just trading like in any kind of market.  You can still lose all of your trading pool or make bank.  Its just you always have skin in the game so you don't feel 100% of the fomo."
    ],
    [
      "2025-07-30T20:23:27",
      "I think you’re confused on what marketcap actually is, every crypto on the market is being advertised as some type of solution. Profitability has nothing to do with market cap. Xrp and all crypto currencies are currently and actively being traded like currencies."
    ],
    [
      "2025-07-30T20:24:03",
      "they didn’t undo any transaction, what they did was to modify the code of one contract btw, so no missing transactions. Again, that’s non related to uptime"
    ],
    [
      "2025-07-30T20:24:14",
      "Thank you for providing facts. People interpret way too much into \"insider\" sales when they sell small amounts of their holdings"
    ],
    [
      "2025-07-30T20:24:44",
      "How can this be confusing at all. \n\nFor the BTC sale it was a long term holder.\n\nIn XRP's case it is one of the \\*founders\\*.   \nCan't you see the difference ? \n\nAdditionally, the long term holder of BTC doesn't have any anymore. And it is an extremely rare   \noccurrence. \n\nThe founder on the other hand still has ungodly amounts of XRP to sell.  \n  \nIf you can't see why the comparison is nonsensical I don't want to discuss this with you frankly, it would be a waste of time."
    ],
    [
      "2025-07-30T20:24:59",
      "You can have a wallet and transfer inside the wallet to usdt or using peer to peer method"
    ],
    [
      "2025-07-30T20:25:00",
      "It doesn't mention CCIP, just interoperability. CCIP is Chainlink's interoperability protocol, but it isn't the only one in the industry."
    ],
    [
      "2025-07-30T20:25:00",
      "Hmmm, if that’s the case why do the founders of ETH and the ETH foundation sell ETH?\n\nWhy did Steve Jobs, creator of Apple, sell most his Apple shares? And same with other founders of the company?"
    ],
    [
      "2025-07-30T20:25:08",
      "Ethereum Classic (ETC) isn't a breach to the current Ethereum (ETH) network runtime, but rather the embodiment of a fundamental disagreement about whether that runtime should have ever been altered. Following the 2016 DAO hack, the Ethereum community executed a hard fork—an intentional change to the network's rules and state—to reverse the theft. The chain that implemented this change became the modern ETH network. However, a faction of the community rejected this intervention, championing the principle of absolute immutability (\"code is law\"). They continued to validate the original, unaltered blockchain where the hack remains a permanent part of the transaction history. This original chain is Ethereum Classic (ETC). Therefore, ETC represents a preserved, historical version of the runtime that the main ETH network chose to abandon, standing as a permanent fork and a philosophical counterpoint to ETH's decision to modify its own ledger."
    ],
    [
      "2025-07-30T20:25:13",
      "Good bot"
    ],
    [
      "2025-07-30T20:25:31",
      "> Its just you always have skin in the game so you don't feel 100% of the fomo.\n\nI think this is what I mean. \n\nLike, you emotionally compose yourself to NOT buy with ALL of your liquid when you see it go down or up a bit, so you're not locked into an asset that you start out negative on.\n\nI do this mostly because I don't trust etherium 100% to just pump from here on out. And I fully expect there to be a bear market in the next years. \n\nIf I didn't, I would just put money in and leave it to do its thing."
    ],
    [
      "2025-07-30T20:26:04",
      "Not the case."
    ],
    [
      "2025-07-30T20:26:19",
      "i know what etc is, but is non related to runtime"
    ],
    [
      "2025-07-30T20:26:20",
      "But you said:  \n\"You can also safely store a passphrase on the internet if you like, since it is useless unless paired with a seed phrase. \" \n\nAnd then you said:  \n\"A passphrase is a password to enter a specific wallet on the blockchain. You don’t need the original hardware wallet. Any hardware wallet from any brand will work.\"\n\nThose two statements seem contradictory. If having the passphrase means you can retrieve the funds without the original wallet then if someone gets your passphrase they have everything they need right?\n\nOr do you mean a passphrase is like one derivation path of an HD wallet with the seed phrase being the parent?"
    ],
    [
      "2025-07-30T20:26:32",
      "Only being used by Swift, DTCC, JP Morgan, Clearstream, euroclear, should I go on?"
    ],
    [
      "2025-07-30T20:26:36",
      "You are correct it wasn’t Jed it was Larson who sold."
    ],
    [
      "2025-07-30T20:26:51",
      "look at the graph and you'll see ccip mentioned."
    ],
    [
      "2025-07-30T20:26:54",
      "I mean yeah... kinda manipulated headline."
    ],
    [
      "2025-07-30T20:27:53",
      "Even the price remained consistent, is it a stable coin?"
    ],
    [
      "2025-07-30T20:28:01",
      "We won't have deflation.  Fed proved that in 2008-2009.  They will print all the fiat they have to in order to prop shit up.  Deflation should have happened in that crash just like in the Great Depression of the '30s."
    ],
    [
      "2025-07-30T20:28:10",
      "The only chain that can give guaranteed downtimes 🗣🗣🗣"
    ],
    [
      "2025-07-30T20:28:50",
      "Imagine thinking somebody making 100million for less then half a percent of a portfolio means doom amd gloom"
    ],
    [
      "2025-07-30T20:28:51",
      "I just checked, Swissborg seems to be unaffected by the ban since it's not considered as a trading platform/CEX."
    ],
    [
      "2025-07-30T20:28:53",
      "Quite crazy that just 4 years back we all dreamed of institutional adoption like this of Crypto and now we are actually here..."
    ],
    [
      "2025-07-30T20:29:27",
      "Are you paid by someone or just really really stupid?\n\n[https://imgur.com/uWniUgr](https://imgur.com/uWniUgr)"
    ],
    [
      "2025-07-30T20:29:28",
      "Remember guys, no profits until you actually take em"
    ],
    [
      "2025-07-30T20:30:00",
      "I was just looking at this yesterday"
    ],
    [
      "2025-07-30T20:30:00",
      "You don't see that they're using the exact workflow that chainlink designed as their standard for how an Oracle should operate as meaning anything? Ok, fine. Still disingenuous to act like the ripple mention was anywhere close to the same thing. \n\nSecond mention of chainlink is also a reference to an article that chainlink themselves published about tokenized assets."
    ],
    [
      "2025-07-30T20:30:06",
      "tldr; Ethereum is experiencing sustained growth driven by an 8% rise in whale wallets holding 10,000 ETH or more, adding 90 new addresses in two weeks. This contrasts with Bitcoin, where whale activity declined by 1.61%. Ethereum's price, near $2,972, is supported by expanding use cases in DeFi and blockchain applications. Institutional interest and technical indicators suggest continued upward momentum. Ethereum's utility-driven appeal positions it as a preferred asset for innovation-focused investors, while Bitcoin shows signs of market maturity.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "2025-07-30T20:30:09",
      "Found a nazi.  👆"
    ],
    [
      "2025-07-30T20:30:33",
      "Makes sense as now there are proper ETH ETFs..."
    ],
    [
      "2025-07-30T20:30:52",
      ">While the vast majority of stakeholders adopted the change and the fork was implemented, not everyone was on board. As a result, the hard fork resulted in two competing — and now separate — Ethereum blockchains. Those who refused to accept **the hard fork that rolled back** the blockchain’s history supported the pre-forked version — now known as Ethereum Classic (ETC). The blockchain presently known as Ethereum is the blockchain that implemented the hard fork and altered the blockchain’s history — and the history of blockchain as a whole.\n\nhttps://www.gemini.com/cryptopedia/the-dao-hack-makerdao\n\n\nIt was absolutely rolled back!  No one tried to hide it but they reversed $60,000,000 of stolen ether"
    ],
    [
      "2025-07-30T20:30:54",
      "yeah it was, unless your a nazi pedo trumper."
    ],
    [
      "2025-07-30T20:31:06",
      "No test transaction smh..."
    ],
    [
      "2025-07-30T20:31:49",
      "Yeah, this us just peanuts and some finally some article topic for these \"journalists\"."
    ],
    [
      "2025-07-30T20:32:28",
      "How about chain roll backs?"
    ],
    [
      "2025-07-30T20:32:34",
      "All Crypto subs are quiet when it comes to acknowledging their own issues..."
    ],
    [
      "2025-07-30T20:33:32",
      "When it comes to BTC I got diamond hands."
    ],
    [
      "2025-07-30T22:41:00",
      "Sure pal. You smarty pants big boy. You want a sticker for your Nobel prize level economic analysis?"
    ],
    [
      "2025-07-30T22:41:04",
      "No we gotta make everyone know bitcoin did the same and deleted billions of bitcoin in circulation. No hiding here"
    ]
  ],
  "Bitcoin": [
    [
      "2025-07-28T15:19:18",
      "\"PayPal noted that any new product or service for New York residents requires approval from the New York State Department of Financial Services, which has not yet been received for this service.\"\n---\nUhg, I hate being into crypto and being in NY"
    ],
    [
      "2025-07-28T15:19:42",
      "Best way to make money is with other people’s money. As long as you have a safety net it’s worth leveraging a little healthy amount of your portfolio. I earned a free .4 bitcoin after doing a similiar strategy last year with credit card cash advance @5%. "
    ],
    [
      "2025-07-28T15:19:48",
      "I'm not either; I don't use QR codes for my anything having to do with private keys. I wouldn't trust the QR code generator that creates it or the firmware of the camera that scans it or the software that interprets the image. \n\nI only meant to say that those who DO use QR codes are almost certainly generating them via software, and that's a HUGE op sec risk they probably haven't considered."
    ],
    [
      "2025-07-28T15:19:57",
      "I agree BUT, what we all know now is  BTC is in ATH territory and given past historical data, (as with everything) a correction is coming. It’s very easy and natural for BTC to have a correction of 20-30% or more from its high.  Would you invest 120k now or wait a few months or even a year?"
    ],
    [
      "2025-07-28T15:20:04",
      "How will this work for the buyer in practice?\n\nDo I, as a buyer, have to send some BTC to PayPal first in order to have a BTC balance inside it?\n\nDo I instead have the option of setting up a Lightning channel with PayPal, so that I sent the money via Lightning at the moment I'm making the PayPal purchase?"
    ],
    [
      "2025-07-28T15:20:12",
      "Folk like you…. 🤣"
    ],
    [
      "2025-07-28T15:20:35",
      "So not printing makes the line go????"
    ],
    [
      "2025-07-28T15:21:22",
      "150% you say?"
    ],
    [
      "2025-07-28T15:21:23",
      "You can keep a-knockin’ but ya can’t come in"
    ],
    [
      "2025-07-28T15:21:34",
      "Dont speak to anyone in the private DM man.\n\nOnly one plan is to buy a wallet like Trezor etc... directly from Trezor and not a 3rd party company.\n\nInput your seed and enjoy  the fruits. Kinda like life 😌"
    ],
    [
      "2025-07-28T15:21:35",
      "How much is insurance?"
    ],
    [
      "2025-07-28T15:21:52",
      "I saw something like that on South part recently"
    ],
    [
      "2025-07-28T15:21:59",
      "Dude stfu that’s where I hid my seed phrase"
    ],
    [
      "2025-07-28T15:22:03",
      "I buy mine on Nexo since I keep it there to earn interest - it's just a simple way to let it grow passively. Also, if I ever need cash, I can borrow against my BTC instead of selling it, which helps me stay exposed long-term. You can always move it to a hardware wallet like Trezor later, but Nexo's been a solid starting point for me. Just depends on how active you want to be."
    ],
    [
      "2025-07-28T15:22:15",
      "Haha, I had the same happen. I love that you refer to it as dust. Apt description. Was literally the dust left over from some stupid Silk Road transaction back in 2013 now worth a few bucks short of ~$9k. 🫠"
    ],
    [
      "2025-07-28T15:22:22",
      " hope you find millions in there."
    ],
    [
      "2025-07-28T15:22:45",
      "Once-upon-a-time I was in Turkey buying a hand made rug. It was before the euro. The exchange rate was crazy and I had to count the number of zeros written on the credit card slip multiple times as one wrong zero and the rug was no longer a good deal. Now bitcoin has the same challenge."
    ],
    [
      "2025-07-28T15:23:08",
      "Yeah good if you have that cash on the side for an emergency but I’ve been burned before and it hurts."
    ],
    [
      "2025-07-28T15:23:16",
      "I guess when bitcoin reaches 1M US$, and the Satoshi is the cent, the protocol will be upgraded and some subsatoshis introduced... so one BTC will become way more worth than 1 Million."
    ],
    [
      "2025-07-28T15:23:46",
      "Hey man you're not being frequently optimistic"
    ],
    [
      "2025-07-28T15:23:55",
      "That is awesome congrats on that! High risk high reward"
    ],
    [
      "2025-07-28T15:24:23",
      "Retarded risk level... I can't fathom imagining this type of stress in my life."
    ],
    [
      "2025-07-28T15:24:41",
      "We want update !!"
    ],
    [
      "2025-07-28T15:24:42",
      "Most regarded post I’ve seen thus far."
    ],
    [
      "2025-07-28T15:25:08",
      "BOSH"
    ],
    [
      "2025-07-28T15:26:33",
      "It's been going down for decades. Wild that the speed of it is increasing right now. \n\nExample. In just this year we've seen staple items here in the us like coffee go up in us fiat dollars by 30-40% in 6 months."
    ],
    [
      "2025-07-28T15:27:02",
      "Funniest post ive seen"
    ],
    [
      "2025-07-28T15:27:14",
      "You can make 3 6s with this logo"
    ],
    [
      "2025-07-28T15:27:18",
      "lol!\n\nsure, do that math and let me know the number you come up with.\n\n$1000 bought at .01btc\n\nbtc = $118,000\n\ndon't hurt yourself! ;)"
    ],
    [
      "2025-07-28T15:27:21",
      "What’s if it’s the old protocol before the seed words?"
    ],
    [
      "2025-07-28T15:27:24",
      "🤣"
    ],
    [
      "2025-07-28T15:27:25",
      "This"
    ],
    [
      "2025-07-28T15:27:53",
      "Also, use a secure device if there is the possibility you own any bitcoin."
    ],
    [
      "2025-07-28T15:28:02",
      "They buy it daily for you (along with everyone else in batches Id assume) and then make one deposit into your acct at end of month and the cost at time of deposit is your cost basis for that btc, so no different than a small monthly buy for tax purposes, if people are used to doing that already. Idk, I don't sell so I don't worry about taxes haha. Obvs this becomes more \"worth\" it if you have large amts of cash sitting their waiting on dip buys, etc, but free btc is free btc. In 10yrs it will be like having gotten 38% on it imo."
    ],
    [
      "2025-07-28T15:28:05",
      "everyone will FUD this but praise Saylor... hypocrites. rules for thee and not for me is self imposed by the plebs it seems"
    ],
    [
      "2025-07-28T15:28:12",
      "A lot of people said that last year too.  How many years will you spend staying poor by being afraid of going poor?"
    ],
    [
      "2025-07-28T15:28:15",
      "Yes."
    ],
    [
      "2025-07-28T15:28:34",
      "I can think of 10 reasons why I think this is true."
    ],
    [
      "2025-07-28T15:29:53",
      "Please get a reputable hardware wallet and input it there, do not share that phrase with anyone!!"
    ],
    [
      "2025-07-28T15:30:04",
      "That comment, \"to get rich - no,\" is funny. First, what is the definition of \"rich\"? It can mean many things. Owning sound money that can't be controlled by a single government, central bank, or any other entity can already be defined as being rich. \n\nIf your definition of \"rich\" is having millions in fiat terms and have strong purchasing power, in my opinion, it's still truly possible as long as fiat money is devalued over time. It all depends on your time span to hodl!"
    ],
    [
      "2025-07-28T15:30:22",
      "Yo, make sure to give an update when you get the funds back!"
    ],
    [
      "2025-07-28T15:30:23",
      "You could go to croatia. Italian is still spoken and understood by many people in the istria region. It’s a beautiful place, with great food. Fairly low taxes compared to Italy, and no capital gains tax on crypto if you hold it for 2 years."
    ],
    [
      "2025-07-28T15:30:36",
      "Welcome to the fiat stabilized BTC loan club. \n\nCongrats on doing it successfully as well !"
    ],
    [
      "2025-07-28T15:31:22",
      "I bet there would be a lot of fun speculation about this"
    ],
    [
      "2025-07-28T15:31:35",
      "so if we ignore gas, we could say around 10k a year should be put aside for a lambo?\n\nYou need to buy some new tires and brakes sometimes.."
    ],
    [
      "2025-07-28T15:31:42",
      "🤔"
    ],
    [
      "2025-07-28T15:31:57",
      "link it if you can find it"
    ],
    [
      "2025-07-28T15:32:03",
      "Thanks. I’d be hesitant to do it near all time highs. I’ll definitely do it again if/when we drop 50% though. "
    ],
    [
      "2025-07-28T15:32:20",
      "You don't know the wallet address?"
    ],
    [
      "2025-07-28T15:32:22",
      "Can the bullish news be even more bullish than this?"
    ],
    [
      "2025-07-28T15:32:29",
      "Congrats sir"
    ],
    [
      "2025-07-28T15:32:30",
      "I sold 3. I bought them from 300 each and sold by 1,9K each. After that I bought and sold multiple times. Yes, I could be millionaire, if I have lost access to my keys. But I was racional and I am happy for my choices."
    ],
    [
      "2025-07-28T15:32:36",
      "ya that's why the recent person who sold 8B of BTC that they held since 2011 is absolutely insane to me. What is 8B today was 1B 3 years ago. That kind of flunctuation just absolutely insane. I read the OG white paper, and I tried to buy BTC when it was a few hundred but couldnt figure out how, and i had an account with MT. Gox so its irrelevant and most would be gone now anyway!"
    ],
    [
      "2025-07-28T15:32:44",
      "So taking a HELOC to pay for a pool would be better?  Refinished basement?  How about a vacation?\n\nNone of those things are liquid but people do it and no one cares.  Its called risk management, open your eyes."
    ],
    [
      "2025-07-28T15:32:45",
      "So in case I loose it you guys have a copy I can ask. That’s not bad :’)"
    ],
    [
      "2025-07-28T15:33:00",
      "It was 1000 BTC and 10000 BTC not so long ago. Soon it will be 10"
    ],
    [
      "2025-07-28T15:33:20",
      "Crazy down day"
    ],
    [
      "2025-07-28T15:33:36",
      "Yeah? Well I get 5% cash back on groceries with my credit card and I convert that to BTC at the end of every month. So I guess me and you kind of run in the same crowd.\n\n/S"
    ],
    [
      "2025-07-28T15:33:46",
      "How does he find the wallet address?"
    ],
    [
      "2025-07-28T15:34:10",
      "It has been like that ever since BTC was created."
    ],
    [
      "2025-07-28T15:34:16",
      "I did the same with the maximum 401k loan I could take around the same time.  I haven't dipped into CC's yet because I'd rather put that into my IBC policy and keep loaning against that for essentially zero risk."
    ],
    [
      "2025-07-28T15:34:43",
      "Now Imagine, some pleb is saving in btc. After some years hes buying a normal car, like a used / newer toyota corolla and he spends 5-10% of his networth on that car.\n\nStill retarded af?  I mean, do we judge the car here? or just the amount % you spend of your portfolio on a car?\n\nSpending 5-10% of your networth for a car seems okay , you still have 95-90% of your stack that will grow over the years and give you very nice gains."
    ],
    [
      "2025-07-28T15:34:43",
      "Just don't let anyone know you own one. Buy it anonymously. Don't use your banking info or card. Do not ship to your home. Don't use your email for the transaction."
    ],
    [
      "2025-07-28T15:34:46",
      "This will get locked for being loosely related to potus 😅"
    ],
    [
      "2025-07-28T15:34:47",
      "Oh yeah def wouldn’t consider it now. But if we drop to 60-75K again I will def consider it. Even though I think the lowest we go is like 80-85K ish."
    ],
    [
      "2025-07-28T15:35:06",
      "They took out a HELOC to buy bitcoin 😂 clearly they do not have a safety net"
    ],
    [
      "2025-07-28T15:35:09",
      "You're on some sort of degen throwaway account. Stop offering your gambling trays to people. Reported and absolutely banned."
    ],
    [
      "2025-07-28T15:35:32",
      " This is not a controversial topic. Bitcoin as built around the idea of countering deflationary fiat.  \n\nNo one is going to argue with you."
    ],
    [
      "2025-07-28T15:35:44",
      "It’s the illuminati - I knew it"
    ],
    [
      "2025-07-28T15:36:05",
      "I sold a large chunk of my coin last night from cold storage to pay off the house. I think we're near the top of the cycle FWIW. The first transfer from Ledger took \\~3 hr and the second was almost instantaneous. The coin was immediately available to sell on CB. Sold to cash immediately and set up a bank transfer for the cash dollar (that \"coin\" will take 3 days lmao). I got a nice bump from when I started the process early in the day from 118 to 119. I'll start buying again (more than the usual DCA) after the dip."
    ],
    [
      "2025-07-28T15:36:25",
      "Funny to watch as these numbers change from 0% to 1%, 2%, 5% and now 15%"
    ],
    [
      "2025-07-28T15:36:37",
      "Can users pay via Lightning, anonymously?"
    ],
    [
      "2025-07-28T15:37:33",
      "It is insane yes. \n\nIt's actually why banks exist. Even in the wild west they used banks because the mattress/gold jewellery wasn't secure enough. One robbery and you're done."
    ],
    [
      "2025-07-28T15:37:37",
      "What stress?  Its called risk management.\n\nI left most in an exchange early on to manage stop losses just in case, peeled off most of it to cold storage as it went up, and I have more BTC than this to backstop any issues if I were to lose my job.\n\nYou're fear of staying poor is keeping you poor."
    ],
    [
      "2025-07-28T15:37:44",
      "This guy seeking help could be the scammer though"
    ],
    [
      "2025-07-28T15:38:18",
      "That's the top, bottom crease is at the other end"
    ],
    [
      "2025-07-28T15:38:19",
      "ohhh right, yeah it's hard to find, but i think there's a couple of options to get non kyc btc"
    ],
    [
      "2025-07-28T15:38:34",
      "same my friend\n\n\\*wrote that comment from istone 2 sitting in my cave, warming myself near the fire"
    ],
    [
      "2025-07-28T15:38:37",
      "You don't know anything FWIW"
    ],
    [
      "2025-07-28T15:39:04",
      "You should sell enough to pay off the loans numb nuts"
    ],
    [
      "2025-07-28T15:39:16",
      "The addresses are derived from the seed phrase. If you have the seed phrase, you have everything you need."
    ],
    [
      "2025-07-28T15:39:20",
      "that's the goal!"
    ],
    [
      "2025-07-28T15:39:23",
      "Karma farmer..."
    ],
    [
      "2025-07-28T15:39:47",
      "ROFL...an app "
    ],
    [
      "2025-07-28T15:40:22",
      "It's reddit. %99.9999 of the people here are bots and the other .0001% are on throwaway accounts because they're on their sixth consecutive permaban for disagreeing with something CNN said"
    ],
    [
      "2025-07-28T15:40:28",
      "100% correct"
    ],
    [
      "2025-07-28T15:41:19",
      "100% I'd still like to see more retail coming in, I don't love the \"paper bitcoin\" etf thing"
    ],
    [
      "2025-07-28T15:41:44",
      "Exactly.  All I'm doing is using my capital on an asset that has never been negative on a 200 wma."
    ],
    [
      "2025-07-28T15:41:45",
      "That last comment was a bit unnecessary. Don’t gotta be an asshole"
    ],
    [
      "2025-07-28T15:41:57",
      "Wait how many pixels long is that? 17 or 27?"
    ],
    [
      "2025-07-28T15:42:29",
      "That part. The wallet is just an interface. The Blockchain is where your crypto lives."
    ],
    [
      "2025-07-28T15:42:46",
      "Too many shitcoins not enough bitcoins"
    ],
    [
      "2025-07-28T15:42:57",
      "You're asking in a Bitcoin sub, don't mean to be rude but what do you think the response is going to be? \n\nBut a serious reponse, plot all of those vs BTC price and zoom out. Notice the pattern? When you can understand why that is the case, your answer will be crystal clear. Unfortunately, nobody can force you to understand it, you need the curiosity to try to find the answer yourself. Good luck!"
    ],
    [
      "2025-07-28T15:43:53",
      "That's because the rest of my safety net is already in BTC and I needed to make use of dormant capital in my home.  We're not the same."
    ],
    [
      "2025-07-28T15:44:24",
      "balsy bro!\n\ncongrats!"
    ],
    [
      "2025-07-28T15:44:28",
      "That's my only question about Bitcoin. If fiat goes away, what is Bitcoin attached to and how much is it worth if it's not valued in USD? I want to be able to explain this to my family."
    ],
    [
      "2025-07-28T15:44:37",
      "Nah bro, it's fake 🐱"
    ],
    [
      "2025-07-28T15:44:37",
      "Nah bro, it's fake 🐱"
    ],
    [
      "2025-07-28T15:45:06",
      "I would almost want to opt out of the \"interest in BTC\" due to the headache factor.  I would rarely hold cash in a crypto exchange and it would likely be small amounts."
    ],
    [
      "2025-07-28T15:45:09",
      "Okay then send me some token of love\n\n15ovqKVn1L4eMwrnyPDxeFC2ywMeALNEnV\n\nThis is my adres.... \n\nTha ks in advance for sending ..✌"
    ],
    [
      "2025-07-28T15:45:20",
      "Love it, I've earned $6k (gains included) in BTC from Fold and Gemini card rewards in the past year.  Every dollar I spend goes on them."
    ],
    [
      "2025-07-28T15:47:04",
      "This is how you stay poor.  I'll keep it at max leverage for now.  I said I'd sell at $150k but I don't think I will."
    ],
    [
      "2025-07-28T15:47:19",
      "Why not just buy bitcoin etf in your 401k? All you have to do is link a brokerage account.\n\nYou basically shifted all the advantages of the retirement vehicle to end up  worse off. "
    ],
    [
      "2025-07-28T15:47:22",
      "What is the price in BTC of a new Lambo now?"
    ],
    [
      "2025-07-28T15:47:49",
      "You don’t think the guy he responded to was being an asshole when he called this guys risky move “retarded”?"
    ],
    [
      "2025-07-28T15:47:53",
      "Main street = retail. Loads of retail volume in ramping on via the etfs rather than onchain. This means ‘retail’ is just ad much present in the institutions part of this graph. This graph is misleading."
    ],
    [
      "2025-07-28T15:47:55",
      "Wasn't that risky. Anyone paying attention knew Bitcoin would beat 5% interest over a 12 month period then. I took multiple 0% APR cash advance CC offers around then."
    ],
    [
      "2025-07-28T15:48:06",
      "But I'm retarded...  OK"
    ],
    [
      "2025-07-28T15:48:12",
      "Get a loan without involving bitcoin."
    ],
    [
      "2025-07-28T15:48:29",
      "Wasn't that risky. Anyone paying attention knew Bitcoin would beat 5% interest over a 12 month period then. I took multiple 0% APR cash advance CC offers around then."
    ],
    [
      "2025-07-28T15:48:38",
      "Those who can and want to have a bit of fun, rent a Lambo"
    ],
    [
      "2025-07-28T15:48:40",
      "No dice."
    ],
    [
      "2025-07-28T15:48:59",
      "I remember it, but I have another engraved steel plate for this..."
    ],
    [
      "2025-07-28T15:49:46",
      "BTC=BTC might replace all fiat eventually if adoption gets to 100%. We will all love in BTC utopia and pay through BTC. After all BTC can be divided into infinity.\n\n But if you want my honest opinion, then i dont know."
    ],
    [
      "2025-07-28T15:49:49",
      "Oh no! This random Redditor just “absolutely banned” you. Lmaooo. God I love the internet and the weirdos that it brings out."
    ],
    [
      "2025-07-28T15:50:00",
      "Wait for the dip to happen I can't affrord 120k 100k here we go"
    ],
    [
      "2025-07-28T15:50:08",
      "Part of the security model for DIY hardware is that the vendor selling you the Raspberry Pi doesn't know what you are going to use it for. \n\nSo the main risk for buying fake commodity stuff off Aliexpress is that it may not work."
    ],
    [
      "2025-07-28T15:50:21",
      "You should be fine man. Also answer my DMs!!!!\n\n/s"
    ],
    [
      "2025-07-28T15:50:39",
      "Very risky to take on debt to buy an asset as volatile as BTC. Also I churn credit cards very heavily, and have never heard of a CC that offers 0% APR cash advances. Balances transfers for sure. But not cash advances."
    ],
    [
      "2025-07-28T15:50:45",
      "You're playing the casino. I meant that with the deepest respect for your own good. Hope it works out!"
    ],
    [
      "2025-07-28T15:50:51",
      "a rogue anchor point lol  , i believe its an unintentional error in the svg file"
    ],
    [
      "2025-07-28T15:51:02",
      "Leveraging debt to acquire assets or more property (as bitcoins considered by law) is literally an investment strategy (albeit, I wouldn’t do it near all time highs) "
    ],
    [
      "2025-07-29T11:57:33",
      "It is when 'bitcoin goes to moon'"
    ],
    [
      "2025-07-29T11:58:04",
      "Good day to you dear commenter, i think he has done impressive work in both cases"
    ],
    [
      "2025-07-29T11:58:15",
      "What is this low effor shit? Nobody works for fiat money itself, but for the things they can buy with it."
    ],
    [
      "2025-07-29T12:52:22",
      "This is the problem: [https://youtu.be/YtFOxNbmD38?si=DRQez2RucQyA4kgK](https://youtu.be/YtFOxNbmD38?si=DRQez2RucQyA4kgK)"
    ],
    [
      "2025-07-29T12:52:23",
      "TBH, I think we will hang around 120K for a while, its a key level."
    ],
    [
      "2025-07-29T12:52:27",
      "It is one factor but there are others."
    ],
    [
      "2025-07-29T12:52:36",
      "There's no answer to your question.\n\nMy first ever BTC purchase was 20$. Bitcoin has gone up around 400% since then."
    ],
    [
      "2025-07-29T12:53:17",
      "BTC will do the opposite of what the majority thinks it will do.  Like always"
    ],
    [
      "2025-07-29T12:53:40",
      ">Trust Wallet is not good or safe. \n\nEvidence of it not being safe? It has 2 million+ reviews, 4.5 stars."
    ],
    [
      "2025-07-29T12:53:50",
      "next week we will read how the guy who actually didn't have 6.5 Billion, got his fingers chopped off anyway. This is too stupid all round"
    ],
    [
      "2025-07-29T12:53:55",
      "Because it's not a given fact, no one can predict the future. It's a game of \"what if\";\n\n\"what if I did put in 100% in 2025, I could have been rich\" \n\nvs\n\n\"what if I didn't put in 100% in 2025, I could still have some money now\"\n\nWith anything, but especially financial decisions, it's moderation. Yes you might lose some gains by not going all in but at least you got some gains. \n\nThink and plan ahead. Do you need an emergency fund in the near future? Do you have a house, kids, rent, car payments, education or any payments which require frequent bills to get paid? Do you miss a fast and reliable off-ramp to sell bitcoin to fiat?\n\nThen probably don't go all in, moderate. \n\nBut if you don't need it right now, in the near future or have a fast offramp, moderate less and go higher into Bitcoin."
    ],
    [
      "2025-07-29T12:54:28",
      "Snoop Dogg meets Willy Nelson high."
    ],
    [
      "2025-07-29T12:54:56",
      "People can guess but nobody knows for sure, just dca and hold."
    ],
    [
      "2025-07-29T12:55:06",
      "Yes! This is the question you want to ask strangers who know nothing about you, your family, your health, or your spending habits."
    ],
    [
      "2025-07-29T12:55:08",
      "Yeah, haven’t feel the hype yet indeed. But I will believe it will come fast, cause I believe the gov and top 1% have realized that BTV allow them to inflation carefree. \nI think that’s why Trump is so rushing to print money."
    ],
    [
      "2025-07-29T12:56:58",
      "[https://unchainedcrypto.com/goldman-sachs-and-bny-mellon-launch-tokenized-mmfs/](https://unchainedcrypto.com/goldman-sachs-and-bny-mellon-launch-tokenized-mmfs/)"
    ],
    [
      "2025-07-29T12:57:24",
      "Like my boy Jack Mallers says, \"I am willing to die on this hill\". I am 70% bitcoin and about to hit 80%. Most of the other 20% is my house and a teensy bit of cash and stonks (including MSTR 🤭)"
    ],
    [
      "2025-07-29T12:57:29",
      "I only love bitcoin and my girlfriend\n\nCrypto 🤮"
    ],
    [
      "2025-07-29T12:57:55",
      "It’s all relative to your situation. A high school kid 0.01 is a lot. A 30 year old working maybe wants to hit 0.1 as soon as they can. A professional in their 40’s probably needs over 1 to feel anything. Etc."
    ],
    [
      "2025-07-29T12:58:03",
      "What was the rationale behind the decision of shorting? I see no evidence of a major top, if you shorted it’s clearly a short term move."
    ],
    [
      "2025-07-29T12:58:12",
      "If we are not shorting BTC we are standing in piss water?!?!"
    ],
    [
      "2025-07-29T12:58:27",
      "Also poor and rich in this case."
    ],
    [
      "2025-07-29T12:58:55",
      "When we have everything we need, with help from advanced technology, we may no longer need to buy resources. Ai and robots theoretically could provide everything for us and take all of our jobs. \n\nThe world would hopefully be an abundant utopia able to get anything and use public networks as needed for free. Money wouldn’t be necessary. It could still exist as a niche or high class privilege. But ultimately once we are replaced and being served by robots we need a ubi or no money at all. \n\nThat’s my very rough idea and is kinda from Star Trek and the Orville where you get things based off your reputation, not money. \n\nA moneyless society is probably hundreds of years away if it ever happens. I think it will."
    ],
    [
      "2025-07-29T12:59:02",
      "Playing the market is useless for me. I’m here for the long run. I’ve accumulated enough BTC and I’m not selling any until I have nothing else to sell.\n\nSelling the best investment you can make is just heresy. IMO most people trying to time the market are greedy, late, trying to get rich quick, etc; and I would risk saying that for each one that succeed doing this 10 or 20 fail and just realize that they should have listened, hodl’d and stayed calm."
    ],
    [
      "2025-07-29T12:59:30",
      "It’s going forever, Laura"
    ],
    [
      "2025-07-29T12:59:38",
      "I think we get nice movements tomorrow but its ballzy to short now."
    ],
    [
      "2025-07-29T12:59:48",
      "Pointless question. Just get off absolute zero and buy what you can when you can without risking not being able to meet your other financial obligations. Time is money so stop wasting time speculating on hypotheticals and just start taking action"
    ],
    [
      "2025-07-29T14:20:15",
      "Making money on something doesn't make it not a shitcoin... enjoy your endless debasement with a fiat crypto."
    ],
    [
      "2025-07-29T14:20:16",
      "Can you repost this? Or dm me link?"
    ],
    [
      "2025-07-29T20:18:16",
      "Good thing about time locks is that even if seed or wallet is compromised they can't do nothing until timelock is over"
    ],
    [
      "2025-07-29T20:18:19",
      "It will go up but seeing all these posts on how it will more than x10 in the near future is crazy."
    ],
    [
      "2025-07-30T00:14:58",
      "You can use it to buy things like some people do. But why would you? It’s the apex asset."
    ],
    [
      "2025-07-30T00:14:59",
      "as the Steve Jobs of bitcoin"
    ],
    [
      "2025-07-30T00:15:05",
      "That’s actually a very good way to frame these 3 books!"
    ],
    [
      "2025-07-30T00:15:59",
      "This isn’t going to convince any skeptics. Plenty of smart, polished, and rehearsed people pushing all kinds of things."
    ],
    [
      "2025-07-30T00:16:06",
      "I have a decent 401k and some bitcoin. I diversified a little and bought 3 grams of gold. 🤣"
    ],
    [
      "2025-07-30T00:16:13",
      "That wealth is going to be split* among their kids. So the new gen is still kinda worse off"
    ],
    [
      "2025-07-30T00:16:18",
      "**3.6 million people** in the U.S. turned 20 years old in 2001. Sucks to be them."
    ],
    [
      "2025-07-30T00:17:16",
      "What will it manufacture? Strategy is already coming up with financial products to buy more BTC. Buying more BTC is the ultimate goal."
    ],
    [
      "2025-07-30T00:17:32",
      "You have a grammar error."
    ],
    [
      "2025-07-30T00:18:10",
      "We started on Coinbase, but are looking at Strike. We also use a Coinkite ColdCard MK4 for cold storage--it's air-gapped (meaning that your private keys never touch the Internet). If you are new to Bitcoin, and are on Instagram, you can look us up at Start with Sats. We're going to start posting content next week, but our goal is to make Bitcoin simple, clear & approachable because everyone deserves to build a better future with Bitcoin. We want to create a community to support those stacking sats and working towards their own financial security and freedom. Hope to see you on Insta and wish you the best of luck on your Bitcoin journey!"
    ],
    [
      "2025-07-30T00:19:03",
      "Broken Money!"
    ],
    [
      "2025-07-30T00:20:20",
      "Considering most of the replies are from idiots...I'd not ask the questions on Reddit."
    ],
    [
      "2025-07-30T00:21:02",
      "What about people who bought tops or even just prices that weren’t cheap like now? They may see the next bear and kick themselves for not having spare cash to DCA and realise that they’d have much more btc if they DCAed. That’s what happened to me"
    ],
    [
      "2025-07-30T00:21:26",
      "Millions of megawatts of energy isn't nothing"
    ],
    [
      "2025-07-30T00:21:45",
      "Congrats! How exciting for you! If you want continuing support on your Bitcoin journey, if you're on Instagram, you can follow us at Start with Sats (we're new and are going to start posting content next week). Our goal is to make Bitcoin simple, clear & approachable because everyone deserves to build a better future with Bitcoin. We also want to create a community for those that have bought into Bitcoin--whether they're stacking sats or wholecoiners like you. If you're on Insta, we'd love to see you! Best of luck! Your future self will thank you for your move!"
    ],
    [
      "2025-07-30T00:22:47",
      "If I were you, I would put whatever I want to give my son in a paper wallet. Then literally give him that. When he brings it back on the network he can pay the taxes on it. Someone has to pay the taxes."
    ],
    [
      "2025-07-30T00:22:59",
      "We put away MUCH more than $7k in our Roth 401k every year - in addition to the $8k in the Roth via conversion.  Play the game to win."
    ],
    [
      "2025-07-30T00:26:08",
      "Hi there! I certainly hope no one bashes a Bitcoin beginner. We've all been there! While we don't know much about mining, we do know about stacking sats. If you're on Instagram, check out Start with Sats. We're new and will start posting content next week, but we're out to make Bitcoin simple, clear & approachable because everyone deserves to build a better future with Bitcoin. Some of our content will address options for acquiring Bitcoin. We're really just out to support those new to Bitcoin and who are looking for ongoing support on their Bitcoin journey. Hope to see you on Insta and we wish you the best of luck in learning!"
    ],
    [
      "2025-07-30T00:27:32",
      "I have done some research on this and you're absolutely right. Institutions are buying OTC, and the supply is rapidly depleting. Here's one article: [https://cointelegraph.com/news/less-than-15-bitcoin-left-on-crypto-exchanges-signals-supply-problem](https://cointelegraph.com/news/less-than-15-bitcoin-left-on-crypto-exchanges-signals-supply-problem)\n\nI also suspect that the big players are manipulating the price on the exchanges. Let's say I'm a big institution who wants to buy $500 million worth of bitcoin OTC. Why can't I sell $5MM at market price to bring down the price, while I buy the big amount OTC? \n\nThe OTC balance has now fallen less than 150,000 bitcoin. I used AI deep research to find a timeline when there will be a \"supply shock\" and institutions will HAVE to buy from the exchanges. It says 6-12 months at current depletion levels. I think we're going to see some wild price action in the next couple of years!!"
    ],
    [
      "2025-07-30T00:30:35",
      "I am not familiar with this guaranteed year 1 return of 20%. Can you explain this more, how it works and who is guaranteeing this?"
    ],
    [
      "2025-07-30T00:30:40",
      "Hi there! If you're on Instagram, you can start following Start with Sats. We're new (and will start posting content next week) but we're out to make Bitcoin simple, clear & approachable because everyone deserves to build a better future with Bitcoin. Our content will be educational, so it seems like it may be a good resource for you as we cover Bitcoin -- what it is, why it's so valuable and how to acquire and use it (we'll be pushing it to be used as a store of value for savings). If this seems up your alley, we hope to see you on Insta. Great job on putting yourself out there to learn. Best of luck!"
    ],
    [
      "2025-07-30T00:31:46",
      "lol this guy is crazy"
    ],
    [
      "2025-07-30T20:18:34",
      "BITO holds futures contracts and has about a 4x higher expense ratio. \n\nIs there any benefit to holding BITO? I can’t see any reason you’d want to pay more to track futures over the spot price."
    ],
    [
      "2025-07-30T20:19:02",
      "It's a good strategic choice, I sold everything that wasn't BTC to buy back BTC.\nGg."
    ],
    [
      "2025-07-30T20:19:03",
      "I hold because I have nothing better to do."
    ],
    [
      "2025-07-30T20:19:21",
      "Explain it to them in Sat’s"
    ],
    [
      "2025-07-30T20:19:27",
      "Low T"
    ],
    [
      "2025-07-30T20:19:33",
      "Sold a lot of stock recently to buy a house. Did not sell my BTC."
    ],
    [
      "2025-07-30T20:19:36",
      "A big part too is that normies dont understand how high its gonna go. They think its like a shet coin thats gonna come back down eventually. None of them can truly conceptualize absolute scarcity, that only 21 million exists."
    ],
    [
      "2025-07-30T20:19:49",
      "Depends of the platform you are using. I can't tell for all but i'm mostly using only Binance for Bitcoins, and i always just buy USDC and convert them directly to BTC, usually the spread is smaller so i get a little bit more BTC than if i directly trade them."
    ],
    [
      "2025-07-30T20:20:24",
      "not your papers, not your fiats"
    ],
    [
      "2025-07-30T20:21:10",
      "This is why fractional trading of stocks is now a thing."
    ],
    [
      "2025-07-30T20:21:48",
      "In my opinion satoshi should have called bitcoin bitblock instead and sat should be called bitcoin."
    ],
    [
      "2025-07-30T20:22:08",
      "I’ve never heard of them. \n\nIs there a reason to go searching in the depths for something obscure instead of sticking to established companies?  Do you like risk?"
    ],
    [
      "2025-07-30T20:22:17",
      "That could cure the unit bias, but it also put bitcoin back into the crowded shitcoin arena. Millions of shitcoins are trading at $0.01 a coin, why should I buy bitcoin if the next one, called Fartcoin, is just as cheap, but could move faster?\n\nTo me, the high price tag of bitcoin is a sign of quality. 120k may seem unattainable but at least it tells me “that’s the good one to aim for”."
    ],
    [
      "2025-07-30T20:22:19",
      "Seriously. I’m impressed how well it’s held up so close to the most recent ATH. Usually it would touch and then drop 10-20%"
    ],
    [
      "2025-07-30T20:22:19",
      "LOL!   She's 46"
    ],
    [
      "2025-07-30T20:22:52",
      "I think he's talking about using the traditional banking system and getting caught in a \"not your papers, not your fiat\" situation"
    ],
    [
      "2025-07-30T20:23:04",
      "That is a good point. I think the $117,000 price does turn short term investors off because of the perceived expensive price, even though can can buy however much you want of 1 coin.\n\nBershire Hathaways Class A Shares (BRK.A) current price is $714,175.00 has never had a stock split because Warren Buffett believes that the high price attracts long-term, value-oriented investors and discourages short term speculation.\n\nMeanwhile BRK.B currently $476.00 provides an accessible entry point for smaller investors.\n\nI wonder if it is similar with Bitcoins price?"
    ],
    [
      "2025-07-30T20:23:20",
      "You know how this generation complaints about boomer and how they had it easy with real estate prices. \n\nBitcoin is going do the same thing for the next generation. \n\nJust like a lot of boomer missed out of their generational boom a lot of our generation will also miss out on our own boom."
    ],
    [
      "2025-07-30T20:23:28",
      "I see. Thanks for the info!"
    ],
    [
      "2025-07-30T20:23:28",
      "let me guess. you have a positive balance in the bank"
    ],
    [
      "2025-07-30T20:23:57",
      "I see. Thanks for the info!"
    ],
    [
      "2025-07-30T20:24:35",
      "but they promised"
    ],
    [
      "2025-07-30T20:24:37",
      "Wow, 3 years with Coldcard and this happens. Sorry for your loss."
    ],
    [
      "2025-07-30T20:25:45",
      "Ah got ya.  Thanks."
    ],
    [
      "2025-07-30T20:25:52",
      "He is doing his work correctly.  Traders are playing as they always do"
    ],
    [
      "2025-07-30T20:25:52",
      "I think the name is the problem. Psychologically the term coin is way too small/cheap for a unit that can get to a value of a million in the future. Bitcoin should be called bitblock and sats should be called bitcoin and"
    ],
    [
      "2025-07-30T20:26:07",
      "It already is in many ways.\n\nEven with stocks people want splits because they want to own more whole numbers. Although it’s also about selling options."
    ],
    [
      "2025-07-30T20:26:46",
      "backed by suits and desk chairs"
    ],
    [
      "2025-07-30T20:27:09",
      "I'd say it's worth posting as a warning to others. I don't think his intention was to cry about a few thousand satoshis."
    ],
    [
      "2025-07-30T20:27:12",
      "It was me guys, I'm the whale that dumped his load."
    ],
    [
      "2025-07-30T20:27:48",
      "Oh geeze. I had to reread your message. Lol 😆"
    ],
    [
      "2025-07-30T20:28:06",
      "Someone either tell me I’m right or regarded \n\nI NEED TO KNOW IF THIS MAKES SENSE"
    ],
    [
      "2025-07-30T20:28:22",
      "This ain’t no dump?…"
    ],
    [
      "2025-07-30T20:28:24",
      "life under captured capitalism"
    ],
    [
      "2025-07-30T20:28:47",
      "Having the same thought. Putting some in now but going in heavy when we see sub $100k"
    ],
    [
      "2025-07-30T20:31:04",
      "No. You don't have to buy in whole numbers."
    ],
    [
      "2025-07-30T20:31:32",
      "There was a dip?"
    ],
    [
      "2025-07-30T20:32:05",
      "I avoided Bitcoin for way too long because i thought a full coin was too expensive. A friend explained how it worked, set me up, and sold me a small portion so I could see it work. This was back in 2021 when it was between 20-40k. Though I have to admit I face a psychological hurdle to continue to buy more when it's this high despite knowing it'll grow higher, because I feel regret for not having bought more when it was cheaper."
    ],
    [
      "2025-07-30T20:32:48",
      "I have recently opened a Fidelity Crypto Roth and am selling options in my regular Roth to fund BTC purchases in the Crypto Roth. About $1k a week give or take."
    ],
    [
      "2025-07-30T20:33:09",
      "OK, I’ll HOdl"
    ],
    [
      "2025-07-30T20:33:12",
      "Folks aren’t rushing in to buy because the price went up to 120k. The price went up to 120k because folks are rushing in to buy."
    ],
    [
      "2025-07-30T20:33:52",
      "I will be doing the same but not until the next bear market. Your buying the top !... Dca in during the lows"
    ],
    [
      "2025-07-30T20:34:07",
      "I hope it happens soon"
    ],
    [
      "2025-07-30T22:41:29",
      "Don't do it."
    ],
    [
      "2025-07-30T22:41:34",
      "Your submission has been flagged for removal because it pertains primarily to altcoin discussion and/or promotion. Altcoins are off topic for the Bitcoin subreddit. Please post in the subreddit appropriate to that altcoin instead. Thank you.\n\n^^I ^^am ^^a ^^bot ^^and ^^cannot ^^respond. ^^Please ^^contact ^^r/Bitcoin ^^moderators [^^directly ^^via ^^mod ^^mail](https://www.reddit.com/message/compose?to=%2Fr%2FBitcoin) ^^if ^^you ^^have ^^questions."
    ]
  ],
  "ethereum": [
    [
      "2025-07-28T15:19:29",
      "Any podcasts you'd recommend? "
    ],
    [
      "2025-07-28T15:21:18",
      "Yup, impeccable timing.\n\nJust as entities will attempt to set up governance based on block producing influence through high % participation, Ethereum must allow this to be a valid business reason to have a stake but not be exploitable to the detriment of the censorship resistance or avoidance of abusive value extraction."
    ],
    [
      "2025-07-28T15:22:05",
      "Not really. They are all basically making it up as they go along. Unhedged is the one I listen to the most because it's short and they dont take themselves too seriously (its also the podcast that created the word TACO in regards to Trump)"
    ],
    [
      "2025-07-28T15:23:35",
      "If only anyone knows"
    ],
    [
      "2025-07-28T15:24:08",
      "The headline feature of Glamsterdam (next fork after Fusaka) is FOCIL which aims to prevent abuse of this.\n\nIt's already implemented by 5+ clients and deployed in devnets so it'll clearly go through. We could expect it any time between June and September 2026."
    ],
    [
      "2025-07-28T15:26:05",
      "\"well documented\"\nhave you seen said documents?\n\nmeanwhile bidens daughter actually stated she couldn't shower while her father was home for fear of him joining her in the shower. so they put her in an institution."
    ],
    [
      "2025-07-28T15:34:26",
      "I plan to listen to the episode later today, quite curious about their plans!\n\n\"Block selling\" is how 90+% of the blocks are already being produced _today_. The Ether Machine guys may plan to take it a step further with something like preconfs to get a bit more yield (and they're far from the only ones who will do that). In terms of censorship, as long as we have something like FOCIL we can always rely on transactions getting included, though to be fair FOCIL is not designed for a world where 90% of transactions is being censored so we'll have to see how it turns out. I don't think they'd have a reason to censor your regular transactions as long as your pay a fair market price for it being included.\n\nI'm more worried about the centralization of the validator set (have been for quite some time, see my comment history). These guys will likely run a ton of validators. We should push for them _not to outsource_ this work to an existing huge staking service provider like Coinbase/Kiln/Figment/... It would be much better if they:\n\na) ran the validators themselves in a responsible way (multi-client setup - Vero/Vouch/DVT)\n\nb) used something like Rocket Pool\n\nc) used the smallest staking service provider possible (This one's harder than it looks. You want the provider to be small but at the same time, reputable)\n\nWe want to distribute the stake as evenly as we can. We can, as a community, let them know!"
    ],
    [
      "2025-07-28T15:36:38",
      "Ok but blocks are 12 seconds so nothing on chain should be taking you minutes. L2s confirm faster than that. We have functional debit cards that work in stores just like you're describing."
    ],
    [
      "2025-07-28T15:39:22",
      "Staking and earning yeild = store of value\n\nUsing in defi = capital asset\n\nUsed for transactions = consumable asset"
    ],
    [
      "2025-07-28T15:50:10",
      "The yield earned in relation to staking is really just off-setting token inflation. But where demand for usage (DeFi etc) exceeds that supply then of course the underling asset price will grow. So I'm not saying that Eth isn't a good buy per se, just that it isn't a pure SoV like Bitcoin and for this reason I think that it's more likely to always lag in value relative to BTC. Fwiw I'm a long-term Ethereum holder since 2017 (of a fairly substantial amount) but imo Eth is much more akin to high growth tech stock. And thus to OP's question—1eth is very very unlikely to create generational wealth, even a 10x from here you're talking about a 1/2 the yearly income of the current US median wage."
    ],
    [
      "2025-07-30T00:28:38",
      " > How does that not just create needless friction without any benefit?\n\nMy friend, you just described almost all of tradfi. It is their north star."
    ],
    [
      "2025-07-30T00:33:22",
      "Oh fuck, someone actually was using it. I will put it back up tomorrow. Thanks for the info!"
    ],
    [
      "2025-07-30T20:18:39",
      "Long-time crypto observer and buy-and-hold index investor.  Questioned crypto for almost a decade.  The involvement of trad-fi institutions caught my eye and I decided I would stick with publicly traded ETFs.  Got a 150% return in FBTC in the last year and a half and then branched out to FETH a little too late.  Would have loved to get in when it was sub-$2,000, but I was unaware.\n\nLong term I think the vision is undoubtedly with Ethereum in terms of use case and actual value.  The community here is also generally more intelligent than the others that I've seen, which is nice."
    ],
    [
      "2025-07-30T20:19:03",
      "The phrase originated as a reference to the conman that sold the Brooklyn bridge when he (obviously) didn't own it. It isn't that there aren't bridges there, it's that they aren't owned by the speaker."
    ],
    [
      "2025-07-30T20:19:06",
      "Aww words hurt you’re wittle feelings boo boo. 🤣"
    ],
    [
      "2025-07-30T20:19:17",
      "May I ask why you chose FETH?\n\nI see that they only have 71M$ in assets, compared to ETHX.B by Galaxy CI (692 M$) or ETHH.B by Purpose Investment (496 M$)."
    ],
    [
      "2025-07-30T20:19:53",
      "this thng does not want to stay below 750"
    ],
    [
      "2025-07-30T20:22:06",
      "No reason other than my entire portfolio is with Fidelity and they have fantastic customer service.  Their net expense ratio on the fund is also competitive with the others, so I wasn't concerned about that, either."
    ],
    [
      "2025-07-30T20:22:12",
      "Be constructive, kind, and respectful. No trolling."
    ],
    [
      "2025-07-30T20:23:25",
      "> 1. web3.eth.getBlock(1028201).hash\n\n> 2. python mk_genesis_block.py --extradata ############ > genesis_block.json\n\n> 3. rm ~/.ethereum\n\n> 4. ~/go-ethereum/build/bin/geth account new\n\n> 5. ~/go-ethereum/build/bin/geth --rpc --rpcaddr 192.168.1.120 --port 30303 --maxpeers 60 --networkid 1 --genesis ~/genesis/genesis_block.json console\n\n> 6. Start miners"
    ],
    [
      "2025-07-30T20:23:35",
      "Locked this thread because of politics talk. Cool down yall."
    ],
    [
      "2025-07-30T20:26:00",
      "u aint seen nuthin yet\n\n\nI have a feeling in my bone that that was the traditional plunge right before the next leg up"
    ],
    [
      "2025-07-30T20:26:32",
      ">FETH also has $2.6bn, not $71m.\n\nMy mistake. I was looking on the Canadian website of the ETF (https://www.fidelity.ca/fr/products/etfs/feth/)"
    ],
    [
      "2025-07-30T20:26:53",
      "Idk, I'm a \"oceanfront property in Arizona\" guy myself."
    ],
    [
      "2025-07-30T20:30:07",
      "mang whipped out the command history dang phiz"
    ],
    [
      "2025-07-30T20:32:14",
      "As [MichaelAischmann](https://www.reddit.com/user/MichaelAischmann/) said, send everything to an exchange, and swap. Log into whatever exchange you want to use, click on the Tron asset and find your deposit address. Then send a small amount as a test, make sure it arrives, and then send everything else. Then swap it all.\n\nHonestly sending it anywhere else after you've done this is probably not a good idea, because you've admitted you (and presumably your friend, given that they're asking for your help) are clueless. Let the exchange take care of security until you get familiar with crypto. Then wait another year and then send it to a wallet.\n\nJust don't answer DMs because you will then 100% get scammed, you've been warned. Saying effectively 'help I'm a complete newbie' will only get you targeted more. First rule of crypto reddit."
    ],
    [
      "2025-07-30T20:33:06",
      "Happy 4 years of the price not moving!"
    ],
    [
      "2025-07-30T20:33:36",
      "it's a shame that adults can't talk about relevant market moving politics without resorting to insults. maybe mods could be more concerned about the insults than the politics"
    ]
  ],
  "solana": [
    [
      "2025-07-28T15:20:34",
      "I was about to say this"
    ],
    [
      "2025-07-28T15:20:55",
      "It’s way worse than casino odds. 99.5% are rug pulls. Barely any even bond now it’s all insider plays you’re either in or not."
    ],
    [
      "2025-07-28T15:21:11",
      "Please I am begging you, do something with your life. Scamming people will eat away at your soul, you think you’ll be able to live with it but you won’t."
    ],
    [
      "2025-07-28T15:22:10",
      "Scammers running wild"
    ],
    [
      "2025-07-28T15:23:18",
      "Ends in 20 days it seems"
    ],
    [
      "2025-07-28T15:23:35",
      "New memecoins szn just started lil snig"
    ],
    [
      "2025-07-28T15:24:09",
      "It's funny how those linked accounts are always 10++ years old, dead for years, and now they come back to explain to everyone how to multiply your money for free😂"
    ],
    [
      "2025-07-28T15:25:49",
      "Now do it with a million"
    ],
    [
      "2025-07-28T15:28:32",
      "If it was so profitable, no reason to share it. 🤪"
    ],
    [
      "2025-07-28T15:28:32",
      "If it was so profitable, no reason to share it. 🤪"
    ],
    [
      "2025-07-28T15:29:01",
      "I bought but always have a hard time not spending it on HEGE.. will be better in the long run anyways"
    ],
    [
      "2025-07-28T15:30:30",
      "I did the whole 100k and to nothing in 2017. Seems like we all have to cut our teeth the hard way.  Took me that hard lesson to learn to stay with the blue chips mainly BTC and DCA. Would have been a millionaire by now if I knew that off the bat.  Leave it in the past and grow from it, don't dwell on it."
    ],
    [
      "2025-07-28T15:32:15",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "2025-07-28T15:34:37",
      "Damn!!! You can now turn 350k in 7 million dollars in a few days! Good luck!"
    ],
    [
      "2025-07-28T15:34:39",
      "Same issue did you guys find a solution 🤔"
    ],
    [
      "2025-07-28T15:38:48",
      "Today will give you another oppurtunity"
    ],
    [
      "2025-07-28T15:38:59",
      "Happy that we managed to leave it in the past. Pray for me."
    ],
    [
      "2025-07-28T15:39:45",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "2025-07-28T15:42:07",
      "Next scam... who falls for this? It's getting called out immediately."
    ],
    [
      "2025-07-28T15:42:09",
      "If SOL runs hard, sol meme coins are going to run even harder"
    ],
    [
      "2025-07-28T15:43:38",
      "At least 1 time per week I see this scam post.."
    ],
    [
      "2025-07-28T15:44:13",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "2025-07-28T15:44:58",
      "2 times in 20 minutes, even the same subreddit and linked account"
    ],
    [
      "2025-07-28T15:45:12",
      "Damn really, I see at least one a day (although maybe that means I use too much Reddit)"
    ],
    [
      "2025-07-28T15:45:49",
      "Make sure to also report the linked profile"
    ],
    [
      "2025-07-28T15:46:22",
      "Freaking got liquidated 40 cents."
    ],
    [
      "2025-07-28T15:49:05",
      "Fake"
    ],
    [
      "2025-07-29T12:57:24",
      "how do you find indicators on app"
    ],
    [
      "2025-07-30T00:14:40",
      "Because you're expecting to make instant money 😂 you sound like you're not old enough to be using financial apps, prove me wrong.."
    ],
    [
      "2025-07-30T00:15:24",
      "Unstaking is for quitters"
    ],
    [
      "2025-07-30T00:15:53",
      "Short answer??? Reddit is a shit hole."
    ],
    [
      "2025-07-30T00:17:51",
      "Nobody hated everybody loves it"
    ],
    [
      "2025-07-30T00:20:44",
      "Quit looking at them like shitcoins represent something. Shitcoins are just a gambling platform. People want to gamble. It solves a giant problem. Solana tech is benefitting from the volume in the ecosystem. More money -> more tech -> better for Solana."
    ],
    [
      "2025-07-30T00:21:16",
      "Everyone got their baby coin. It's beautiful and everything else is ugly...\n\nI like Solana because it is blazing fast, cheap and there is plenty of dapps. Try explaining that to the ethereum folks! They thinks eth is the pinacle of everything and nothing will ever compare..."
    ],
    [
      "2025-07-30T00:22:03",
      "Can lead a horse to water but can’t make em drink 🤷‍♂️"
    ],
    [
      "2025-07-30T00:24:49",
      "Up $15k this week brother, come on"
    ],
    [
      "2025-07-30T00:25:27",
      "They only like the shitcoins they are bagholding."
    ],
    [
      "2025-07-30T00:27:08",
      "Blackrock sure loves it"
    ],
    [
      "2025-07-30T00:30:24",
      "Yeah its very private on that chain because no one is using it"
    ],
    [
      "2025-07-30T00:30:49",
      "Bro I like Solana too but you must not be paying attention to defi tvl, stables, and RWA’s on EVM. \n\nThe data is all there and clear lol."
    ],
    [
      "2025-07-30T00:32:30",
      "Maxis are maxis. People will scream and cry on a hill and ignore clear onchain data"
    ],
    [
      "2025-07-30T20:18:54",
      "Why every one panicking,  completely normal . If you own sol or Eth now there is no point selling unless your desperate for the cash . You will regret it guaranteed,  this dip is normal and you should be buying if you got spare cash , not crying why it not made me millions yet . Eth will hit 10k sol 1k , the next few month when retail start FOMO in , then crypto will rise , the race is on with country's to become crypto capitals of the world , whoever wins will take the crown from the USA,  this is why Trump is trying to push it so hard , they win they win next 100 years , just look up  the amount of private  company's trying to become ,Microstrategy , there are lots , its a no brained hold your digital gold and the rest of the ppl who fud it now will be buying your bags at a high price , Don't panic,  don't panic lol."
    ],
    [
      "2025-07-30T20:20:18",
      "For whatever youre thanking for.."
    ],
    [
      "2025-07-30T20:23:20",
      "You're going to get the $SKR drop, or you can make some by using some apps. Not sure how exactly. You can also dedicate it to some depin apps, share bandwidth etc."
    ],
    [
      "2025-07-30T20:27:46",
      "for TON on solana, use jupiter or Raydium to swap it directly from phantom... both platforms recognize TON on solana network and have decent liquidity for swaps like this. i had the same problem last month and managed to swap my TON with minimal slippage using direct DEX instead of centralized exchanges. you might want to try using chronyx trading bot to automate this process."
    ],
    [
      "2025-07-30T20:30:21",
      "I don't get it ,why ppl moanig"
    ],
    [
      "2025-07-30T20:32:18",
      "Stop gambling and learn to invest wisely, properly addressing and mitigating risk. Idk about Europe, but in the US, we have a hotline for people to call if they struggle with gambling addiction. Get help before it ruins you like it does other gambling addicts."
    ],
    [
      "2025-07-30T20:32:42",
      "EE9QwD6M2Ac7yuLpRcYNR5CUGJxc98Ac9ZuCDMiNk3CQ\n\nCan some one send me 25$ I'm still so I can make some money"
    ],
    [
      "2025-07-30T20:33:16",
      "They’re not investing they’re gambling"
    ]
  ],
  "btc": [
    [
      "2025-07-28T15:21:03",
      "Fuck off, scammer."
    ],
    [
      "2025-07-28T15:22:12",
      "No, they don't!"
    ],
    [
      "2025-07-28T15:33:17",
      "Definition of \"delusional\"."
    ],
    [
      "2025-07-28T15:42:15",
      "So much ChatGPT Posts Lately. This will Crash soon."
    ],
    [
      "2025-07-28T15:49:39",
      "Yep, and i actually think bear markets are a healthy thing. Something cannot go up all the time."
    ],
    [
      "2025-07-29T11:58:17",
      "I'll leave a note for my great great grandson, if fusion is working then."
    ],
    [
      "2025-07-29T20:18:17",
      "if you know anything about cryptocurrency, investigations, and/or darknet markets and logistics, you will have a quick look at OP's responses and you'll know that he knows nothing.\n\nhe is a fantasist."
    ],
    [
      "2025-07-30T00:17:01",
      "To be clear the chapa with BCH project is just in fundraiser state, it has not yet been launched."
    ],
    [
      "2025-07-30T00:17:14",
      "Nothing that requires someone else’s labor to provide is free 😂"
    ],
    [
      "2025-07-30T00:19:18",
      "Bitcoin was the flag of revolution. The flag may have been stolen and consumed, but the spark will live on through the next generations of tech.\n\nTrue believers should find the chain with the strongest Nakamoto Coefficient plus the best native BTC support layer and continue the fight there. It's like bringing Senator Mon Mothman to the rebel HQ for any star wars/andor fans."
    ],
    [
      "2025-07-30T00:20:50",
      "3rd times the charm"
    ],
    [
      "2025-07-30T00:25:06",
      "Nobody’s losing faith and selling, relax and go outside"
    ],
    [
      "2025-07-30T20:21:17",
      "In this scenario bitcoin would have a market cap that’s over 40% larger than the entire US stock market today. Don’t waste your time believing this nonsense."
    ],
    [
      "2025-07-30T20:26:45",
      "😭"
    ],
    [
      "2025-07-30T20:33:10",
      "$2.50 to upload a sha256...I dunno, that's  a lot of cost if I want to scale up\n\n\nIs this cost constant? How does your system work as it scales? Is your cost of infrastructure included in this cost to certify?"
    ]
  ],
  "dogecoin": [
    [
      "2025-07-28T15:33:06",
      "![gif](giphy|hEwkspP1OllJK)"
    ],
    [
      "2025-07-28T15:34:14",
      "Where’s the dumb move? You don’t look at slippage?"
    ],
    [
      "2025-07-28T15:36:53",
      "Just go buy a dogecoin for a dollar, wtf u mean?"
    ],
    [
      "2025-07-28T15:37:35",
      "Bro get to a dollar first. Doge isn’t going to $4.20 for a long long time."
    ],
    [
      "2025-07-28T15:38:11",
      "Wrong. This is noob beer."
    ],
    [
      "2025-07-28T15:38:42",
      "$20,000 and someone out there will say cry me a river to that too."
    ],
    [
      "2025-07-28T15:40:25",
      "Don’t care that much but I’m curious as to why so many people say shares when referring to crypto"
    ],
    [
      "2025-07-28T15:42:32",
      "Just go buy a dogecoin for a dollar. What are you talking about?"
    ],
    [
      "2025-07-28T15:43:37",
      "If you were 25 then how do you not know that the msm wouldn’t talk about things like btc back then?"
    ],
    [
      "2025-07-28T15:49:04",
      "All the time"
    ],
    [
      "2025-07-28T15:49:26",
      "My question is if everyone's waiting for a dollar to sell.. who is buying at a dollar?"
    ],
    [
      "2025-07-29T12:55:35",
      "It does not consume much time to check your phone once a day lol but yeah its a long run"
    ],
    [
      "2025-07-29T20:18:21",
      "Does this mean it needs to retest lower levels before the next run? Aka follow the typical cycle?"
    ],
    [
      "2025-07-30T00:25:34",
      "Average down 🤣🤣🤣"
    ],
    [
      "2025-07-30T20:22:03",
      "IDK where we are in terms of market cycle (obvs no one can call it). But since macro factors are completely completely weirded out - we just don't know. In the US we don't know if some new law or tariff will be announced, redacted etc at any given moment. We don't know if we're on the edge of a recession or entering a period of stagflation. The labor market is brittle especially in tech and if AI implementation is the goal - then hiring could be deadly slow for the next 5 to 10 years. The economic / political moment we're in is just absurdly uncertain and no one knows what it represents. I find the relative main stream media quiet odd at this stage. Usually theres like 2-3 months of hype as things are starting to peak and mainstream folks start talking about crypto again. If this bull market hasn't fizzled (and while thats a possibility I don't personally think it has) out I'm hoping that we begin to see momentum at the end of summer peaking at the end of the year or in early 2026. We're just flirting w/ departing from some of the global dynamics that have been more or less constant since the 90s so. That's going to reflect in speculative markets. Sorry for such an ambivalent answer but that's how I see it."
    ],
    [
      "2025-07-30T20:27:06",
      "$2? Bitcoin hasnt moved like it has prior to past alt seasons, i say we see 200K BTC before we see $2 Doge."
    ],
    [
      "2025-07-30T20:32:15",
      "far from it"
    ]
  ]
}