{
  "Bitcoin": [
    [
      "n73vdd6",
      "2025-08-05T19:57:37",
      "It’ll go up, but you can always go up faster with well timed trades."
    ],
    [
      "n73veox",
      "2025-08-05T19:57:37",
      "It's simple, but not easy."
    ],
    [
      "n73vfjw",
      "2025-08-05T19:57:37",
      "How many current holders of Bitcoin you think really understand what they have?\n\nSame question, but 10 years ago?\n\nNumber go up tourists will always outnumber those who have deep understanding. Those who understand the potential of a successfully bootstrapped monetary network for a digital bearer asset also understand the tourists, and how they'll always be back next season."
    ],
    [
      "n73vqc6",
      "2025-08-05T19:57:37",
      "putting malware on a hard drive and selling it at a garage sale"
    ],
    [
      "n73vrj7",
      "2025-08-05T19:58:29",
      "Honnest awnser. I was too lazy to sell. And by the time it dropped 60 percent, i was like wtv might as well just ride to 0."
    ],
    [
      "n73vusg",
      "2025-08-05T19:58:29",
      "Why does it need to be apocalyptic?  It would be more like 2008 with a different asset classes.  Instead mainstream holding massive mortgage debt with a crashed asset, you might get ETF holders backed by no BTC while ETF issuers who get hypothetically bailed out from the excursions they made with your ETF money."
    ],
    [
      "n73vvtw",
      "2025-08-05T19:58:29",
      "Ok that is what I was expecting and why I have not done anything about this.  Thought it was worth the question.   Thanks"
    ],
    [
      "n73vyis",
      "2025-08-05T20:00:58",
      "circa, not via"
    ],
    [
      "n73w16j",
      "2025-08-05T20:00:58",
      "No. I got the card as a gift. My hydro was included in the rent that my welfare was paying. Justify it however you want but labor is not needed as much in the future, think bigger. I've been creating industrial automation for 15 plus years, labor is not as valuable as you may think. Engineering and automation can greatly reduce or even eliminate labor in most cases. The skilled labor that goes into it is not as intensive and not fulfilling to all people's purpose, so we must think bigger. \nSome of us will labor even though we don't need to cause we want to but not laboring and being consistent and dedicated can be just as prosperous in life and with that we should rejoice. The shackles are removed and we are truly free. Have zero fear and go out and live your best life cause that's all that matters. Do what you love, cause nothing else matters."
    ],
    [
      "n73wc3m",
      "2025-08-05T20:00:58",
      "Take your seed phrase to your grave as an offering to the community."
    ],
    [
      "n73wccg",
      "2025-08-05T20:02:01",
      "Why wouldn’t it be taxable?  If want to spend $1,000 from one of my investments, I’d have to sell the stocks/gold/etc and convert it USD.  I’d get taxed for that depending on my cost basis. Paying *directly* with the asset just skips a step (liquidation), but I still reap the same benefits of a gain on my investment. I don’t understand why anyone would expect it to be non-taxable."
    ],
    [
      "n73wfzb",
      "2025-08-05T20:02:01",
      "He's most likely referring to IRA and Roth IRA accounts which give you tax advantages."
    ],
    [
      "n73wk0w",
      "2025-08-05T20:02:54",
      "Probably referring to investing via retirement accounts"
    ],
    [
      "n73wkdo",
      "2025-08-05T20:02:54",
      "Tbh no it almost certainly won’t increase as much as it did in the past. But that’s not why I started buying bitcoin. I did it because I believe it will keep outperforming the market in the long run. So as long as I am seeing 13% YoY returns or better I will keep buying. Although I am expecting much higher but only time will tell."
    ],
    [
      "n73worp",
      "2025-08-05T20:02:54",
      "2030-2035 for a million is my guess"
    ],
    [
      "n73wrs7",
      "2025-08-05T20:03:26",
      "\"considers\"\n\n  \nWeak clickbait language. Do or do not."
    ],
    [
      "n73ws3l",
      "2025-08-05T20:03:26",
      "You are a wholer. Won’t be many of us in the future"
    ],
    [
      "n73ws7x",
      "2025-08-05T20:03:26",
      "Fuck all, in red and green."
    ],
    [
      "n74croa",
      "2025-08-05T21:28:56",
      "He posted a chart so it must be true."
    ],
    [
      "n74ctgj",
      "2025-08-05T21:28:56",
      "https://youtu.be/Pef22g53zsg"
    ],
    [
      "n74ctyu",
      "2025-08-05T21:28:56",
      "Who hurt you bro?"
    ],
    [
      "n74cv19",
      "2025-08-05T21:28:56",
      "Watch this^"
    ],
    [
      "n74u415",
      "2025-08-05T23:03:47",
      "Such wow"
    ],
    [
      "n74u4xj",
      "2025-08-05T23:03:47",
      "Nvm I have forgotten robinhood is non custodial"
    ],
    [
      "n74u4yn",
      "2025-08-05T23:03:47",
      "The more wealth you have, the more you stand to lose in Bitcoin terms if you don't hold Bitcoin."
    ],
    [
      "n74u5ri",
      "2025-08-05T23:03:47",
      "I have the current Bitcoin value on the face of my phone. Always gotta know, all day, sometimes at night. Check value of house every couple weeks or so."
    ],
    [
      "n750l48",
      "2025-08-05T23:39:25",
      "Thank you, that is exactly what i do, creative industries required creativity which oftens drive the artist to burn out, easier said than done just to get \"more clients\" and such haha. But here i'm consistently updating my portofolio and keep working on personal project until i got another clients, some times when there's company, one deal could easily worth $5K-$10K. But yeah, life."
    ],
    [
      "n75875t",
      "2025-08-06T00:22:47",
      "Yeah, well, whatever they are choosing to do seems to work out for them. \n\nIf you’re shocked and appalled, maybe you should try to listen to them.  Gain some comprehension.  Don’t just look at one thing.\n\nHell, if they put it in PALANTIR it would be even more by double.\n\nNo one knows. \n\nAnd when you have that much money to swing around… you kinda artificially screw up the market on what you’re buying."
    ],
    [
      "n758bfj",
      "2025-08-06T00:22:47",
      "Well put."
    ],
    [
      "n758c19",
      "2025-08-06T00:22:47",
      "ETF = selling covered calls strategically to juice my returns even more. Plus I'm dumb and would absolutely screw up holding my own BTC."
    ],
    [
      "n75kxzi",
      "2025-08-06T01:35:49",
      "Now we know how they build houses in 6 hours"
    ],
    [
      "n75l34y",
      "2025-08-06T01:36:39",
      "well now 120k will never cross ur mind lmfao"
    ],
    [
      "n75l7kx",
      "2025-08-06T01:36:39",
      "Fiat bros be like “but if I can’t buy pizzas with it then it’s useless”"
    ],
    [
      "n75l7lf",
      "2025-08-06T01:36:39",
      "It is also good to remember the price multiplier done by Bitcoin."
    ],
    [
      "n75l7w6",
      "2025-08-06T01:36:39",
      "no"
    ],
    [
      "n764vuk",
      "2025-08-06T03:36:10",
      "Pretend to be Italian, \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDo you know yet????\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFORGETTA BOUT IETTTTT"
    ],
    [
      "n76bkvt",
      "2025-08-06T04:23:36",
      "People would sell it take profits when it hits 1 dollars not a lot would hold til 10k or 100k but for real I wish I could get some because I saw some random IT channel in my country talk about how bitcoin would replace card payment and such in 2009😂😂"
    ],
    [
      "n76vjz2",
      "2025-08-06T07:11:05",
      "Cus cash flow is king. Even Saylor is using debt as torque. We should do the same."
    ],
    [
      "n76vl1a",
      "2025-08-06T07:11:05",
      "U can buy one like trezor which is the safest or others and then u put it on (don’t forget the 24 seed words) and after you transfer from your current one to the new one"
    ],
    [
      "n771nvn",
      "2025-08-06T08:08:42",
      "I see the same question come by every single day. Answers are also always the same. Trezor > Ledger. At least 20 videos with reviews on youtube plus AI. No people are lazy as f* nowadays."
    ],
    [
      "n771p58",
      "2025-08-06T08:08:42",
      "As a millennial, I’d prefer a trade and barter system or gold, instead of a digital device being slugged around. Shut the powergrid down on these basement dwellers!!!!!"
    ],
    [
      "n771pre",
      "2025-08-06T08:08:42",
      "😄 the nightmares"
    ],
    [
      "n77lno4",
      "2025-08-06T11:07:35",
      "Updateme!"
    ],
    [
      "n77lo2i",
      "2025-08-06T11:07:35",
      "Personally I think a dip under 100k will happen."
    ],
    [
      "n77lrbb",
      "2025-08-06T11:07:35",
      "Erm, I’ve been buying and holding since $800…"
    ],
    [
      "n77lt8x",
      "2025-08-06T11:07:35",
      "buy ledger"
    ],
    [
      "n77uwuf",
      "2025-08-06T12:10:53",
      "Updateme!"
    ],
    [
      "n77uzrf",
      "2025-08-06T12:10:53",
      "Please update us on what you found..."
    ],
    [
      "n77v11m",
      "2025-08-06T12:10:53",
      "Holding it."
    ],
    [
      "n786tud",
      "2025-08-06T13:19:57",
      "Updateme!"
    ],
    [
      "n786ujx",
      "2025-08-06T13:19:57",
      "Updateme!"
    ],
    [
      "n786wch",
      "2025-08-06T13:19:57",
      "80k is veterans? 🤣\n\nThat was so recent wtf"
    ],
    [
      "n786yne",
      "2025-08-06T13:19:57",
      "Imho, just looking at the 80KB of the wallet.dat file, it most likely is the default file size with no bitcoins."
    ],
    [
      "n786zlg",
      "2025-08-06T13:20:38",
      "I'd bet anything that the source (if there is one) is like a small startup trying to convince a big french company to mine Bitcoin using nuclear or simply a french guy saying something."
    ],
    [
      "n787183",
      "2025-08-06T13:20:38",
      "Updateme!"
    ],
    [
      "n78736e",
      "2025-08-06T13:20:38",
      "Updateme!"
    ],
    [
      "n78shd8",
      "2025-08-06T15:08:41",
      "Exactly. Like if Jesus showed up...having fun. You seem like you're a blast"
    ],
    [
      "n78si3q",
      "2025-08-06T15:08:41",
      "Updateme!"
    ],
    [
      "n78snf9",
      "2025-08-06T15:08:41",
      "Grim outlook for ETH here, solid thread from Alex\n\nhttps://x.com/intangiblecoins/status/1953068611045576945\n\nCentralized L2s (such as Base) run on ETH , extract millions in fees off the top while only paying a tiny fraction of that back in gas fees to ETH holders. 🤣"
    ],
    [
      "n795at4",
      "2025-08-06T16:07:40",
      "Isnt it one in 800,000?"
    ],
    [
      "n795bi2",
      "2025-08-06T16:07:40",
      "It is still what triggers the start of the bullrun."
    ],
    [
      "n795czu",
      "2025-08-06T16:08:53",
      "I’ve been in since 30k"
    ],
    [
      "n79idn9",
      "2025-08-06T17:08:43",
      "Don't forget to a least link one single source.\n\nhttps://interestingengineering.com/energy/france-nuclear-powered-crypto-mining"
    ],
    [
      "n79idyg",
      "2025-08-06T17:08:43",
      "And the most butthurt award goes to..."
    ],
    [
      "n79ig28",
      "2025-08-06T17:09:31",
      "So you think no one should go the college since you can't find a job?"
    ],
    [
      "n79iign",
      "2025-08-06T17:09:31",
      "Back then bitties were around $600 +/- good luck to OP 🤞🍀"
    ],
    [
      "n79ika3",
      "2025-08-06T17:09:31",
      "More buyers than sellers, pretty sure.."
    ],
    [
      "n79vcn6",
      "2025-08-06T18:08:09",
      "Fuck don’t make me cry"
    ],
    [
      "n79vdu9",
      "2025-08-06T18:08:09",
      "I asked a guy if a $1m bitcoin was possible in 2013. He said \"No. If we hit $1m, I'll be a billionaire\".\n\n\nI hope you held bro."
    ],
    [
      "n79vek1",
      "2025-08-06T18:08:09",
      "GAAAAH IM BUYING SHIT ITS AT 115k"
    ],
    [
      "n79vf1e",
      "2025-08-06T18:08:09",
      "When I first hear about bitcoin in 2011 I thought it was one of those payment tokens on over 18 sites"
    ],
    [
      "n79vlc7",
      "2025-08-06T18:08:59",
      "What? Bitcoin always had value.. bitcoins value was the same at $1 as it is at $100,000 it’s literally the same product from then to now, the only thing that’s changed is more and more people realize/understand its value."
    ],
    [
      "n7a809f",
      "2025-08-06T19:07:53",
      "I used these 5 yrs ago to teach my teenage niece what to do if i die. She knows btc, wallets, storage and recovery of seed phrase, has her own stack. Shes driving now and will be in college soon. We recover her wallet once a year and make it a day. \n\nhttps://youtube.com/playlist?list=PLcCmNeBoE6Jit0CblKlykxrI1g9-L2swZ&si=-Sgx_udyq-sRn7uq"
    ],
    [
      "n7a80pd",
      "2025-08-06T19:08:32",
      "Bitcoin appreciates more than property \n\nSo, selling Bitcoin and buying property is essentially a way to become poorer\n\nPeople do it to afford their first home, and that's great for some, but as an investment, you don't want to sell Bitcoin for any other asset."
    ],
    [
      "n7a81rv",
      "2025-08-06T19:08:32",
      "Café the Roemer in Haarlem? It's possible to pay with bitcoin since 2021."
    ],
    [
      "n7a84to",
      "2025-08-06T19:08:32",
      "Cafe de roemer"
    ],
    [
      "n7a85da",
      "2025-08-06T19:08:32",
      "I am not ready for pay tax gains, property tax, and property insurance yet."
    ],
    [
      "n7bxqf4",
      "2025-08-07T00:23:50",
      "just remember that btc follows the global M2 supply with a delay of 75 days, recently the M2 supply indicator reached $160,000, FED rate cuts is possible in september, alot of capital will flow into bitcoin."
    ],
    [
      "n7bxt0z",
      "2025-08-07T00:23:50",
      "That's specious reasoning."
    ],
    [
      "n7bxw3v",
      "2025-08-07T00:23:50",
      "Halloween comes before November"
    ],
    [
      "n7ca9u2",
      "2025-08-07T01:35:49",
      "What if you invest 1$ a week for the next year"
    ],
    [
      "n7cac0b",
      "2025-08-07T01:35:49",
      "The numbers in your scenarios are the same. The world around it is not. $100 Bitcoin days were the absolute wild west. Nobody knew what was going to happen with crypto or how high the ceiling could go or how it could rival fiat in the long run. That’s way more apparent in the $10,000 Bitcoin and beyond days. That understanding aids in being able to hold sats for the long term."
    ],
    [
      "n7cafgi",
      "2025-08-07T01:36:33",
      "They are saying they think it will be significantly more. Saying something is bearish means it is a lower return than expected outcome."
    ],
    [
      "n7cagoc",
      "2025-08-07T01:36:33",
      "Money for nothing and chicks for free"
    ],
    [
      "n7cahb5",
      "2025-08-07T01:36:33",
      "you must me hi on your own supply."
    ],
    [
      "n7cm85z",
      "2025-08-07T02:47:32",
      "That you should DCA instead."
    ],
    [
      "n7cmd3r",
      "2025-08-07T02:47:32",
      "The new bill allowing Crypto into the retirement planning game.  \nThere is a new boomer retiring every 6 seconds.  Rate cuts coming.... I wouldn't bet against it.  Not saying it will break $150k but it is very possible."
    ],
    [
      "n7cmd84",
      "2025-08-07T02:47:32",
      "The best answer in my opinion. People saying just to payoff the high interest debt.. in theory that's great and potentially maximizes returns. But the peace of mind of having no debt is unparalleled."
    ],
    [
      "n7ctmu6",
      "2025-08-07T03:36:36",
      "Negatory. It genuinely has the potential to be much more than that."
    ],
    [
      "n7cto5h",
      "2025-08-07T03:36:36",
      "Maybe, but it sit until a slide happens, the I buy more"
    ],
    [
      "n7ctpfz",
      "2025-08-07T03:36:36",
      "Exactly. If OP thinks it's 99% certain and the prediction market is trading at 80%, why not push in the whole stack?"
    ],
    [
      "n7cttl6",
      "2025-08-07T03:36:36",
      "Nice"
    ],
    [
      "n7d0dat",
      "2025-08-07T04:23:18",
      "Agree 💯"
    ],
    [
      "n7d0ear",
      "2025-08-07T04:23:18",
      "Nga"
    ],
    [
      "n7d0f5v",
      "2025-08-07T04:23:18",
      "It doesn't upset me too much because it would have been on MtGox and I would have lost it all, so I think that would piss me off more then never having bought it."
    ],
    [
      "n7d6qre",
      "2025-08-07T05:13:55",
      "1800s"
    ],
    [
      "n7dq4t2",
      "2025-08-07T08:09:10",
      "Who cares?"
    ],
    [
      "n7dq5t5",
      "2025-08-07T08:09:10",
      "I like this story, glad it’s worked out for you, can you share a bit more like how much approx you started with and how it ended up, what are the critics saying now?"
    ],
    [
      "n7dq8al",
      "2025-08-07T08:09:10",
      "So you're an old man who says \"may of\" and \"chad\" and gets chastised for being on the computer in their basement and lost their pension?  I don't believe you.  Why do people write this shit?  Is it just for the likes or are they hoping people will give them bitcoin?"
    ],
    [
      "n7dwf0x",
      "2025-08-07T09:10:08",
      "Holy shit this is nostalgic af."
    ],
    [
      "n7dwfox",
      "2025-08-07T09:10:08",
      "Take a big bolt, some wide washers and drill the words into them, for a better approach use Braille alphabet, put all washers on the bolt and you can weld shut a nut on the other end. It will be 100% best approach and you can do it yourself with a drill and a small metal bit. \n\nIf you like you can even cast it in a small cement decoration for your home. \n\nBest tip: don't buy all supplies in the same shop."
    ],
    [
      "n7dwilu",
      "2025-08-07T09:10:08",
      "So good to get thrown back in time with this gem. 2017 truly was another time in crypto. Wild!"
    ],
    [
      "n7ea03w",
      "2025-08-07T11:06:52",
      "Does he hive special needs?"
    ],
    [
      "n7ea1sd",
      "2025-08-07T11:06:52",
      "accumulating bitcoin like crazy"
    ],
    [
      "n7ej4tk",
      "2025-08-07T12:10:22",
      "blackrock do not even care about btc. they only care about the expense ratio (0.25%) of the ibit etf."
    ],
    [
      "n7ejaha",
      "2025-08-07T12:11:21",
      "i would hodl such a girl till death."
    ],
    [
      "n7f4rw3",
      "2025-08-07T14:02:20",
      "This guy knows what he doesn't know."
    ],
    [
      "n7f4ufg",
      "2025-08-07T14:02:20",
      "no I dont own a laptop I have a proper computer and no I dont use wifi. 👍"
    ],
    [
      "n7f4vxz",
      "2025-08-07T14:02:58",
      "No, we're not doing this trend again..."
    ],
    [
      "n7f5101",
      "2025-08-07T14:03:48",
      "he had 1700btc, even if he had sold half each time a big millstone number, 1$, 10, 100, 1,000, 10,000, he still would've had 53btc at 100k"
    ],
    [
      "n7f64qu",
      "2025-08-07T14:08:59",
      "as the price dumps again cause plebs panic selling."
    ],
    [
      "n7f691o",
      "2025-08-07T14:09:42",
      "I was being sarcastic but I forgot. This is Reddit and I can't use sarcasm without emojis or clarifying context."
    ],
    [
      "n7f69or",
      "2025-08-07T14:09:42",
      "What chart is that? Inverse btcusd?"
    ],
    [
      "n7f6a9l",
      "2025-08-07T14:09:42",
      "This video delayed me from getting into bitcoin for years."
    ],
    [
      "n7f6ae3",
      "2025-08-07T14:09:42",
      "Both can be true."
    ],
    [
      "n7f6b5y",
      "2025-08-07T14:10:00",
      "all in cause when it doubles next month you can then pay debts and still have seed money\n\n(fed cutting rates 17th september = fomo)"
    ],
    [
      "n7fi50e",
      "2025-08-07T15:07:32",
      "Treasuries that are paid off by printing dollars and taxing the ever living shit out of the income workers."
    ],
    [
      "n7fi8g7",
      "2025-08-07T15:07:32",
      ">why did bitcoin go down a bit\n\nThere are more people selling than buying.\n\nWhat's next? The network will continue to find a new block every 10 minutes on average, the miners will still mine, the nodes will keep doing their job. The rest is more or less irrelevant."
    ],
    [
      "n7fi9ks",
      "2025-08-07T15:07:32",
      "Thank you!! I have not sold! I plan till only buy more forever unless there is some obvious thing that would indicate we’re are going down. But, I don’t really see that. I think it had to come down a little because of how fast it shot up, only makes sense because leveraged positions."
    ],
    [
      "n7fibvn",
      "2025-08-07T15:08:05",
      "🤣🤣"
    ],
    [
      "n7fichb",
      "2025-08-07T15:08:05",
      "Summary: it's bullshit :)\n\nGreat to see critical thinking!"
    ],
    [
      "n7fids8",
      "2025-08-07T15:08:05",
      "When the world collapse at least you can still burn fiat for warmth!   /s"
    ],
    [
      "n7fuu6s",
      "2025-08-07T16:07:40",
      "lol rekt"
    ],
    [
      "n7fuude",
      "2025-08-07T16:07:40",
      "L"
    ],
    [
      "n7fuufb",
      "2025-08-07T16:07:40",
      "Never heard of that wallet"
    ],
    [
      "n7fuvjo",
      "2025-08-07T16:08:31",
      "This"
    ],
    [
      "n7fv0ml",
      "2025-08-07T16:08:31",
      "Money? You sold the money and bought an IOU to a digital fiat unable to beat real inflation.\n\nYou didn't double your money. You held money while fiat debased another 200% agains it."
    ],
    [
      "n7g4nx1",
      "2025-08-07T16:55:22",
      "I still can’t get over that bitty is just casually hanging around at well over 100k like it’s no big deal. My first purchase was at 1700 and this has been the absolute ride of my life."
    ],
    [
      "n7g4nyx",
      "2025-08-07T16:55:22",
      "And then Saylor would turn around and instantly use that cash to buy more bitcoin."
    ],
    [
      "n7g4pcv",
      "2025-08-07T16:56:08",
      "Well even if you lump some now, if you continue to earn fiat in the future, wouldn’t you buy more which is  effectively DCAing."
    ],
    [
      "n7g4ulv",
      "2025-08-07T16:56:08",
      "Accepting bitcoin is the biggest no brainer this side of the Mississippi"
    ],
    [
      "n7g4wt6",
      "2025-08-07T16:56:48",
      "Would it have been a good idea to have bought a ton of bitcoin with them between mid and late july 2010?"
    ],
    [
      "n7g4xff",
      "2025-08-07T16:56:48",
      "whats the fee?"
    ],
    [
      "n7g7fbc",
      "2025-08-07T17:08:25",
      "If your assets haven't quadrupled since 2020, you missed the goods goodship Lollipop \n\n💰 CHEERS  💰"
    ],
    [
      "n7g7fzf",
      "2025-08-07T17:08:25",
      "See? I got you to find a positive side like you asked."
    ],
    [
      "n7hduxc",
      "2025-08-07T20:29:31",
      "BTC doesn't care what Strategy does or doesn't do.  in fact, imagine Strategy losing all of their BTC?  What we're experiencing now is the new type of asset class creation (think 'Big Short' CDO model) of which people are leveraging investments in Bitcoin to make fiat money.  Let that sink in and then realize, everything is fine."
    ],
    [
      "n7ho76e",
      "2025-08-07T21:20:47",
      "Is this the true reason the buttcoin community exists"
    ],
    [
      "n7hq6mu",
      "2025-08-07T21:29:53",
      "One category which isn't included in that chart is the up and coming AI systems.  It will be interesting to see comparisons between BTC mining and AI ."
    ],
    [
      "n7hq885",
      "2025-08-07T21:30:09",
      "https://www.whitehouse.gov/fact-sheets/2025/08/fact-sheet-president-donald-j-trump-democratizes-access-to-alternative-assets-for-401k-investors/"
    ],
    [
      "n7hq8uo",
      "2025-08-07T21:30:22",
      "Stacking shors, not sats."
    ],
    [
      "n7hq9mu",
      "2025-08-07T21:30:22",
      "The picture is from @BitcoinMagazine on x"
    ],
    [
      "n7hqagq",
      "2025-08-07T21:30:31",
      "Thank you, I do. Again, don't buy any and have fun. Can you promise me you'll never buy any? Or you'll start learning instead?"
    ],
    [
      "n7hqdgb",
      "2025-08-07T21:30:55",
      "No doubt you could find some that do.\n\nBut actually it’s just a way of describing people born at a certain time:\n\nThe generation is defined as people born from 1946 to 1964 during the mid-20th-century baby boom that followed the end of World War II."
    ],
    [
      "n7hqe4u",
      "2025-08-07T21:30:55",
      "Picture source is from @BitcoinMagazine on x"
    ],
    [
      "n7hqgqa",
      "2025-08-07T21:31:25",
      "You presented an argument where 95% of the pie was gone, already held or lost. The remaining 5% have serious forces behind mining it. We are definitely not early. This is mid to late game now. Gains would be reflective of monetary policy and mining costs now."
    ],
    [
      "n7hx9kr",
      "2025-08-07T22:07:14",
      "It happens at NFL games fairly regularly"
    ],
    [
      "n7hx9re",
      "2025-08-07T22:07:14",
      "For those who have a strategy of borrowing on it later, yes, but with what do we repay the loan then? \nReal question I ask myself"
    ],
    [
      "n7hoh6l",
      "2025-08-07T22:58:52",
      "I don’t know if being famous is a reason to buy. People look at track record, trade volume, uniqueness of investment."
    ],
    [
      "n7i7yy8",
      "2025-08-07T23:06:44",
      "I hope you did. Will you be fair and post it up when I win?"
    ],
    [
      "n7ilat2",
      "2025-08-08T00:23:53",
      "Is Kraken Pro cheaper than normal Kraken? Checking Bitcoin on Kraken and the spread is terrible compared to River. "
    ],
    [
      "n7ix9wk",
      "2025-08-08T01:34:55",
      "Because no man has a attractive girlfriend or has ever had a threesome before your statement is void of logic"
    ],
    [
      "n7ixa4o",
      "2025-08-08T01:34:55",
      "That's okay, it just seems like you are being scammed"
    ],
    [
      "n7ixbjf",
      "2025-08-08T01:35:26",
      "My understanding is that agencies have 180 days (6 months) to allow it. Actual 401k plans can then choose to allow it or not thereafter to participants. Some will do that right away, some will do it later, and some won't consider it at all."
    ],
    [
      "n7ixi96",
      "2025-08-08T01:36:17",
      "https://wavlake.com/album/7aa138d0-6e94-4944-92c9-a41b8ca567ea\n\nThere is a song for this!"
    ],
    [
      "n7jgcm2",
      "2025-08-08T03:36:09",
      "\"if this\" \"if that\" is equal to imagining you have a time machine..."
    ],
    [
      "n7jmpy2",
      "2025-08-08T04:22:26",
      "There's nothing on this list about plans to impart high temperature damage to the federal reserve building"
    ],
    [
      "n7jmqw2",
      "2025-08-08T04:22:26",
      "If you’re nervous about it there’s something too risky for your brain. You either need to undertake more research to support your conviction or lower the amount invested."
    ],
    [
      "n7jt8dc",
      "2025-08-08T05:13:03",
      "Maybe he is Michael Saylor"
    ],
    [
      "n7jt8ok",
      "2025-08-08T05:13:03",
      "I use Strike for direct deposits and paying bills, and River to hold 3 months of savings/emergency funds to get 3.8% interest in BTC."
    ],
    [
      "n7jtbj5",
      "2025-08-08T05:13:38",
      "Where do you find this kind of economic data? I thought the US was in reasonably good shape,  with record lows in unemployment etc..."
    ],
    [
      "n7jtbmg",
      "2025-08-08T05:13:38",
      "So a family who is behind on their mortgage payments and bills are gonna spend their last bits of money on food and necessities or BTC?\nAnd again, you are thinking of USA only"
    ],
    [
      "n7jtcdb",
      "2025-08-08T05:13:38",
      "Quite similar. Even more similar to leveraging your stock value. The key is that bitcoin is a finite monetary asset with all the properties of a hard money like gold, but better/faster/stronger. Because the dollar will continue to be printed over time, bitcoin will naturally appreciate against the dollar’s debasement. \n\nThis means your loan’s liability reduces as Bitcoin appreciates. Check out this example to see how powerful this concept is:\n——-\nIf you take a $30,000 Bitcoin collateral loan with $100,000 in Bitcoin as collateral (at a Bitcoin price of $100,000), resulting in a 30% loan-to-value (LTV) ratio, what would the new LTV be for each 1x multiple increase in Bitcoin’s price from the initial loan position?\n\nStarting LTV: 30% ($30,000 loan / $100,000 Bitcoin value).\n\nFor each 1x multiple in Bitcoin price (e.g., $100,000 to $200,000):\n\t•\tLoan remains $30,000.\n\t•\tNew LTV = $30,000 / (new Bitcoin value).\n\nCalculations:\n\t•\t1x (BTC collateral value $200,000): $30,000 / $200,000 = 15%.\n\t•\t2x (BTC collateral value $300,000): $30,000 / $300,000 = 10%.\n\t•\t3x (BTC collateral value $400,000): $30,000 / $400,000 = 7.5%.\n\t•\t4x (BTC collateral value $500,000): $30,000 / $500,000 = 6%.\n\nEach 1x multiple greatly improves your loan’s health as the LTV reduces from the appreciation, as the loan’s dollar value stays fixed while collateral value increases.\n\nLike Michael Saylor says in the clip, this allows you to open a new loan and get out more funds to bring the loan to value back to where you like to keep it, 30% or 20%, whatever is comfortable for you."
    ],
    [
      "n7jzt0z",
      "2025-08-08T06:09:36",
      "It will get bought up, and only makes the next leg of growth more sustainable."
    ],
    [
      "n7k00b6",
      "2025-08-08T06:10:33",
      "Inspirational!"
    ],
    [
      "n7k00x9",
      "2025-08-08T06:10:33",
      "You're correct mate I venting because of what random people were destroying me for saying never sell your Bitcoin \n In situations, a bit childish really, but we should all be happy after waiting so long for this. You humbled me, happy stacking bruvver."
    ],
    [
      "n7kj5zx",
      "2025-08-08T09:09:30",
      "Totally agree! try to get people into bitcoin when it was cheap but they were not interested . now i focus on my journey"
    ],
    [
      "n7kj6c8",
      "2025-08-08T09:10:02",
      "I would wait for next years bear market, it would be to risky for me now"
    ],
    [
      "n7kj7hm",
      "2025-08-08T09:10:02",
      "If I don't sell, it won't go up"
    ],
    [
      "n7kj7vv",
      "2025-08-08T09:10:02",
      "Bullish enough not you are (Yoda)"
    ],
    [
      "n7kj9iq",
      "2025-08-08T09:11:01",
      "A good reply tou don't even need to make is:\n“You had three years, and all the internet. But sure, blame me for not dragging you to financial sovereignty like a toddler at Disneyland. Trying to save you from yourself is not in the best of your interest. That's your own task.\nBut don’t worry, you’ll get another chance — when it’s $500K and you’re blaming me again.”"
    ],
    [
      "n7kpa2n",
      "2025-08-08T10:06:46",
      "I did. Unexpected expenses can really do a doozie on ya. 😆"
    ],
    [
      "n7kpbpq",
      "2025-08-08T10:06:46",
      "Exactly! \n\nMiners will just mine more of it right!?\n\nThat's what happens with gold more demand and they will just find the gold somewhere just like Bitcoin, they will just find more Bitcoin.. ain't no supply shock\n\nProbably just double or even triple the halving rewards next year if supply really gets that bad.. \n\nPsh ain't no Fing supply shock.\n\n(Shh don't tell him one less buyer to compete with during this supply shock)"
    ],
    [
      "n7kpbpl",
      "2025-08-08T10:06:46",
      "sadly I can’t live in a bitcoin"
    ],
    [
      "n7kpfu1",
      "2025-08-08T10:07:48",
      "Sell the tops and buy the bottoms ,rest of the time just HODL !"
    ],
    [
      "n7kpfwe",
      "2025-08-08T10:07:48",
      "Ai guru"
    ],
    [
      "n7kwh4n",
      "2025-08-08T11:06:38",
      "I can understand you started studying Bitcoin only recently seeing your post and reply. Always remember to learn more about Bitcoin. Here is one of the best resources out there: [https://learnmeabitcoin.com/](https://learnmeabitcoin.com/)  \nTake care"
    ],
    [
      "n7kwia6",
      "2025-08-08T11:06:38",
      "Youth lounge burnish one."
    ],
    [
      "n7l5n6e",
      "2025-08-08T12:10:45",
      "have a cheap wedding party. stack sats together. save money by sharing the same roof. retire early."
    ],
    [
      "n7lfiyz",
      "2025-08-08T13:09:41",
      "Bitcoin… shouldn’t you be able to afford to pay an artist rather than rely on AI art."
    ],
    [
      "n7lfizl",
      "2025-08-08T13:09:41",
      "I wish even one person would have talked to me about BTC. I had to find out for myself too late."
    ],
    [
      "n7lfksl",
      "2025-08-08T13:09:41",
      "It doesn't make sense. Someone else can also take the funds, it's just chance who gets it then or hardware"
    ],
    [
      "n7lfnaq",
      "2025-08-08T13:09:41",
      "Same"
    ],
    [
      "n7lh6eh",
      "2025-08-08T13:18:15",
      "How to find old seed phrases for wallets containing btc or eth inside?!!!"
    ],
    [
      "n7lh78s",
      "2025-08-08T13:18:15",
      "Actually I’ve had people this year thank me for encouraging them to dca into BTC what they could afford to lose over the past 6 years and it’s quite satisfying."
    ],
    [
      "n7lh8i1",
      "2025-08-08T13:18:34",
      "Correct ✅"
    ],
    [
      "n7lh9ye",
      "2025-08-08T13:18:55",
      "Your btc shouldn’t factor in to you buying a car, you could get a car loan with a better interest rate using the car itself as collateral instead of a bitcoin loan.\n\nAnd really you should just save up to buy a car (fiat debt is evil) and maybe just drive a beater while you stack more bitcoin."
    ],
    [
      "n7lhalu",
      "2025-08-08T13:18:55",
      "About 6-7 years ago I sent a group text to 12 friends and started it off with \"This will be the last time I bring this up\".  I have kept that word and never once brought it up in conversation.  I have had a few friends reach out over the years for guidance, but the majority have done nothing.  \n\nI assume the rest continue to think \"its too late.  I missed it\".  Even as the price continues to rise substantially."
    ],
    [
      "n7lhbx4",
      "2025-08-08T13:18:55",
      "Honest doubt: what happens if the governments stop printing? How does it affect the economy and even bitcoins price?"
    ],
    [
      "n7lqgna",
      "2025-08-08T14:07:14",
      "I’m at about the same (rate per month). $900 in BTC the last I checked.  There is/was a $200 Sign up bonus and $50/referral.    \n\nThe card is metal and pretty hefty, but I was able to download the card to ApplePay as soon as I signed up.  I haven’t found a flaw yet."
    ],
    [
      "n7lqkah",
      "2025-08-08T14:07:54",
      "They were giving it away for free on 4chan. Then my friends started buying drugs with it maybe 3 years later."
    ],
    [
      "n7lqlyk",
      "2025-08-08T14:08:20",
      "Yeah, but you can easily cash out money at a bank. Or buy some gold to give it to the wrench guy. Technically he could force you to buy bitcoin and then transfer it to him. Registering on an exchange and transfering money only takes minutes these days and you can do everything from home.\n\nArguably it usually takes to the end of the day until the Crypto is on your wallet this way, compared to seconds, but it's still easy enough.\n\nIf you are criminal and violent enough, there are plenty of ways regardless in which way the victim holds the money. Real estate aside, as cashing that out is complicated as f. Unless the victim rather loses their life and family, then the criminal is s out of luck."
    ],
    [
      "n7lqlz2",
      "2025-08-08T14:08:20",
      "The amount of gold needed by industry is very small.  We have enough for 1000s of years.  Gold was used as currency long before it had any industrial use.\n\nIsnt everything of value is because \"people give it value\"?"
    ],
    [
      "n7lqox7",
      "2025-08-08T14:08:30",
      "Salutations! A fine proposal adding a rule to Bitcoin holding. Many speak of secrecy with coins and keys, shunning seed phrases. Yet, your insight shines: Bitcoin is a future investment, rising eternally. Thus, each holder must guard their health, ensuring they live long to reap the rewards. Wisdom indeed! Let us prioritize vitality alongside our satoshis."
    ],
    [
      "n7lqp3n",
      "2025-08-08T14:08:30",
      "> They haven’t factored anything greater than the number 35 legitimately\n\nThe fact they can actually factor it is problem on its own. \n\n---\n\n> and there has been basically no progress since 2014\n \nNonsense - there was massive progress in number of qubits we are able to operate. In 2014, we had like 9-12 qubits. Now we have at least 1100.  \n\nSo even if we never manage to create stable qubit, we will simply get enough qubits to use them as correction (i.e one qubit for calculation and for example 9 others for storing correct value)"
    ],
    [
      "n7m2yif",
      "2025-08-08T15:07:51",
      "sure"
    ],
    [
      "n7m31r7",
      "2025-08-08T15:07:51",
      "The US Dollar is backed by the military. Can you transform the piece of paper into a warhead ?\n\nSorry but dumb take man."
    ],
    [
      "n7ms6cq",
      "2025-08-08T17:07:12",
      "Bitcoin is not backed by energy. USD is backed by the US Army."
    ],
    [
      "n7n4zew",
      "2025-08-08T18:07:05",
      "Cool. Now close the app, forget about it and come back in 7 more years. "
    ],
    [
      "n7n4zzj",
      "2025-08-08T18:07:05",
      "Why is the curve accelerating at the start around 2010? Shouldn't it be a line like the in between the halvings?"
    ],
    [
      "n7n501k",
      "2025-08-08T18:07:05",
      "Can dusting be done with Bitcoin?"
    ],
    [
      "n7n58cs",
      "2025-08-08T18:08:08",
      "🧠"
    ],
    [
      "n7ngzor",
      "2025-08-08T19:05:43",
      "ChatGPT slop"
    ],
    [
      "n7nh075",
      "2025-08-08T19:05:43",
      "I'm pretty sure I am not there"
    ],
    [
      "n7ngyjj",
      "2025-08-08T19:05:43",
      "Because Crypto is now synonymous with right wing politics thanks to Trump."
    ],
    [
      "n7nh4wj",
      "2025-08-08T19:06:34",
      "Boy I ain’t no rich guy I don’t have allat , but for real I don’t"
    ],
    [
      "n7nh5ia",
      "2025-08-08T19:06:34",
      "This sub has 0 knowledge about anything on the Macroeconomic Level and its a bunch of highschoolers Larping that they are Hedge Fund Managers with their 0.0000000000001 Bitcoins lmao. Its so funny to read"
    ],
    [
      "n7nh6oj",
      "2025-08-08T19:06:34",
      "A quarter point less reward is a bargain for not having to deal with custody, estate planning, etc."
    ],
    [
      "n7nt84d",
      "2025-08-08T20:06:47",
      "The energy in Proof of Work isn’t waste, it’s what gives Bitcoin real world resistance to control. As Jason Lowery explains in Softwar, PoW physically constrains power through energy, like digital kinetic force. Proof of Stake may use less energy, but it centralizes control in the hands of the wealthy, turning the system into a plutocracy. PoW trades efficiency for true decentralization and sovereignty and that’s the whole point. Nobody will ever be able to deny or reverse your transaction on Bitcoin, Vitalik can."
    ],
    [
      "n7nt96y",
      "2025-08-08T20:06:47",
      "I used to be an activist about it. I would be sending people bitcoin from my phone, I would talk about it, I hosted seminars about it at work back in 2012. I tried to get friends and colleagues to split the cost of a GPU mining rig in 2011. Nothing really made a difference because people just thought I was a kook.\n\nThen I worked with people for a few years that were bitcoin 24x7 and it was amazing!\n\nNow when people ask me about bitcoin I just brush them off and move on. I never bring it up myself."
    ],
    [
      "n7o52m9",
      "2025-08-08T21:06:15",
      "yeah but imagine how stupid he feels now"
    ],
    [
      "n7o5881",
      "2025-08-08T21:06:15",
      "Is it an increase or decrease of percentages? It’s all about the directions in a chart compared to input energy."
    ],
    [
      "n7ogesr",
      "2025-08-08T22:05:55",
      "It is funny to hear educational institution \"investing\" in bitcoin (or any kind of asset for that matter). They are now running like hedge funds."
    ],
    [
      "n7ogfga",
      "2025-08-08T22:05:55",
      "“Trading bitcoin is a sign of lesser intellect”"
    ],
    [
      "n7ogg71",
      "2025-08-08T22:05:55",
      "Yeah, I think you miss mine though. Trivializing the required but shrinking market liquidity will lead to missed opportunity. As more and more liquidity is soaked up by pensions, whales, and as reserve transitions the cost will naturally rise."
    ],
    [
      "n7ogkmu",
      "2025-08-08T22:06:39",
      "We desperately need to."
    ],
    [
      "n7or3uj",
      "2025-08-08T23:06:47",
      "What if you didnt spend any miney ever again and bought BTC and starved and got depressed at your boring life?"
    ],
    [
      "n7or5sr",
      "2025-08-08T23:07:23",
      "Cheers, mate!"
    ],
    [
      "n7or5vj",
      "2025-08-08T23:07:23",
      "It's AI."
    ],
    [
      "n7orbiu",
      "2025-08-08T23:07:47",
      "DO NOT PUT IT IN EXODUS WALLET!!! If you have crypto in Exodus, GET IT OUT! Exodus uses a 3rd party within their app to facilitate \"swaps\"... Cripto Intercambio. At this point Exodus is highly aware Cripto Intercambio is stealing funds, yet they continue to use them within their app and on top of that dont disclose that fact. I had $30k stolen by them just swapping tokens. Exodus will tell EVERYONE who has money stolen that they need to contact Cripto Intercambio and perform KYC, knowingly passing the buck because they already know that even providing every document requested, you'll never see a dime of your funds. Exodus will very quickly just stop replying to emails. If you remotely think I'm lying or even slightly embellishing these claims just Google the 3rd party \"Cripto Intercambio Reviews\" and see for yourself. And if you're one of those people who'd respond with, \"Youre lying. I've been using them for years without a problem\". Please get your head out of the sand. Just because many people haven't had issues, there are MANY of us who've lost our life savings or a large portion of that hard earned money that took years to come up with. Move your crypto!"
    ]
  ],
  "btc": [
    [
      "n73vec9",
      "2025-08-05T19:57:37",
      "Yay you’re my hero"
    ],
    [
      "n764rj3",
      "2025-08-06T03:36:10",
      "this is probable spam\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/btc) if you have any questions or concerns.*"
    ],
    [
      "n76bo3e",
      "2025-08-06T04:23:36",
      "The way $WHITENET handles governance and community voice is something other projects should study."
    ],
    [
      "n771moy",
      "2025-08-06T08:08:42",
      "Believe whatever you wanna foo."
    ],
    [
      "n786yyb",
      "2025-08-06T13:20:38",
      "Use a portion of these gains to help p2p cash win."
    ],
    [
      "n7akksj",
      "2025-08-06T20:07:55",
      "Well you gotta train your mind to enter low and have exit strategy. Things I mostly learned at precisioncircle.online\nThey do free live calls and post educational content"
    ],
    [
      "n7akmag",
      "2025-08-06T20:07:55",
      "I want your fortune-telling ball"
    ],
    [
      "n7bjw8b",
      "2025-08-06T23:06:38",
      "There are more Miners now.  Hashrate is at a high.   (Although, Just a rough proxy for mining activity.)\n\nBut most importantly - HashPrice is at an all time low.    *Hash Price*.  \n\nMiners are free to do whatever they please.  But the existence of miners does not prove they are all profitable.  \nSome are burning investor money.  Not selling any mined BTC.  \nFree to do as they see fit.    \n.   \n\nMiners that I invest in are completely ready to pivot :     \n1. AI Computer & 2. Sell massive power hookups to AI Data Centers.     \nIt’s literally in their investor docs - build large power infrastructure; ride out BTC mining while it’s attractive.  Then sell to AI Data.    \n\nWe’ve all recently seen how companies pivot - even when times *should* be okay for mining.  But they know where this is headed.  \nBTBT, BMNR, BTCT, & others all dropping BTC mining - now, when it’s opportune.   Others will be forced to drop it in next bear market; and especially after the 2028 Halving.    \n\nOver time … next decade or so … you cannot escape the fact that Miner Revenue decays exponentially."
    ],
    [
      "n7bxwh8",
      "2025-08-07T00:23:50",
      "Prepare"
    ],
    [
      "n7f4xhp",
      "2025-08-07T14:02:58",
      "So in your world the government is responsible to make rules to prepress you from yourself?\n\nAnd in doing so, make it difficult for responsible people to have the freedom to pursue things that are best for them?\n\nLike a Nanny State?"
    ],
    [
      "n7f62ht",
      "2025-08-07T14:08:59",
      "Scam"
    ],
    [
      "n7furvp",
      "2025-08-07T16:07:40",
      "Many people have 401k’s from previous employers that are rolled over elsewhere and free to do what you want with it… I would gladly hold real crypto instead of ETF’s and grayscale products if this actually becomes possible"
    ],
    [
      "n7hq65i",
      "2025-08-07T21:29:53",
      "Do you like justice?"
    ],
    [
      "n7hq8mt",
      "2025-08-07T21:30:09",
      "Brawndo \n\nIt's got ELECTROLYTES"
    ],
    [
      "n7hqb8n",
      "2025-08-07T21:30:31",
      "I don't need fiat money monopoly"
    ],
    [
      "n7hqd2k",
      "2025-08-07T21:30:55",
      "Good luck with that interstate sponsored by Sysco."
    ],
    [
      "n7i7uci",
      "2025-08-07T23:06:44",
      "fuck trump"
    ],
    [
      "n7il7xw",
      "2025-08-08T00:23:28",
      "Bitcoin mining is only a portion of it. What about the rest of the crypto system?"
    ],
    [
      "n7il87i",
      "2025-08-08T00:23:28",
      "How much money do we waste on creating anime images in chatgpt? We waste so much shit in other areas"
    ],
    [
      "n7jztql",
      "2025-08-08T06:09:36",
      "And in your world, there is actually someone in multiple Bitcoin subs, which wishes to be controlled financially by the government ? Kinda far off, no? The hipocrisy would be unfathomable.\n\nAll i'm saying is, that i've seen people piss their life savings away in dogshit investments. And i chuckled at the remark from the utmost serious username the person had above me lmao."
    ],
    [
      "n7k6mi6",
      "2025-08-08T07:10:23",
      "What makes El Salvador different from Indonesia for you?"
    ],
    [
      "n7m315x",
      "2025-08-08T15:07:51",
      "bitcoin maximalism used to be reasonable, it just meant to copy the success of others to help make sure bitcoin always had the best features. but now it's burdened with \"not invented here\" syndrome. they cannot accept that someone outside their cabal ever had a good idea."
    ],
    [
      "n7nh7a9",
      "2025-08-08T19:06:34",
      "Throw 60% into bitcoin.  Not financial advice.  Whatever you do don't blow it. You're own your way to becoming a multi millionaire."
    ],
    [
      "n7or9b8",
      "2025-08-08T23:07:23",
      "They could have just as easily got into a scalable Bitcoin.  But it was sabatoged and crippled first, then they got in.  Once they had control they pumped it to get the attention and suppress any competition.\n\n**Who killed Bitcoin?**\n\n[https://odysee.com/@QuantumRhino:9/Who-killed-Bitcoin--(2022):8](https://odysee.com/@QuantumRhino:9/Who-killed-Bitcoin--(2022):8)"
    ]
  ],
  "solana": [
    [
      "n73vtq4",
      "2025-08-05T19:58:29",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73vz09",
      "2025-08-05T20:00:58",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wc82",
      "2025-08-05T20:00:58",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wl15",
      "2025-08-05T20:02:54",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wpli",
      "2025-08-05T20:03:26",
      "\nYour post has been automatically removed for violating our community guidelines on promotional content and meme coin spam. \n\nPromotion of Telegram groups, Discord servers, NFT projects, new sales, IDOs, referral links, meme coins, etc., is not permitted on r/Solana; therefore, your post has been REMOVED.\n\nIf you want to ASK or TALK about NFTs, meme coins, or promote referral links, there are other subreddits \"Unaffiliated With Solana\" dedicated to NFTs or Meme Coins like r/Memecoins, r/SolCoins, or r/SolanaMemeCoins (Use Them At Your Own Risk).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n750kd1",
      "2025-08-05T23:39:25",
      "Insane amount of institutional money incoming in next 5 years.\nCongratulations to all SOL hodlers"
    ],
    [
      "n75l1xa",
      "2025-08-06T01:35:49",
      "Happy cake day"
    ],
    [
      "n764ueo",
      "2025-08-06T03:36:10",
      "Just get more $WHITE and stop all that yapping and typing. GET MORE WHITE TODAY"
    ],
    [
      "n76bllc",
      "2025-08-06T04:23:36",
      "2.9 sol"
    ],
    [
      "n76visi",
      "2025-08-06T07:11:05",
      "Correct. I loose some weeks to overview all ways to get in this and finally i get out with same tougts"
    ],
    [
      "n77uwas",
      "2025-08-06T12:10:53",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79icld",
      "2025-08-06T17:08:43",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79icox",
      "2025-08-06T17:08:43",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79vi64",
      "2025-08-06T18:08:59",
      "What does it do?"
    ],
    [
      "n7a7v98",
      "2025-08-06T19:07:53",
      "Jupiter: best DEX, worst price chart. It’s giving ‘utility without love."
    ],
    [
      "n7bjtdi",
      "2025-08-06T23:06:38",
      "Not entirely. The recent bills that have passed, requires compliance, that Ethereum and others can't provide on their own. ChainLink provide those services, along with bridges to all major chains.\nWhy would you choose Ethereum over Solana to get the same result, whilst using the same api?"
    ],
    [
      "n7bjwh0",
      "2025-08-06T23:06:38",
      "Phantom"
    ],
    [
      "n7bjy5s",
      "2025-08-06T23:06:38",
      "I ain’t reading all that but Solana is the way."
    ],
    [
      "n7bk2l5",
      "2025-08-06T23:07:20",
      "The real question is how big a slice will Solana take? I think Solana will play a role but will it be 51%? Hard to say right now."
    ],
    [
      "n7bxwrg",
      "2025-08-07T00:23:50",
      "When you ape into a project, once you make 2-3x. Take 60% of your bag. Leave the remaining 40% as moon bag."
    ],
    [
      "n7cad5a",
      "2025-08-07T01:35:49",
      "What does all of this have to do wich blockchain technology? Jus donate to somebody that builds wells or something?"
    ],
    [
      "n7cagky",
      "2025-08-07T01:36:33",
      "You can go yourself and check the website on Mr beast bio to see that the funds were sent and we are doing what we set to do"
    ],
    [
      "n7cajtv",
      "2025-08-07T01:36:33",
      "my strategy: only buy top 20 coins by mc and just never sell"
    ],
    [
      "n7d6r9o",
      "2025-08-07T05:13:55",
      "I’m 100 percent BTC right now but thinking of adding SOL at 150"
    ],
    [
      "n7d6vmm",
      "2025-08-07T05:13:55",
      "I mean I was talking about SOL lmao I never discuss my btc allocations on here «  scared to get to post removed » 😂😂😂😂"
    ],
    [
      "n7e9yge",
      "2025-08-07T11:06:52",
      "No. Ur their exit liquidity.\n\n  \nTraders lose 99% of the time unless they have copy traders following them. \n\nwhy not join and grow a trustworthy and transparent community? 1 that votes on marketing initiatives with community marketing coins.\n\nIf your looking for a transparent memecoin, Check out Catapult Corgi Coin.\n\nOur goal is to be the next Turbo Toad Token. A community driven miracle.\n\nBeen around 6m+ now. We have 6 LPs between dif assets generating arb volume and fees and growing the pools. We hope to start burning coins soon and making dapps to burn coins. We are hoping to casually increase our volume to get verified on sol wallets and listed on CMC/CG\n\nSomewhere where you see the community all contributing. 10%\\~ of coins set aside for community voted marketing ideas.\n\nDev is doxxed. Has not sold 1 coin. 1B+ MCAP or nothing\n\nJoin the fam. [linktr.ee/catapultcorgicoin](http://linktr.ee/catapultcorgicoin) 7u3aEdtAfjb33aN58A56RSCYfMxHHUuMkiLsey3Ypump"
    ],
    [
      "n7ej6ed",
      "2025-08-07T12:10:22",
      "I have not received any emails from SOLANA regarding shipping.  No information attached to my email when I look it up.  But I have a confirmation number and a cleared transaction on card.\n\nAnyone have any suggestions?"
    ],
    [
      "n7ej9ho",
      "2025-08-07T12:11:21",
      "the griffain product seems to have been updated over the last couple month, I still use it. the team doesn't seem to be public  facing though which is worrying, but product is alive."
    ],
    [
      "n7f4sad",
      "2025-08-07T14:02:20",
      "check out [solscan.io](http://solscan.io) and you can trace this in real time to see where it came from and if it is a scam. enter your wallet ID there and you can see the info :)"
    ],
    [
      "n7g7e83",
      "2025-08-07T17:08:25",
      "First of all you can’t mine SOL. Number 2, don’t invest anything in crypto currency. Just focus on buying stocks because of the outcome."
    ],
    [
      "n7hdwos",
      "2025-08-07T20:29:31",
      "Generally you’d purchase a birdeye data plan, log in and generate an API key, also generally from your profile page though some of them display it prominently when you log in. Presumably you’ll then give it to this site and they’ll chew through your data allowance to do…whatever lol.\n\nAsk the AI for these types of questions and it will get you there 75% of the time, probably more reliable than reddit, but you have to provide enough context to get it headed the right direction and this post is barely enough to go on for me."
    ],
    [
      "n7hq65m",
      "2025-08-07T21:29:53",
      "Nice addition bro"
    ],
    [
      "n7hqelt",
      "2025-08-07T21:31:25",
      "surprised no one still said this, NEVER ANSWER ANY DM, you do, your fault if you lose your funds."
    ],
    [
      "n7hogvf",
      "2025-08-07T22:58:52",
      "Anyone willing to give me a free shitcoin? In return I’ll give you my SSN, dob, and mother’s maiden name."
    ],
    [
      "n7i6krx",
      "2025-08-07T22:58:52",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n7jtaut",
      "2025-08-08T05:13:03",
      "No shipping confirmation"
    ],
    [
      "n7k6oll",
      "2025-08-08T07:10:23",
      "Reddit bots lol love em😂"
    ],
    [
      "n7kp90u",
      "2025-08-08T10:06:46",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n7l5iuv",
      "2025-08-08T12:10:06",
      "its because of the mindset to make money thats why we are stuck"
    ],
    [
      "n7n53uq",
      "2025-08-08T18:07:31",
      "Meme engine: full throttle."
    ]
  ],
  "ethereum": [
    [
      "n73vty4",
      "2025-08-05T19:58:29",
      "Maybe I just misunderstood the goal, but I assumed it was to make sure no bugs (or fewer than 8) made it to the bottom of the screen."
    ],
    [
      "n73wen2",
      "2025-08-05T20:02:01",
      "Monday trading day activity a reflection of Fridays job report? Perhaps a delayed response to see sentiment before doing that big ol ETF dump?"
    ],
    [
      "n75l4pq",
      "2025-08-06T01:36:39",
      "༼ つ ◕_◕ ༽つ ETH TAKE MY ENERGY ༼ つ ◕_◕ ༽つ"
    ],
    [
      "n764upv",
      "2025-08-06T03:36:10",
      "The value is tied to that but the business operations & what they do is all onchain. They run a computer that runs an open-source software - it's nothing like a real business on a stock exchange in regard to disclosure of business activities."
    ],
    [
      "n795c18",
      "2025-08-06T16:07:40",
      "who would have guessed, finance guys aren't reading the repos to figure out where to bet, just waiting for another shillbro to lead the way."
    ],
    [
      "n79veyn",
      "2025-08-06T18:08:09",
      "I have to confess I do actually know that we will hit $3700, call me crazy all you want but it’s going to happen"
    ],
    [
      "n7akaxm",
      "2025-08-06T20:07:55",
      "Exactly. Amazed it even had to be said."
    ],
    [
      "n7dwgm1",
      "2025-08-07T09:10:08",
      "God I can't wait to see us break ATH and go into price discovery zone. IMO that's where the real volatility is gonna show up."
    ],
    [
      "n7ejc0e",
      "2025-08-07T12:11:21",
      "I love coming to see you all on green days. Red or flat? Feels like the day after a Vegas bender, people crying, deep despair, picking fights.\n\nToday's a good day."
    ],
    [
      "n7f4s2j",
      "2025-08-07T14:02:20",
      "Transferring eth into aaves version of eth can be considered a taxable event in some places. They technically issue you another token in exchange for your eth. The loan itself isn’t taxed"
    ],
    [
      "n7f4wrb",
      "2025-08-07T14:02:58",
      "I've had the same thoughts so I agree with what your saying.\n\nI think Tom Lee doesnt like conflict and is very polished in the way he communicates. He avoids making the other person wrong."
    ],
    [
      "n7f5384",
      "2025-08-07T14:03:48",
      "i was looking to include in my comment and failed lol. its assuredly very low, but its only really started in the last year or two. \n\nbut among the funds who are investing into crypto, they have allocated 2-5% roughly across the board."
    ],
    [
      "n7f66c6",
      "2025-08-07T14:09:42",
      "Don't listen to Eeyore. A 1% allocation is a very reasonable target over the next few years as the price rises (and therefore so does crypto awareness) and the wealth mgt companies themselves push their ETF product to their customers. Look at the pooh poohing of the ETF's, especially ETH at the beginning and what has happened since."
    ],
    [
      "n7g4qsd",
      "2025-08-07T16:56:08",
      "Just make them convert it to your local currency and pay you.\n\n\nIf they won't, aks them why.\n\n\nThey may be worried that selling their ETH would result in a capital gain being reported to their tax authority, and think that they can evade taxes by paying you directly. \n\n\nIf that is their goal, they may be breaking the law (this all depends on your jurisdiction). "
    ],
    [
      "n7g4xoc",
      "2025-08-07T16:56:48",
      "Just watched the hyped Bankless Tom Lee interview, didn't see much signal in it. He never said anything that made me think \"Okay, that was smart\", never picked up on any thread of the discussion and elaborated elegantly on it.\n\nIt's nice that he has influence and is on the side of *my bags*^(TM), but please don't make anything bigger out of him."
    ],
    [
      "n7g4zk6",
      "2025-08-07T16:56:48",
      "I wonder how many people who were thinking about investing in ETH treasury companies, will instead just invest directly in ETH the asset through their 401k if this holds true."
    ],
    [
      "n7hq9vl",
      "2025-08-07T21:30:22",
      "> FUNDAMENTAL GLOBAL INC FILES $5 BILLION SHELF OFFERING, INTENDS TO USE PROCEEDS TO ACQUIRE ETH\n\nhttps://x.com/PhoenixNewsIO/status/1953559155093999764"
    ],
    [
      "n7hx7dt",
      "2025-08-07T22:07:14",
      "Wow awesome man thanks for the knowledge"
    ],
    [
      "n7jgapq",
      "2025-08-08T03:36:09",
      "So you're suggesting that on the loss of potentially $billions he'd just walk away with his pockets full and without facing a single law suit, threat or anything at all that might cause him a few sleepless nights? You know that for certain?"
    ],
    [
      "n7jmq3o",
      "2025-08-08T04:22:26",
      "sell a whole stack"
    ],
    [
      "n7kpdpg",
      "2025-08-08T10:07:48",
      "KYC/DC – For Those About to Hodl"
    ],
    [
      "n7kpfr3",
      "2025-08-08T10:07:48",
      "There a lot of multi round trippers that planned to sell at 4k that are already eying the new moon price predictions. We all now how that ends..."
    ],
    [
      "n7kwfr6",
      "2025-08-08T11:05:56",
      "This is our time. 4k EOD"
    ],
    [
      "n7lh7gl",
      "2025-08-08T13:18:15",
      "Axie is still good Money to this day as well. Made most of my money off that and it still prints to this day. Unbelievable really"
    ],
    [
      "n7lqelc",
      "2025-08-08T14:07:14",
      "what a fucking tease"
    ],
    [
      "n7lqlie",
      "2025-08-08T14:07:54",
      "This battle isn't won yet"
    ],
    [
      "n7lqm9t",
      "2025-08-08T14:08:20",
      "last chance to buy above $4k!"
    ],
    [
      "n7lqoiy",
      "2025-08-08T14:08:20",
      "We've earned it."
    ],
    [
      "n7lqpmb",
      "2025-08-08T14:08:30",
      "So it seems :) enjoy man"
    ],
    [
      "n7m2yri",
      "2025-08-08T15:07:51",
      "😂"
    ],
    [
      "n7n4xzv",
      "2025-08-08T18:06:47",
      "3 eyes day!"
    ],
    [
      "n7n4zke",
      "2025-08-08T18:07:05",
      "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ethereum) if you have any questions or concerns.*"
    ],
    [
      "n7n51i0",
      "2025-08-08T18:07:31",
      "aggr.trade?"
    ],
    [
      "n7n567e",
      "2025-08-08T18:07:47",
      "Where were you last year?"
    ],
    [
      "n7ngyy9",
      "2025-08-08T19:05:43",
      "Ah, right. Yes the elasticity is lower near each psychological number and as a function of time, narrative, etc. I expect around November-Jan there will be enough 4 year cyclers to either cause a big drop or at least drastically lower the elasticity. I don't know how long these treasury companies intend to take to acquire all their ETH but shorter is better for me."
    ],
    [
      "n7nh2nt",
      "2025-08-08T19:06:14",
      "[So apparently next to the buy button there's a sell button](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fyy4nicavesx21.jpg%3Fwidth%3D1080%26crop%3Dsmart%26auto%3Dwebp%26s%3D222196dc37abfd325996d0c3218772c808727a11)"
    ],
    [
      "n7nh2vt",
      "2025-08-08T19:06:14",
      "Yea, scam. 10000%"
    ],
    [
      "n7oqzbc",
      "2025-08-08T23:06:01",
      "I'd just hate to see people holding for years just to miss the great repricing"
    ],
    [
      "n7or22x",
      "2025-08-08T23:06:01",
      "[Go Ray Go! ](https://suno.com/s/9bOhPC8ZaM1ik7N6)"
    ],
    [
      "n7or5q1",
      "2025-08-08T23:07:23",
      "Shoutout to all the perma bulls about Eth like me that live here. I hope all the people that added remind me bot replies to my previous bull posts make good.  \n\n$4k target met, we're on to the next target of the ATH soon, then we hit price discovery.  Things have never been so bulllish fundamentally, we are going much higher.\n\nBe prepared, I'm not sure most people realise how crazy things can get in the coming months."
    ]
  ],
  "dogecoin": [
    [
      "n73wg6o",
      "2025-08-05T20:02:01",
      "And my dad will finally come back with the milk."
    ],
    [
      "n74u35k",
      "2025-08-05T23:03:47",
      "I look at the month to month and 3 month to 3 month."
    ],
    [
      "n758bnh",
      "2025-08-06T00:22:47",
      "They also sell for what the cool kids call fiat currency"
    ],
    [
      "n75kzp9",
      "2025-08-06T01:35:49",
      "Feels good to buy, but isn’t it foolishness when the price will soon drop by more than 30%?"
    ],
    [
      "n764waw",
      "2025-08-06T03:36:10",
      "Oh, you need clarification after 6 months of it playing out in front of your face and proving my statement 100% correct?"
    ],
    [
      "n76bkro",
      "2025-08-06T04:23:36",
      "You’re not bullish enough"
    ],
    [
      "n76ble3",
      "2025-08-06T04:23:36",
      "📈📈"
    ],
    [
      "n771mu7",
      "2025-08-06T08:08:42",
      ".069 maybe lol"
    ],
    [
      "n786txe",
      "2025-08-06T13:19:57",
      "I will be messaging you in 1 month on [**2025-09-17 13:18:21 UTC**](http://www.wolframalpha.com/input/?i=2025-09-17%2013:18:21%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/dogecoin/comments/1miv110/690_within_weeks/n786o4m/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fdogecoin%2Fcomments%2F1miv110%2F690_within_weeks%2Fn786o4m%2F%5D%0A%0ARemindMe%21%202025-09-17%2013%3A18%3A21%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201miv110)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
    ],
    [
      "n78spul",
      "2025-08-06T15:08:41",
      "These types of post is trolling"
    ],
    [
      "n795983",
      "2025-08-06T16:07:40",
      "airplanes are down from their highs 99% of the time, when they are on the ground. Means they will never manage to fly again because... 99% below ATH... that's so bad and means that airplanes can't fly. of course."
    ],
    [
      "n7959w4",
      "2025-08-06T16:07:40",
      "My grandma always said if you’re good at something you never do it for free. And I’m not getting paid to draw more lines"
    ],
    [
      "n795g7z",
      "2025-08-06T16:08:53",
      "what cost you $1 in 1920 cost you $137 in 2020. \n\nThe only chance that doge will not hit a dollar is if it loses more than 99.9% of its value over the next 100 years."
    ],
    [
      "n79ida1",
      "2025-08-06T17:08:43",
      "No it was ony gonna be wasted on silly things like food bills and pension, at least now its doing something worthwhile"
    ],
    [
      "n79ie62",
      "2025-08-06T17:09:31",
      "Ill still have my legs kicked up with out any worries. My bills are paid"
    ],
    [
      "n7a814o",
      "2025-08-06T19:08:32",
      "Maybe you’re doing too much buying and selling."
    ],
    [
      "n7akaly",
      "2025-08-06T20:07:55",
      "When 2 trillion USD gets liquidated from the market.  Cycles over."
    ],
    [
      "n7aklkt",
      "2025-08-06T20:07:55",
      "\"Gonna\" is also a Low IQ way to say it.  Why not just type properly?  "
    ],
    [
      "n7bk2na",
      "2025-08-06T23:07:20",
      "Fuck me mate, 244 days to late"
    ],
    [
      "n7cm8cx",
      "2025-08-07T02:47:32",
      "Damn you still use robinhood? Wow"
    ],
    [
      "n7f4zfa",
      "2025-08-07T14:03:48",
      "When?"
    ],
    [
      "n7f54kf",
      "2025-08-07T14:03:48",
      "When friends who generally don't care about crypto start to show interest"
    ],
    [
      "n7f6cdg",
      "2025-08-07T14:10:00",
      "kindness suffers, when you see the exact same post persist over years, because the people who like to copy memes are more than the people who like to educate themselves.\n\nBut I've grown up in a world where the stupid were aware of being stupid and it was a better system. These days, everyone is mommies special angel and can't be wrong about anything and that's exhausting. People need their reality check again. Humanity just does not work when everyone thinks they are a genius."
    ],
    [
      "n7fi6sz",
      "2025-08-07T15:07:32",
      "A tony step in price action, a giant leap towards rocketing to the moon."
    ],
    [
      "n7fidv1",
      "2025-08-07T15:08:05",
      "5% is hardly a sky rocket"
    ],
    [
      "n7fv0gs",
      "2025-08-07T16:08:31",
      "Bro woke up eatin’ scooby doo snacks"
    ],
    [
      "n7fv0q1",
      "2025-08-07T16:08:31",
      "D.oing O.ur G.roup E.xercise\n💎🙌🏼 https://youtu.be/p3gxVaOx-j4?si=xWah_YSP7DReRQnO"
    ],
    [
      "n7g4owx",
      "2025-08-07T16:55:22",
      "The first rule of dogecoin is you don’t talk about dogecoin."
    ],
    [
      "n7hq8xx",
      "2025-08-07T21:30:22",
      "You people are such a fning joke"
    ],
    [
      "n7hqe1h",
      "2025-08-07T21:30:55",
      "It’s not up on the month you idiots"
    ],
    [
      "n7i7u5c",
      "2025-08-07T23:06:44",
      "Time will tell how the retail reacts to such bs news."
    ],
    [
      "n7il4l4",
      "2025-08-08T00:22:54",
      "Gotta raise to 7.77 🎰"
    ],
    [
      "n7ilcga",
      "2025-08-08T00:23:53",
      "It was tanking as I was watching the Canelo fight in Vegas. I was just unaware. Greed told me it’ll keep going up. SMH   I was also brand new into trading and just being aggressive on the hype. Live and learn."
    ],
    [
      "n7j91tp",
      "2025-08-08T02:47:55",
      "Bitcoin dominance dropping like a rock. things look good"
    ],
    [
      "n7kj5s1",
      "2025-08-08T09:09:30",
      "Right now, most people in crypto see the fact that we had no ath followed by a crash in spring of 2025 as a sign that it isn't over, but delayed.\n\nBut you're doing great. When there is a massive bull run you can't really miss it, so going on with your life and not obsessing over the ticker is smart."
    ],
    [
      "n7lh7na",
      "2025-08-08T13:18:34",
      "You should drink some 🥛!"
    ],
    [
      "n7lql25",
      "2025-08-08T14:07:54",
      "I regret panic profit selling... over.. and over.. and over..\n\nNow I buy a set amount every 2 weeks if it's under a specific set amount."
    ],
    [
      "n7n53hk",
      "2025-08-08T18:07:31",
      "Just keep buying…. Don’t sell."
    ],
    [
      "n7n54b2",
      "2025-08-08T18:07:47",
      "I don’t hope for anything. I just let the charts do their thing. Not going to be one of these guys who says “honestly $1 or $5” idk that may never happen. Let’s just see where it goes."
    ],
    [
      "n7n55w9",
      "2025-08-08T18:07:47",
      "what wallet do you recommend then, im looking for one."
    ],
    [
      "n7o59gu",
      "2025-08-08T21:06:15",
      "This is the way"
    ],
    [
      "n7o5a9d",
      "2025-08-08T21:06:44",
      "Bitcoin is flat on the day. Not sure where you are seeing “bitcoin going down”"
    ],
    [
      "n7ogf2s",
      "2025-08-08T22:05:55",
      "This is intuitive to me. It’s like when a weather man says its’s going to snow, has all the science to show that it’s going to snow, blasts all media that it’s going to snow, and you just get flurries. Weather men are then very good at explaining why they were still correct, even though their prediction did not pan out. This is EXACTLY the same thing."
    ],
    [
      "n7ogj7e",
      "2025-08-08T22:06:39",
      "Look at the 5 year % gains for both of them and then you'll understand"
    ],
    [
      "n7ogku5",
      "2025-08-08T22:06:39",
      "By the way, I put the internet weather men on blast when they are incorrect too."
    ]
  ],
  "CryptoCurrency": [
    [
      "n73wixt",
      "2025-08-05T20:02:01",
      "People who are in profit"
    ],
    [
      "n73wm37",
      "2025-08-05T20:02:54",
      "Yes, post office has to open and scan each letter to make sure nobody is sending child pix with it."
    ],
    [
      "n73wrw2",
      "2025-08-05T20:03:26",
      "The ruling class are certainly treating it like one"
    ],
    [
      "n74ct08",
      "2025-08-05T21:28:56",
      "You stupid fuckhead who FUD off this shit. You're either too ignorant about the entire ripple/XRP process or you are just working for ulterior motives which surely are for your own benefit. \n\nEVERY FUCKING MONTH Ripple does this. It's written into their protocol and they must. \n\nThis is taking coins out of circulation and it is not selling of any type. \n\nThe number of ass wipes that want to shit on crypto to pump their own interests is disgusting. \n\nIt doesn't matter if you're a ripple fan or not, at least know what the hell you're talking about when you give people you're fucked up investment advice that you just blew out of your ass."
    ],
    [
      "n750fg6",
      "2025-08-05T23:39:25",
      "Alright, back @ $36XX ETH. Let's build on this."
    ],
    [
      "n750gai",
      "2025-08-05T23:39:25",
      "We going back to pencil and paper boys!"
    ],
    [
      "n750lvw",
      "2025-08-05T23:39:25",
      "If you hold $ADA don‘t forget to claim your midnight airdrop! Cardano gets the biggest allocation but other chains are also eligible. (f.e. $ETH, $SOL, $XRP, $BTC …)"
    ],
    [
      "n758afm",
      "2025-08-06T00:22:47",
      "I get usdc on coinbase with 0 fees in and out. It can be transferred using base or stellar for almost no cost."
    ],
    [
      "n75l076",
      "2025-08-06T01:35:49",
      "This happened to me on binance when btc was below 10k.\n\nSwitched to huobi ( htx now ) \n\nNever looked back"
    ],
    [
      "n75l2t7",
      "2025-08-06T01:35:49",
      "I‘m sure everyone is in crypto for the gains, but realistically the risks nowadays simply outweigh the potential gains"
    ],
    [
      "n76vlha",
      "2025-08-06T07:11:05",
      "It's not working with mobile wallets either, for me. I tried with Yoroi and Lace, same thing."
    ],
    [
      "n77lp4n",
      "2025-08-06T11:07:35",
      "Your [comment](https://www.reddit.com/r/CryptoCurrency/comments/1minliw/cardano_midnight_glacier_just_went_live_claimable/n77lgpt/?context=3) was automatically removed because you [linked](https://www.reddit.com/r/CryptoCurrency/comments/1minliw/cardano_midnight_glacier_just_went_live_claimable/n77lgpt/?context=3) to an external subreddit without using an NP subdomain for no-participation mode. When linking to external subreddits, please change the subdomain from `https://www.reddit.com` to `https://np.reddit.com`. This simple change substantially reduces [brigading](https://www.reddithelp.com/en/categories/rules-reporting/account-and-community-restrictions/what-constitutes-vote-cheating-or). \n\n**NOTE:** The AutoModerator will not reapprove your content if you fix a URL. However, if it was a post which had considerable activity in its comment section, you can message the modmail to request manual reapproval. If it was a comment, just make a new comment. \n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "n77v1fl",
      "2025-08-06T12:10:53",
      "Thank you for submitting to /r/CryptoCurrency,\n\nYour post has been removed because there are already 2 posts about Politicians in the top 50. You may post it again when the topic is no longer at the limit.\n\n---[**Click here for a link to view the current limits**](https://www.reddit.com/r/CryptoCurrency/wiki/topic_limits)---\n\n*I am a bot, and this action was performed automatically. Please contact the [moderators of this subreddit](https://www.reddit.com/message/compose?to=%2Fr%2Fcryptocurrency) if you have any questions or concerns.*"
    ],
    [
      "n786z6v",
      "2025-08-06T13:20:38",
      "I didn’t say a 15% tariff will raise the price 50%, but a 50% tariff can ;)\n\nHence why I wrote 10-50%.  Because right now this is the range of what’s been applied to imported goods"
    ],
    [
      "n78spz9",
      "2025-08-06T15:08:41",
      "Nah man I'm destitute because of this massive dip"
    ],
    [
      "n795chx",
      "2025-08-06T16:08:53",
      "BTC looks strong"
    ],
    [
      "n795h1c",
      "2025-08-06T16:08:53",
      "bull run continues"
    ],
    [
      "n795lbu",
      "2025-08-06T16:08:53",
      "Buy high and sell low always, otherwise folks need to gtfo of this subreddit\n\n(/s in case)"
    ],
    [
      "n79ih6c",
      "2025-08-06T17:09:31",
      "Oh trust me, I know, I despise the guy. I'm simply saying, if he keeps bullshitting about fake numbers he's actually hurting his own chances of a rate cut, which he's been begging for all year. I don't think he even realizes how dumb his position is right now.\n\nIf you want to pretend the job market is strong and everything is perfect, why cut rates as you demand? So stupid lol."
    ],
    [
      "n79viok",
      "2025-08-06T18:08:59",
      ">“OTC trade desks’ collective balances are **down to around 155,000 BTC.** As the OTC desks run low, the demand on the public exchanges will increase, and that is what will uncork BTC’s price.”\n\nStrategy alone will probably buy this up by the end of the year."
    ],
    [
      "n79vj74",
      "2025-08-06T18:08:59",
      "Trump finally gets the thing he needs to convince J to cut and he loses his shit over it. What fucking world are we living in"
    ],
    [
      "n79vjvk",
      "2025-08-06T18:08:59",
      "![gif](giphy|fan78Laj0Lm5I5OlM6|downsized)"
    ],
    [
      "n7a7w12",
      "2025-08-06T19:07:53",
      "use Brave browser. Be plagued by pop-ups and re-directs no more"
    ],
    [
      "n7a7xlr",
      "2025-08-06T19:07:53",
      "wtf"
    ],
    [
      "n7a80f3",
      "2025-08-06T19:07:53",
      "Crazy how bullish Tom Lee is on ETH.  Of course he chairs an ETH treasury company so take with a grain of salt I suppose."
    ],
    [
      "n7bjx89",
      "2025-08-06T23:06:38",
      "Bro, bonk guy is extremely legit ... *extreeeeemely legit*. I call him Uni, sometimes because i noticed many of his friends on CT did. He explained that his username came from Uniswap and Pancakeswap.  \"The Uniswap and Pancakeswap guy\" isn't near as cool as BONK GUY.  Hence, his infamous trade you now know about. I mean dude called it too. And CT faded him. \n\nI have been following Uni on the solana blockchain and on CT (aka crypto twitter).  Twitter attacked his ass, everyone faded and kept fading, and fading.  And $bonk went on a absolute fucking tear! \"Bonk Guy was right\" - they all said. Holy shit man go and check for yourself. That's what makes crypto so damn much fun. And i know you know crypto, I'm speaking in generalities in case any normies are in here. They NEED to hear this too. \n\nUnfortunately (and fortunately) my situation with crypto didn't really start until Q3 of 2024. What bonk guy did drew me in.  And i was a bit skeptical at first, but all the data is there. All provable, on chain!!! Dude's a legend! \n\n  \nAND THIS IS WHY I AM HERE TYPING THIS RESPONSE.  *I BELIEVE IN BONK GUY!* MANY ALREADY DO!\n\nLook up any big \"crypto KOL\" on twitter and see if they have comments about Bonk Guy.  The fud spreaders are usually just paid attacks, sincerely. It's crypto for crying out loud - anything goes really in the wild west.   \nAnyway, check out, hell *ASK*, people like Ansem ([@blknoiz06](https://x.com/blknoiz06)).  He is a clear Bonk Guy supporter on the CT timeline.  I mean, it's fucking Ansem! Dude is a legend. Both bonk guy and Ansem have proven themeselves and their trades on chain and have mad respect for each other.  In crypto these dudes are a big mf-ing deal. \n\nAnyway. #USELESS coin is my ticket out of here. It should be yours too. It should be everyones.  But that's the beauty of Useless coin. There's no bullshit. Like EVERYTHING OTHER THAN BTC. i mean come on. BTC is gold. The rest are companies. Companis come and go. Let's ride teh golden memecoin. THE #USELESS COIN.  \n\n  \nAnd dude, i write. Im a shitty ass trader. Hence why i follow Uni / Bonk Guy.  Dude is so damn legit and his TA is spot on.  But again, im a writer. Not a trader.  Get it yet?\n\nHIGHER!!!"
    ],
    [
      "n7bk09n",
      "2025-08-06T23:07:20",
      "United the Devided States of America."
    ],
    [
      "n7bk1od",
      "2025-08-06T23:07:20",
      " Do you guys think trump will put tarrifs on etherium or solana????"
    ],
    [
      "n7bk3jh",
      "2025-08-06T23:07:20",
      "Bitpoopex"
    ],
    [
      "n7caakf",
      "2025-08-07T01:35:49",
      "Also want to add, XRP has the same utility as any other L1. It’s not a Swift replacement and will never be one. Swift is using chainlink to upgrade their messaging system to connect legacy systems to blockchain. Chainlink is on track to become the most widely adopted blockchain infrastructure over the next five years and most people don’t even know what Chainlink does."
    ],
    [
      "n7cafe0",
      "2025-08-07T01:35:49",
      "This sounds like a good start for me, what with the ability to put payment requests so I thank you for that. Is there any function in place where someone can send fiat currency and then I can convert it from there? I’m trying to avoid having any of the card companies like Mastercard wherever possible"
    ],
    [
      "n7cmbmf",
      "2025-08-07T02:47:32",
      "its a reverse funnel system"
    ],
    [
      "n7ctquv",
      "2025-08-07T03:36:36",
      "The experts seem to be wrong a lot."
    ],
    [
      "n7d0a2y",
      "2025-08-07T04:23:18",
      "entering way late. bad risk reward."
    ],
    [
      "n7d0byy",
      "2025-08-07T04:23:18",
      "agreed"
    ],
    [
      "n7d6rdo",
      "2025-08-07T05:13:55",
      "Then can i interest you in a coin which was the largest gainer of the 2017/18 bull run and the current one"
    ],
    [
      "n7d6unh",
      "2025-08-07T05:13:55",
      "I’d kill for a short squeeze right now."
    ],
    [
      "n7dq3il",
      "2025-08-07T08:09:10",
      "R/CryptoCurrency should be number 1"
    ],
    [
      "n7dq4dk",
      "2025-08-07T08:09:10",
      "Unpopular opinion. Sounds like an idiot. Trading memecoins is for gamblers & scammers.\n\nThose influencers saying you can are all pushing their bags on you and making their coins selling after telling you to buy.\n\nOn that note. I made my own. Catapult Corgi Coin been around 6m+ now. We have 6 LPs between dif assets generating arb volume and fees and growing the pools. We hope to start burning coins soon and making dapps to burn coins.\n\nSomewhere where you see the community all contributing. 10%\\~ of coins set aside for community voted marketing ideas.\n\nDev is doxxed. Has not sold 1 coin. 1B+ MCAP or nothing\n\nJoin the fam. 7u3aEdtAfjb33aN58A56RSCYfMxHHUuMkiLsey3Ypump"
    ],
    [
      "n7dwezg",
      "2025-08-07T09:10:08",
      "nope, no one cares abt them"
    ],
    [
      "n7e9yqc",
      "2025-08-07T11:06:52",
      "Screenshots exhausted...."
    ],
    [
      "n7ea0ho",
      "2025-08-07T11:06:52",
      "they will now all rush to build a btc reserve 😎"
    ],
    [
      "n7ej6kn",
      "2025-08-07T12:10:22",
      "Yes"
    ],
    [
      "n7ej7ct",
      "2025-08-07T12:10:22",
      "tldr; President Donald Trump is set to sign an executive order allowing alternative assets like private equity, cryptocurrencies, and real estate into 401(k) retirement plans. The order directs the U.S. Secretary of Labor to review fiduciary guidance on private market investments in defined-contribution plans governed by ERISA. This move is seen as a victory for private asset managers and could expand investment options in 401(k)s, which collectively hold $8.7 trillion in assets.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "n7ej7ef",
      "2025-08-07T12:10:22",
      "[Gresham's law](https://en.wikipedia.org/wiki/Gresham%27s_law)"
    ],
    [
      "n7ej7vx",
      "2025-08-07T12:11:21",
      "I don't think they'll say No but have to protect pensions. So they could say sure, up to 2% can be these other things, if you are under 30yrs old. \n\nGoing to take a bit more time to come up with guidelines which don't result in a bunch of people suddenly unable to retire."
    ],
    [
      "n7ejctj",
      "2025-08-07T12:11:21",
      "Pera on Algorand lets you buy anything that accepts a card."
    ],
    [
      "n7f4rsy",
      "2025-08-07T14:02:20",
      "I buy peace of mind."
    ],
    [
      "n7f4xa4",
      "2025-08-07T14:02:58",
      "Private equity is really risky and often full of corruption, scams, and extremely predatory behavior.\n\nJust what we needed."
    ],
    [
      "n7f4yq8",
      "2025-08-07T14:02:58",
      "Sell the news brother"
    ],
    [
      "n7f4z8i",
      "2025-08-07T14:03:48",
      "certainly had the resources and connections to get it done though"
    ],
    [
      "n7f60br",
      "2025-08-07T14:08:59",
      "Want to know more about onion routing..."
    ],
    [
      "n7f65a6",
      "2025-08-07T14:08:59",
      "what a shitty headline 😂"
    ],
    [
      "n7f6aix",
      "2025-08-07T14:10:00",
      "take profit orders filled, PNL's all green, life is good. hope everyone has a great day"
    ],
    [
      "n7f6cf9",
      "2025-08-07T14:10:00",
      "The child fucker Donald J Trump? The pedophile rapist child fucker? THAT Donald J Trump? The child fucker rapist Donald J Trump?"
    ],
    [
      "n7fi5dq",
      "2025-08-07T15:07:32",
      "TOKEN FINALLY NEEDED"
    ],
    [
      "n7fidmn",
      "2025-08-07T15:08:05",
      "How so? Did you read the article?"
    ],
    [
      "n7fuslf",
      "2025-08-07T16:07:40",
      "class of 2017. I just laugh a lot"
    ],
    [
      "n7g4oe5",
      "2025-08-07T16:55:22",
      "I remember when Biden appointed Gary Gensler."
    ],
    [
      "n7g4po7",
      "2025-08-07T16:56:08",
      "Ah yes but there's a double plum grande forming in the datalake"
    ],
    [
      "n7g7e85",
      "2025-08-07T17:08:25",
      "Nice crypto can now be our 401k. Now dump it"
    ],
    [
      "n7g7edg",
      "2025-08-07T17:08:25",
      "Towns is a token"
    ],
    [
      "n7hdu2f",
      "2025-08-07T20:29:31",
      "One Chain to LINK them all, one Chain to find them, One Chain to bring them all, and in the darkness bind them\n\n![gif](giphy|NVBR6cLvUjV9C)"
    ],
    [
      "n7hdxf6",
      "2025-08-07T20:29:31",
      "What's stopping them from doing that before this?  The stock market is literally FULL of risky assets and ETFs.\n\nBlackrock, like other ETF providers, want retirement accounts to buy their ETFs so they can collect fees.  \n\nIf Blackrock ETFs fuck over retirement accounts and those values drop, they first lose revenue and second will lose actual buyer of their ETFs. \n\nAlso the **plan administrator** chooses what plans to offer and they are legally obligated to have fiduciary duty to the employees.  I feel like you don't understand this at all.\n\nOnly 3-5% of 401ks even allow self directed.\n\nEvery other 401k is you choose a plan run by the **plan administrator**.  And like I said these plans are low risk plans offering steady, slow growth over time.\n\nYou literally don't understand this.  It's not like someone with a typical offered 401k plan is suddenly going to go broke because it's all-in on crypto."
    ],
    [
      "n7hdy1v",
      "2025-08-07T20:29:31",
      "![gif](giphy|SqmkZ5IdwzTP2)"
    ],
    [
      "n7ho5ks",
      "2025-08-07T21:20:47",
      "“Laughs in 2011”"
    ],
    [
      "n7ho7ad",
      "2025-08-07T21:20:47",
      "Its literally less work than sorting through the scams and over priced services...the whole process takes about 15 minutes, 20-30minutes if you go the VPS..."
    ],
    [
      "n7hoev7",
      "2025-08-07T21:20:47",
      "It’s inevitable now. As long as you chose the right project :\n\nTier 1\nBTC ETH LINK COIN \n\nTier 2\nSOL ONDO ENA BNB TRX"
    ],
    [
      "n7hq88v",
      "2025-08-07T21:30:09",
      "Ping for verified users associated with payments: /u/atlos-io\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "n7hq8tw",
      "2025-08-07T21:30:09",
      "All ChatGPT is tell you want other websites are promoting."
    ],
    [
      "n7hqabr",
      "2025-08-07T21:30:22",
      "Please be cautious with links in the the above message. At least one domain was registered as recently as 6 days ago. If you believe one of the links is malicious, please report the message."
    ],
    [
      "n7hqgnm",
      "2025-08-07T21:31:25",
      "Look at the misleading marketing campaign and firesale of coins. That will tell you all you need to know."
    ],
    [
      "n7hx286",
      "2025-08-07T22:06:22",
      "7 bets on red"
    ],
    [
      "n7hx2zm",
      "2025-08-07T22:06:22",
      "Money i guess"
    ],
    [
      "n7hx3ir",
      "2025-08-07T22:06:22",
      "is financial freedom just a myth?"
    ],
    [
      "n7hx49k",
      "2025-08-07T22:06:22",
      " If it's in your 401k you can't withdraw it to retire early."
    ],
    [
      "n7hx68r",
      "2025-08-07T22:06:45",
      "Wait wasn't crypto supposed to stay out of the financial system? Wasn't that the promise?"
    ],
    [
      "n7hxa00",
      "2025-08-07T22:07:14",
      "XRP going mad.\n\nSEC dropped the case."
    ],
    [
      "n7hoev7",
      "2025-08-07T22:58:52",
      "It’s inevitable now. As long as you chose the right project :\n\nTier 1\nBTC ETH LINK COIN \n\nTier 2\nSOL ONDO ENA BNB TRX"
    ],
    [
      "n7hoeyd",
      "2025-08-07T22:58:52",
      "And 10x more work than just doing it on an exchange."
    ],
    [
      "n7il3ul",
      "2025-08-08T00:22:54",
      "I’m so glad this isn’t getting attention."
    ],
    [
      "n7il4dh",
      "2025-08-08T00:22:54",
      "After a week of eating nothing but pineapple and maca root smoothies"
    ],
    [
      "n7il78r",
      "2025-08-08T00:22:54",
      "Wdym no utility until now. You pay in LINK to access oracle nodes. DeFi hello? It’s literally what makes it tick."
    ],
    [
      "n7il81s",
      "2025-08-08T00:23:28",
      "Or just look at the marketcap lmfao dude you are completely dilusional"
    ],
    [
      "n7il9nc",
      "2025-08-08T00:23:28",
      "It's way more deep than it seems a 1st glance ( or 1st smell should i say...)"
    ],
    [
      "n7ilapk",
      "2025-08-08T00:23:28",
      "Dump it"
    ],
    [
      "n7ilch1",
      "2025-08-08T00:23:53",
      "It's easy to be patient when you're making money hand over fist."
    ],
    [
      "n7ixfxm",
      "2025-08-08T01:36:17",
      "Greetings Funny-Youth1106. Your submission contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your submission, so please repost your submission without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "n7j93u9",
      "2025-08-08T02:47:55",
      "Cryptocurrencies beside BTC don't do anything but rug."
    ],
    [
      "n7j95cz",
      "2025-08-08T02:47:55",
      "Hello, \n\nDirect links to images are require an [r/ CryptoCurrency membership](https://www.reddit.com/r/CryptoCurrency/comments/1cyvqam/special_memberships_are_now_live_on_rcc/), as was [voted on](https://snapshot.org/#/cryptomods.eth/proposal/0x6fcc358f650cc7056395c8f16697d535b6b7fbf834e8541954f5e0dc60b8fa59) by this community.\n\nYour content may also be a good fit in one of our other subreddits:\n\n* r/CryptoCurrencyMemes - For memes\n* r/CryptoHelp - For questions, support, and beginner discussion\n* r/CryptoMarkets - For news, exchange, and trading discussion\n* r/CryptoCurrencyMoons - For Moons discussion\n* r/CryptoCurrencyMeta - For meta discussion about r/CryptoCurrency or networked subreddits\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "n7jgani",
      "2025-08-08T03:36:09",
      "I endorse.."
    ],
    [
      "n7jgc9e",
      "2025-08-08T03:36:09",
      "Or sell the news"
    ],
    [
      "n7jmru0",
      "2025-08-08T04:22:26",
      "You dumb?"
    ],
    [
      "n7jzuv8",
      "2025-08-08T06:09:36",
      "time to crab for august."
    ],
    [
      "n7jzx8q",
      "2025-08-08T06:10:33",
      "Repaying your credit with stables is definitely useful for defi natives, because you can get incredible yields on chain (especially now), and you dont have to pay exchange fees etc to offboard."
    ],
    [
      "n7k006w",
      "2025-08-08T06:10:33",
      "Hbar moves slow right? I’m thinking of maybe investing into INJ, NEAR, and possibly AXAX, and then move those profits into HBAR if it doesn’t move?\n\nWhat does HBAR do? Also, what do you think of the ones I mentioned? Thank you!"
    ],
    [
      "n7kcte3",
      "2025-08-08T08:09:09",
      "Happy cake day! Enjoy the ladyboys!"
    ],
    [
      "n7kctsj",
      "2025-08-08T08:09:09",
      "arbitrage trading"
    ],
    [
      "n7kj849",
      "2025-08-08T09:10:02",
      "\\#fomo"
    ],
    [
      "n7kj8qc",
      "2025-08-08T09:11:01",
      "She doesn't have OF if anyone want to know 😂"
    ],
    [
      "n7kp9hd",
      "2025-08-08T10:06:46",
      "Spidermantrainmeme.jpg"
    ],
    [
      "n7kpfkg",
      "2025-08-08T10:07:48",
      "how much BTC is lost? Some $240B maybe? \n\nThat would be \\~3100 metric tons of gold, not that much if you think that current reserves are at 208k tons."
    ],
    [
      "n7kwfnb",
      "2025-08-08T11:05:56",
      "Ethereum leads the market again.\n\nWaiting for the alternative season."
    ],
    [
      "n7kwfw0",
      "2025-08-08T11:05:56",
      "ETH prediction sir!!!"
    ],
    [
      "n7kwj8r",
      "2025-08-08T11:06:38",
      "Hope to see it over $1 soon"
    ],
    [
      "n7l5gbn",
      "2025-08-08T12:10:06",
      "I've got passive income from your mom. But thanks."
    ],
    [
      "n7l5hw0",
      "2025-08-08T12:10:06",
      "You’re a bot. Theres no “couch” to even leave."
    ],
    [
      "n7l5j76",
      "2025-08-08T12:10:06",
      "😂 so true"
    ],
    [
      "n7l5jjs",
      "2025-08-08T12:10:06",
      "tldr; A crypto trader, Techdev, argued that the idea of becoming a billionaire by holding Bitcoin since its early days is unrealistic due to its extreme volatility and brutal corrections over the years. Techdev highlighted the difficulty of maintaining 'diamond hands,' or strong risk tolerance, through Bitcoin's ups and downs. Many in the crypto industry agreed, noting that most early investors either sold too soon, lost access to wallets, or spent their Bitcoin. Holding long-term requires exceptional discipline and conviction.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "n7l5ko9",
      "2025-08-08T12:10:45",
      "Hyperliquid is not decentralized.  Use Gains Network or DXDY."
    ],
    [
      "n7l5lb9",
      "2025-08-08T12:10:45",
      "Chainlink labs has famously refused to pump their own bags for years, only recently have they even started acknowledging the LINK token"
    ],
    [
      "n7lfmux",
      "2025-08-08T13:09:41",
      "Yeah Partymsl made a nice distinction that I agree is worth making."
    ],
    [
      "n7lfnjb",
      "2025-08-08T13:10:11",
      "$200K or we riot.\n\n![gif](giphy|lln1gKSlV6QheyYQuH)"
    ],
    [
      "n7lfp11",
      "2025-08-08T13:10:11",
      "They keep FOMOing"
    ],
    [
      "n7lfqj8",
      "2025-08-08T13:10:11",
      "tldr; Bitcoin's historical four-year price cycle, centered around the halving event, may be breaking due to factors like the introduction of Bitcoin ETFs, changing investor profiles, and supportive regulations. Traditionally, Bitcoin's price would peak post-halving, followed by a significant crash, but recent trends show deviations. Analysts suggest the cycle's predictability is diminishing, with reduced volatility and institutional investments stabilizing the market. Experts believe the era of 70-80% crashes may be over, replaced by milder corrections of 30-50%.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "n7lh4tc",
      "2025-08-08T13:18:15",
      "No"
    ],
    [
      "n7lh5se",
      "2025-08-08T13:18:15",
      "If there are enough of us who think like that, it will be real. If there are more permabulls, then btc will keep growing. This is purely a game of speculation, it depends on nothing but what people think. There will always be enough money to invest into BTC for it to keep growing, it's a question if mister moneybags will feel like it's a good time to buy or not."
    ],
    [
      "n7lh87u",
      "2025-08-08T13:18:34",
      "I call dibs on tokenization of Satoshis wallet!"
    ],
    [
      "n7lh9cy",
      "2025-08-08T13:18:34",
      "Regular people aren’t the primary buyers of BTC, it’s the wealthy, companies, and countries."
    ],
    [
      "n7lha24",
      "2025-08-08T13:18:55",
      "12 minutes until the big weekend burger dump"
    ],
    [
      "n7lqkm5",
      "2025-08-08T14:07:54",
      "I'm more concerned about the driver, I hope he keeps his tokens stored somewhere secure."
    ],
    [
      "n7lqnxu",
      "2025-08-08T14:08:20",
      "Haha, I love how deep you went into this. Sounds powerful, but I might be too lazy to maintain a VPS setup just for DCA."
    ],
    [
      "n7lqozt",
      "2025-08-08T14:08:30",
      "Never thought I see the day ETH hitting 4K"
    ],
    [
      "n7m2xpp",
      "2025-08-08T15:07:51",
      "bitcoin going to 70k"
    ],
    [
      "n7mfahe",
      "2025-08-08T16:05:49",
      "Who is it mooning?"
    ],
    [
      "n7mrx49",
      "2025-08-08T17:05:52",
      "Don’t over expose yourself longing the breakouts with leverage!"
    ],
    [
      "n7ms13o",
      "2025-08-08T17:06:32",
      "Careful overleveraging as you may finish before even starting on those if you know what I mean (;"
    ],
    [
      "n7ms6py",
      "2025-08-08T17:07:12",
      "Thanks. Researching."
    ],
    [
      "n7ms8ps",
      "2025-08-08T17:07:12",
      "How does that make sense? If inflation increases then the dollar devalues so we'd except BTC/USD to increase in value even if value of Bitcoin it's self remains the same."
    ],
    [
      "n7n4ysf",
      "2025-08-08T18:06:47",
      "4k baby, the sweatpants comes off\n\n🚀🚀LFG ETH!!! 🚀ULTRASOUND 🚀🚀"
    ],
    [
      "n7n5112",
      "2025-08-08T18:07:05",
      "So serious question. Since ETH is pumping the last couple of months, is getting a small bag in PEPE a good idea?"
    ],
    [
      "n7n5383",
      "2025-08-08T18:07:31",
      "AERO"
    ],
    [
      "n7n547w",
      "2025-08-08T18:07:31",
      "![gif](giphy|FoH28ucxZFJZu)"
    ],
    [
      "n7n57id",
      "2025-08-08T18:08:08",
      "After many long years I am finally taking profit. Solid half my ETH, hanging onto the rest til 10k minimum"
    ],
    [
      "n7n58lj",
      "2025-08-08T18:08:08",
      "Guess we need the updated pic!"
    ],
    [
      "n7n58sd",
      "2025-08-08T18:08:08",
      "Shorts getting obliterated"
    ],
    [
      "n7nh11y",
      "2025-08-08T19:05:43",
      "Steak when ETH goes up, and Stake when ETH goes down lol, you can't lose!"
    ],
    [
      "n7ntast",
      "2025-08-08T20:06:47",
      "Oh so I did a mistake? I've buying eth since 2022 :/"
    ],
    [
      "n7o57nv",
      "2025-08-08T21:06:15",
      "These banks know they are obsolete and are petrified. 🤭"
    ],
    [
      "n7o59y5",
      "2025-08-08T21:06:44",
      "For supposedly being innovators these fuckers are hella late.\n\nEven gamblers were quicker."
    ],
    [
      "n7o5ad5",
      "2025-08-08T21:06:44",
      "How is the ETH mining going? :D"
    ],
    [
      "n7o5caz",
      "2025-08-08T21:06:44",
      "LINK.\n\nYou are not ready for what's next"
    ],
    [
      "n7oqzzr",
      "2025-08-08T23:06:01",
      "I'm waiting until they fix Ledger compatibility to claim the airdrop, but it's very safe to do. Essentially what you're doing is signing a message that proves you're the owner of the wallet that's based off how much NIGHT you'll be getting. There aren't any transactions to approve or anything like that."
    ],
    [
      "n7or0nk",
      "2025-08-08T23:06:01",
      "someone post this on Buttcoin or are we all banned"
    ],
    [
      "n7or35m",
      "2025-08-08T23:06:47",
      "eth is vitalik on the left since 2021 lmao"
    ],
    [
      "n7or52j",
      "2025-08-08T23:06:47",
      "This is what chatgpt said when i entered your post as prompt:\n\nIf you put money into ARB right now because some random Redditor told you to, assume you could lose 100% of it. If you’re okay with that loss, fine — but that’s gambling, not wealth building"
    ]
  ],
  "SolanaMemeCoins": [
    [
      "n7f64r5",
      "2025-08-07T14:08:59",
      "$snoofi will be huge!"
    ],
    [
      "n7heooi",
      "2025-08-07T20:33:52",
      "Let's send $CORGI and $WFP launching soon"
    ],
    [
      "n7heupg",
      "2025-08-07T20:33:52",
      "Sounds good \nIs your project on telegram??"
    ],
    [
      "n7hfavh",
      "2025-08-07T20:36:17",
      "Let's send $AKON and $WFP launching soon"
    ],
    [
      "n7hq7et",
      "2025-08-07T21:30:09",
      "Livestream was great! Thanks for hosting that!  SfW looks amazing!"
    ],
    [
      "n7jzwyr",
      "2025-08-08T06:09:36",
      "https://preview.redd.it/bov8p5ltlqhf1.jpeg?width=474&format=pjpg&auto=webp&s=71379bc9d407d0655185ea297e6549baa3a02c70\n\n$Coinu 🚀\n\n2BnooCGYmhXguqyxZNuiCo7HNFupr6AXYFRPn3A3bonk"
    ],
    [
      "n7kj5ly",
      "2025-08-08T09:09:30",
      "Start stacking that $hunt"
    ]
  ],
  "memecoins": [
    [
      "n7f6cjg",
      "2025-08-07T14:10:00",
      "team is working infó rn"
    ],
    [
      "n7fuysp",
      "2025-08-07T16:08:31",
      "Your submission is pending review. New accounts need a bit more history first.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memecoins) if you have any questions or concerns.*"
    ],
    [
      "n7hfkp0",
      "2025-08-07T20:37:50",
      "Let's send $DRB and $WFP launching soon"
    ],
    [
      "n7hq6v1",
      "2025-08-07T21:29:53",
      "Your submission is pending review. New accounts need a bit more history first.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memecoins) if you have any questions or concerns.*"
    ],
    [
      "n7il6z0",
      "2025-08-08T00:22:54",
      "Your submission is pending review. New accounts need a bit more history first.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memecoins) if you have any questions or concerns.*"
    ],
    [
      "n7nh4v2",
      "2025-08-08T19:06:14",
      "https://preview.redd.it/ziftou0eguhf1.jpeg?width=1125&format=pjpg&auto=webp&s=461ba7478d5264cd4808a4a06517def35a99d6c1\n\nTired to 9 of 5 ??? @SlothanaCoin greatestcommunity 🦥🔥🚀🦥soon🦥🔥🚀 We stick together, as a familly 🦥 $SLOTH is going to take us to the 🔥🚀 there fis no other way 💎❗️@SlothanaCoin Slothana Holding with the greatest community until x420!🦥🔥🔥🔥🚀🚀🦥💎"
    ],
    [
      "n7or5e0",
      "2025-08-08T23:06:47",
      "Sendu"
    ]
  ],
  "BitcoinMarkets": [
    [
      "n7g4mf6",
      "2025-08-07T16:55:22",
      "Almost"
    ],
    [
      "n7hevhg",
      "2025-08-07T20:36:17",
      "Have we crossed your lines yet?"
    ],
    [
      "n7hqai6",
      "2025-08-07T21:30:31",
      "August has traditionally been excellent in the year after the halving year, which 2025 is, but terrible in other years."
    ],
    [
      "n7j918l",
      "2025-08-08T02:47:55",
      "Hey fwiw you can delete everything after the “?” in this link & most any other. This will cut tracking info off but again most of the time will not break the link."
    ],
    [
      "n7kwfb7",
      "2025-08-08T11:05:56",
      "Probably r/buttcoin 😂"
    ],
    [
      "n7lfpa3",
      "2025-08-08T13:10:11",
      "u/dopeboyrico beat me to it. New Altcoin all time highs in dollars are exciting if you're holding large bags, but it's better to price them in BTC."
    ],
    [
      "n7lh9n0",
      "2025-08-08T13:18:34",
      "Alts are struggling \n\nMost have not even reached their 2021 highs.\n\nIt’s been a disaster for alts this cycle"
    ],
    [
      "n7lqgkr",
      "2025-08-08T14:07:14",
      "Tom Lee has officially orange-pilled me (blue-pilled me?) on ETH.  \ni sold off my long-held ETH back in April and will be jumping back in.  I think it's about to run (along with BTC).  The \"digitizing the stock market\" is too big of a thing, even if it ends up vaporware.  It's a good story.\n\nI missed the boat on alts, I missed the boat on MSTR.  BMNR is Tom Lee's ETH treasury company and, if we're about to have any sort of mania or leg-up, I expect the story/hype/euphoria to find its way there pronto.  The dude has been shilling BTC and ETH daily on the bloomberg channels and, frankly, he's great at it.  Having made the correct bullish calls these past 6 months doesn't hurt either.\n\nI'm a story guy.  This is a good story.  It will resonate with \"the people\", so I'm in.\n\nGoing forward, I believe there will be exactly two winners in this space; BTC and ETH.  BTC because trustless, scarce digital gold.  We all know why.  ETH because it's the backbone for all the defi, stablecoins, fancy schmancy stuff that's yet to come.  All others go to zero IMO.\n\nI have never been able to reconcile the enormous supply of ETH and why it should have value; it's much more straightforward with BTC.  Nevertheless, I'm going to stop overthinking it and accept that I simply think it's going up from here."
    ],
    [
      "n7lqp85",
      "2025-08-08T14:08:30",
      "> What changed your mind?\n\nStudying the history of money and the crimes of centrally issued shitpaper (FIAT)"
    ],
    [
      "n7ora6y",
      "2025-08-08T23:07:47",
      "The fact this has the upvotes it has tells you everything you need to know about *\"This time it's different\"* narratives."
    ]
  ],
  "Pepecryptocurrency": [
    [
      "n7g4sck",
      "2025-08-07T16:56:08",
      "Go ahead predict the future 🧙‍♂️🔮🪬"
    ],
    [
      "n7hhdq7",
      "2025-08-07T20:55:58",
      "2x6+6-8(u)jdx878$x3# = pamp it"
    ],
    [
      "n7ilcmv",
      "2025-08-08T00:23:53",
      "Good for you,,,,"
    ],
    [
      "n7ixb06",
      "2025-08-08T01:34:55",
      "Good try fed boy"
    ],
    [
      "n7ixc2q",
      "2025-08-08T01:35:26",
      "Im still holding"
    ],
    [
      "n7ixikl",
      "2025-08-08T01:36:17",
      "This is also my approach! Although I have dumped some money into it here and there. At the price it is now $1 a day will go a long way."
    ],
    [
      "n7l5nfj",
      "2025-08-08T12:10:45",
      "Lol\n\nI love it when dumbasses think they need to announce their departure like anybody gives a shit."
    ],
    [
      "n7o55kz",
      "2025-08-08T21:06:15",
      "Damn well good luck cause we are pumping. Train may have left"
    ]
  ],
  "ethtrader": [
    [
      "n7g4vgh",
      "2025-08-07T16:56:48",
      "20040"
    ],
    [
      "n7hf1f7",
      "2025-08-07T20:36:17",
      "Something special is taking shape and more yet to come.\n\n^(!tip 1)"
    ],
    [
      "n7hf30d",
      "2025-08-07T20:36:17",
      "u/Odd-Radio-8500 has tipped u/Creative_Ad7831 1.0 donut (weight: 1.0)\n\n[LINK](https://reddit.com/comments/1mk2qby/_/n7hf1f7)\n\n[ARCHIVE](https://raw.githubusercontent.com/ethtrader/ethtrader-tip-archive/main/2025/08/07/t1_n7hf1f7.txt)\n\n^(note: archived content can take up to 10 minutes before it is available for viewing)\n\n^(donut-bot v0.1.20240111-tip | Learn more about [Earn2Tip](https://www.reddit.com/r/ethtrader/comments/17q24e7/introducing_donutbot_register_and_tip_commands/))"
    ],
    [
      "n7hq5z9",
      "2025-08-07T21:29:53",
      "Institutional investors hold the future of ETH and they are jumping onboard. It’s just a matter of time. We all just need to be patient."
    ],
    [
      "n7hqene",
      "2025-08-07T21:31:25",
      "ETH ETH all the way brothers"
    ],
    [
      "n7hqhie",
      "2025-08-07T21:31:25",
      "Getting to the moon"
    ],
    [
      "n7j94n8",
      "2025-08-08T02:47:55",
      "This is actually huge, I can’t find what the disadvantage is"
    ],
    [
      "n7jtavy",
      "2025-08-08T05:13:03",
      "Your post was removed from r/ethtrader because it's too short (minimum of 200 words). You can still see it, but nobody else can. Feel free to resubmit your post with more text in the body to help direct the discussion. Thanks!"
    ],
    [
      "n7jzy1f",
      "2025-08-08T06:10:33",
      "It’s not living in the past. It’s really, really basic risk assessment analysis. You’re in a bubble here, that’s fine, you do you. It’s still a bad idea."
    ],
    [
      "n7k6miy",
      "2025-08-08T07:10:23",
      "u/Mixdealyn has tipped u/Wonderful_Bad6531 1.0 donut (weight: 1.0)\n\n[LINK](https://reddit.com/comments/1mkg8aq/_/n7k6lzs)\n\n[ARCHIVE](https://raw.githubusercontent.com/ethtrader/ethtrader-tip-archive/main/2025/08/08/t1_n7k6lzs.txt)\n\n^(note: archived content can take up to 10 minutes before it is available for viewing)\n\n^(donut-bot v0.1.20240111-tip | Learn more about [Earn2Tip](https://www.reddit.com/r/ethtrader/comments/17q24e7/introducing_donutbot_register_and_tip_commands/))"
    ],
    [
      "n7k6o42",
      "2025-08-08T07:10:23",
      "tldr; The Ethereum Foundation has pledged to match up to $500,000 in donations for Roman Storm's legal defense following his conviction for operating an unlicensed money transmitter. Storm, co-founder of Tornado Cash, faces up to 5 years in prison and potentially more if retried on other charges. The case raises concerns about criminalizing code development and privacy tools. Tornado Cash was sanctioned by the U.S. Treasury for alleged money laundering, including use by North Korea's Lazarus Group hackers. Legal experts warn of troubling precedents for developers worldwide.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR."
    ],
    [
      "n7kj8hg",
      "2025-08-08T09:11:01",
      "thank you :)"
    ],
    [
      "n7kwg6p",
      "2025-08-08T11:05:56",
      "u/YankeeDoodlePeguin has tipped u/SigiNwanne 1.0 donut (weight: 0.2561)\n\n[LINK](https://reddit.com/comments/1mko9uv/_/n7kwes9)\n\n[ARCHIVE](https://raw.githubusercontent.com/ethtrader/ethtrader-tip-archive/main/2025/08/08/t1_n7kwes9.txt)\n\n^(note: archived content can take up to 10 minutes before it is available for viewing)\n\n^(donut-bot v0.1.20240111-tip | Learn more about [Earn2Tip](https://www.reddit.com/r/ethtrader/comments/17q24e7/introducing_donutbot_register_and_tip_commands/))"
    ],
    [
      "n7kwic3",
      "2025-08-08T11:06:38",
      "This is the way, paperhands get punished"
    ],
    [
      "n7nh4is",
      "2025-08-08T19:06:14",
      "If it pass the resistance of 4078 with one candle above it will fly to the moon 😁"
    ]
  ],
  "sui": [
    [
      "n7heb6j",
      "2025-08-07T20:33:52",
      "Getting hacked doesn't negate centralisation. And yes, Sui is more centralised because it has less validators due to the requirements. Like Eth, this can change over time, so Im not too concerned for now. Being a more centralised blockchain actually helps with rolling out updates really fast."
    ],
    [
      "n7hfo20",
      "2025-08-07T20:37:50",
      "I'm here to make money like most people. Don't care about utility."
    ],
    [
      "n7kwjnz",
      "2025-08-08T11:06:38",
      "Gaming is not going to do much if it doesn’t increase users. Unless you can make money and get people playing like Axie, then PS5, Xbox and phone have nothing to worry about.   \n\nWe did gaming last cycle. Lost money on this. Three years and still waiting.  [https://www.wilderworld.com/](https://www.wilderworld.com/)"
    ],
    [
      "n7mfcfi",
      "2025-08-08T16:05:49",
      "Interesting you feel an $8 ceiling"
    ]
  ],
  "XRP": [
    [
      "n7hedem",
      "2025-08-07T20:33:52",
      "There is only 1 guarantee in crypto and thats the investment will either go up, down or sideways!"
    ],
    [
      "n7hfcmv",
      "2025-08-07T20:36:17",
      "Not taking advice from someone who literally asked for price predictions about the same thing. Sorry if you don’t feel the same way I do. XRP WILL HIT $10 EVENTUALLY!!!"
    ],
    [
      "n7hfe3c",
      "2025-08-07T20:37:50",
      "Why post these. It just gets my hopes up that there’s big movement but then you mention the same stuff as other posts just like it."
    ],
    [
      "n7hx1d7",
      "2025-08-07T22:06:22",
      "Looks legit"
    ],
    [
      "n7hx4sz",
      "2025-08-07T22:06:45",
      "Traders already trading... "
    ],
    [
      "n7hx5k4",
      "2025-08-07T22:06:45",
      "See you guys next week when it dips to $2.96 and it’ll be all over"
    ],
    [
      "n7hx6rb",
      "2025-08-07T22:06:45",
      "Relax bro buy more"
    ],
    [
      "n7hx76t",
      "2025-08-07T22:07:14",
      "Why do you say that? I’m a 26 year old Man"
    ],
    [
      "n7i7v8d",
      "2025-08-07T23:06:44",
      "Nothing wrong with that. Everyone should do whatever works for them. However, none of that justified being overly negative and state it as fact based on nothing. I mean…it wasn’t long ago that it was trading between .30 and .50. Still, people cry and are negative. It’s crazy."
    ],
    [
      "n7i7xo3",
      "2025-08-07T23:06:44",
      "Welcome we’ve been waiting for you people like you . it is time and congratulations to getting in"
    ],
    [
      "n7ild65",
      "2025-08-08T00:23:53",
      "Pretty sure judge Torres still needs to sign off on it but I could be wrong. Either way we still need the clarity act to pass as well. If that and the anti cbdc can get signed too… that’d be a real beut!"
    ],
    [
      "n7ix8p5",
      "2025-08-08T01:34:55",
      "All of you selling right now will be the same people buying back in when we hit $10. How hard is it to just buy and hold?"
    ],
    [
      "n7ixa5q",
      "2025-08-08T01:34:55",
      "choosingbeggar"
    ],
    [
      "n7ixb51",
      "2025-08-08T01:35:26",
      "Have you tried getting a job?\nI think you might get some money that way"
    ],
    [
      "n7ixcnj",
      "2025-08-08T01:35:26",
      "TEMPORARY top"
    ],
    [
      "n7ixdzu",
      "2025-08-08T01:35:26",
      "24 hours ago?"
    ],
    [
      "n7ixg47",
      "2025-08-08T01:36:17",
      "I’m adjusting my 401K as soon as possible."
    ],
    [
      "n7ixj1u",
      "2025-08-08T01:36:17",
      "Breaking threw these resistance walls easily. Shorts are going to liquidate soon knowing institutions and individuals are not going to stop buying.\nFYI: spot eft on deck \n       Banking application approval on deck \n       National crypto reserve on deck."
    ],
    [
      "n7jg80d",
      "2025-08-08T03:36:09",
      "With XRP there’s always promise of the NEXT catalyst!"
    ],
    [
      "n7jmso2",
      "2025-08-08T04:22:26",
      "oh so youre the reason 500m worth of xrp was just sold? 😡"
    ],
    [
      "n7jt868",
      "2025-08-08T05:13:03",
      "When my Lambo shuttle land on moon with Lambo doors"
    ],
    [
      "n7jtb1c",
      "2025-08-08T05:13:38",
      "Lambo planetary system"
    ],
    [
      "n7jtdip",
      "2025-08-08T05:13:38",
      "I’m going to moon every body"
    ],
    [
      "n7k6ozj",
      "2025-08-08T07:10:23",
      "You most be fun at parties"
    ],
    [
      "n7kcw03",
      "2025-08-08T08:09:09",
      "Get ready for the 'should I buy XRP' posts.. mfs are nowhere to find when theres a discount but when it goes up they are everywhere loll"
    ],
    [
      "n7kj62m",
      "2025-08-08T09:09:30",
      "he didn’t say he sold. he probably bought in high around january"
    ],
    [
      "n7kjats",
      "2025-08-08T09:11:01",
      "5.5 inches"
    ],
    [
      "n7kjbsh",
      "2025-08-08T09:11:01",
      "Keep your negativity in the real world bro"
    ],
    [
      "n7lh9wg",
      "2025-08-08T13:18:55",
      "Get the 3 card on amazon dont do the ring shit with tangem. Make all 3 cards backups for the same wallet snd use the 24 word seed phrase"
    ],
    [
      "n7lqf2j",
      "2025-08-08T14:07:14",
      "That's actually pretty need! This is a good stream for those that have to check every 5 minutes 😂"
    ],
    [
      "n7mfbwx",
      "2025-08-08T16:05:49",
      "Couldn’t agree more lol"
    ],
    [
      "n7mrvdy",
      "2025-08-08T17:05:52",
      "Tonight I’m going out to Burger King.. \n\nTo buy the place. \n\nFree XRP burgers for life."
    ],
    [
      "n7mryfx",
      "2025-08-08T17:05:52",
      "This is a bot sub isnt it...."
    ],
    [
      "n7ms0k3",
      "2025-08-08T17:06:32",
      "Don’t forget about taxes"
    ],
    [
      "n7ms265",
      "2025-08-08T17:06:32",
      "Hey, I'm as excited as the next XRP Army member, but we need to keep in mind that the old-school thinking banks are banding together to STOP Ripple from gaining a banking licence and Federal Reserve master acct. If Ripple suceeds, which I hope they do, traditional banks will lose billions if dollars in revenue if they don't embrace the new tech and work WITH Ripple.\n\nWith the SEC case being over for good, I'm hoping it's not too late for XRP to explode over the coming years and as ETF's gain approval and adoption.  I'm hoping the damage done to XRP from that lame SEC case has not allowed others to build other sysyems to compete."
    ],
    [
      "n7ms3lp",
      "2025-08-08T17:06:32",
      "bare with me now, what exactly is a cold wallet?😭"
    ],
    [
      "n7ms49s",
      "2025-08-08T17:07:12",
      "How many times is the case gone be over?"
    ],
    [
      "n7n55q6",
      "2025-08-08T18:07:47",
      "But you have less than 5k. Unless you are planning on selling some…"
    ],
    [
      "n7nh3p0",
      "2025-08-08T19:06:14",
      "Self custody. Passwords in fireproof safe. Problem solved"
    ],
    [
      "n7nh4x4",
      "2025-08-08T19:06:34",
      "Oh that’s easy I want to reach a total of…."
    ],
    [
      "n7o5cvx",
      "2025-08-08T21:06:44",
      "I have no idea who you are but I hate your karma-seeking post and everything that comes with it. This has been asked literally thousands of times. You are in an XRP subreddit, of course people will tell you to do so."
    ],
    [
      "n7ogeur",
      "2025-08-08T22:05:55",
      "Hodl"
    ],
    [
      "n7ogg83",
      "2025-08-08T22:06:39",
      "Yea it will drop because Larsen or another one of the big holders will unload a sliver of the stash again"
    ],
    [
      "n7ogiby",
      "2025-08-08T22:06:39",
      "It’s ongoing"
    ],
    [
      "n7or5r5",
      "2025-08-08T23:07:23",
      "That’s what they said that last bull run. All it takes is for one of the big holders to unload a sliver of their stash and down it goes"
    ]
  ],
  "CryptoMarkets": [
    [
      "n7hesmk",
      "2025-08-07T20:33:52",
      "Both. That being said I am like 9:1 weighted eth"
    ],
    [
      "n7hfeg1",
      "2025-08-07T20:37:50",
      "Haha crypto price is about what could be , not what is"
    ],
    [
      "n7hfiue",
      "2025-08-07T20:37:50",
      "Totally fair. That’s why I said DYOR.  I’m just sharing what I found interesting. 😊"
    ],
    [
      "n7hoe8r",
      "2025-08-07T21:20:47",
      "Always does"
    ],
    [
      "n7hqbcl",
      "2025-08-07T21:30:31",
      "Stay Informed: Navigate the Evolving World of Crypto Taxation\n\nAs the world of cryptocurrency continues to evolve, so do the tax laws and regulations that govern it. Whether you’re a casual investor, a seasoned trader, or part of a blockchain project, it’s essential to understand how your crypto activities are taxed.\n\nTax authorities around the globe are implementing stricter rules and increasing oversight on digital assets. Ignoring these developments can lead to unexpected liabilities, penalties, or missed opportunities for optimization.\n\nTo stay ahead, stay compliant, and stay informed — visit https://koinly.ws/.\nKoinly provides up-to-date information on the latest crypto tax regulations across different jurisdictions, along with tools to simplify reporting and help you meet all your obligations with confidence.\n\nDon’t let tax season catch you off guard.\nExplore the latest rules today and protect your portfolio with knowledge.\n\n\n🔰 For Beginners: Understanding the Basics of Crypto Tax\n\nJust getting started with crypto? Make sure taxes don’t catch you off guard.\n\nBuying your first Bitcoin or dabbling in altcoins is exciting — but even beginners need to be aware that crypto transactions often come with tax implications.\nMany people don’t realize that even swapping tokens, earning from airdrops, or using DeFi platforms can trigger a taxable event.\n\nWhy does it matter?\nTax authorities in many countries now require crypto holders to report their earnings. Failing to do so — even by accident — can lead to fines or audits.\n\nTo help you stay compliant from the start, check out https://koinly.ws/.\nKoinly breaks down complex tax rules into beginner-friendly guides and even tracks your transactions automatically so you don’t have to stress come tax season.\n\nLearn early. Stay safe. Save time.\n\n\n📈 For Active Traders: Stay Compliant, Stay Ahead\n\nTrading crypto? Then you’re already in the tax spotlight.\n\nWhether you’re executing daily trades, arbitraging across exchanges, or flipping NFTs, every transaction you make could have tax consequences.\nCapital gains, losses, income — it’s all reportable, and regulations are getting tighter every year.\n\nWhat’s the risk?\nMore governments are working with exchanges and blockchain analytics to monitor trading activity. If you’re not reporting your trades correctly, you’re exposing yourself to audits or penalties.\n\nWith Koinly, you can:\n✔ Sync wallets and exchanges automatically\n✔ Calculate gains/losses with precision\n✔ Access country-specific tax reports\n\nMaximize your profits. Minimize your risk. Stay compliant.\nVisit https://koinly.ws/ and take control of your crypto tax reporting.\n\n\n📣 For Influencers & Creators: Know the Tax Side of Your Crypto Content\n\nCreating crypto content? Getting paid in tokens or NFTs? That’s taxable.\n\nIf you’re a crypto influencer, YouTuber, or content creator being paid in digital assets, you’re likely earning income that must be reported for tax purposes.\n\nFrom sponsorships paid in crypto, affiliate earnings, airdrops, giveaways, or even your own token/NFT launches — the tax implications are real and increasingly enforced.\n\nWhy it matters:\nInfluencers are becoming a focus for tax authorities due to the growing visibility and revenue potential of content-based crypto activity. Misreporting income (even unknowingly) could harm your credibility — or worse, your finances.\n\nKoinly offers influencer-friendly tools to:\n✔ Track and categorize income from multiple sources\n✔ Understand how your earnings are taxed in your country\n✔ Generate clean, accurate reports for your accountant\n\nProtect your brand and your bottom line.\nVisit https://koinly.ws/ today and make sure your content empire is built on a compliant foundation."
    ],
    [
      "n7hqcdx",
      "2025-08-07T21:30:55",
      "Please be cautious with links in the the above message. At least one domain was registered as recently as 6 days ago. If you believe one of the links is malicious, please report the message."
    ],
    [
      "n7hx6mh",
      "2025-08-07T22:06:45",
      "I believe it’s coming. Once those rates get cut. It will still take about 4-6weeks (after rate cuts) to have an effect on the crypto market. For this reason I think the start of alt season is delayed and we may even have an extended alt season that goes for a bit longer than usual…"
    ],
    [
      "n7jzu90",
      "2025-08-08T06:09:36",
      "Masses think altseason won’t happen so it will happen, probably between september-november, given the economy/world doesn’t crash before that."
    ],
    [
      "n7kcudl",
      "2025-08-08T08:09:09",
      "Mk pussychain"
    ],
    [
      "n7kcufu",
      "2025-08-08T08:09:09",
      "ETHFI MOVR PHB INJ SAGA SKL RSR TRU"
    ],
    [
      "n7kj55s",
      "2025-08-08T09:09:30",
      "Just dca in sol and eth, the rung is going to be huge"
    ],
    [
      "n7l5mf9",
      "2025-08-08T12:10:45",
      "Hbar and its tokens are this cycle’s Sol"
    ],
    [
      "n7lfngo",
      "2025-08-08T13:10:11",
      "Because Jig is up, people can make a distinction between a useful asset and a useless shit coin now."
    ],
    [
      "n7lqjtu",
      "2025-08-08T14:07:54",
      "Solana is the fastest and cheapest network in crypto and earns $2 million a day in fees. It’s the only legitimate competitor to Ethereum."
    ],
    [
      "n7mrv6j",
      "2025-08-08T17:05:52",
      "No. We're just getting started. We still haven't broken all time highs.\n\nUnless you're a swing trader then you shouldn't be buying unless you're ready to commit to holding for a year or more."
    ],
    [
      "n7mryht",
      "2025-08-08T17:05:52",
      "Crypto your willing to lose"
    ],
    [
      "n7ms32q",
      "2025-08-08T17:06:32",
      "I'm still buying as much ETH as I can without going broke and while still paying my bills. This is not financial advice and I'm not a financial advisor."
    ],
    [
      "n7n4xwa",
      "2025-08-08T18:06:47",
      "Oh HELL yea it is!!!!"
    ],
    [
      "n7n4y04",
      "2025-08-08T18:06:47",
      "Dogecoin, anyone saying anything else are lying to hype their own favorite, there is only dogecoin nothing else!1!!1!!"
    ],
    [
      "n7n564f",
      "2025-08-08T18:07:47",
      "FART COIN"
    ],
    [
      "n7n5876",
      "2025-08-08T18:08:08",
      "Obviously its BTC but that’s not really what anyone wants to hear. They may see a 2x in 3 years if everything goes right. Not really worth it unless you have alot of money to spend and want to sideline it for a while.\n\nDuring a crypto bull run its best to maximize profits in alts that run like ETH/SOL and their onchain memes, cash at at peak euphoria and buy BTC at the bottom"
    ],
    [
      "n7nt8cv",
      "2025-08-08T20:06:47",
      "You got a point, to which I counter with a question. Do you know why Gold was the best money for thousands of years ? we are used to the government papers nowadays, but not long ago we used metals as money. And gold was the most valuable of all, yet you can eat it, drink it, it just sits there. And I will use you own words:\n\n\"Sure Gold has more liquidity name/brand recognition, but it's not for what it does. It does nothing. It's just people believe. That's all. It's air.\""
    ],
    [
      "n7nt8c0",
      "2025-08-08T20:06:47",
      "I lost all my capital due to online scammers, until a friend of mine introduced expert Mr Bernie Austin to me he really helped me to recover everything for me and made extra profits for me in my trading account I'm glad 😊 now, a representative on whatsApp: +1 (626) 862-8153 you can check it out yourself to get started on recovering what's rightfully yours..."
    ],
    [
      "n7or1ke",
      "2025-08-08T23:06:01",
      "Do all the people know they will most likely end up owning worthless coins?\n\nPumpfuns is a speed game not \"holding\" like altcoins. Pure gamble."
    ],
    [
      "n7or4f0",
      "2025-08-08T23:06:47",
      "What were the tools?"
    ],
    [
      "n7or9nk",
      "2025-08-08T23:07:47",
      "ETH XRP XLM !!!!!!"
    ],
    [
      "n7orajv",
      "2025-08-08T23:07:47",
      "Okay I'm in. How do I make money?"
    ],
    [
      "n7orbrl",
      "2025-08-08T23:07:47",
      "Pdai on pulse for a 159x. Swap in thru liberty swap. Check out Khalid on Crypto or crypto coffee YouTube channels for more information on the one in a lifetime opportunity pulsechain is right now. Thank me later."
    ]
  ],
  "cardano": [
    [
      "n7hg7sm",
      "2025-08-07T20:55:58",
      "For one, it appears it’s actually available?"
    ],
    [
      "n7hhhdm",
      "2025-08-07T20:55:58",
      "Bro 10 am pst on a friday, people have work"
    ],
    [
      "n7hjgyy",
      "2025-08-07T20:55:58",
      "Awesome news! Great that it's available in Europe."
    ],
    [
      "n7hqaom",
      "2025-08-07T21:30:31",
      "I'm really sorry about replying to this so late. There's a [detailed post about why I did here](https://www.reddit.com/r/RemindMeBot/comments/13jostq/remindmebot_is_now_replying_to_comments_again/).\n\nI will be messaging you in 1 day on [**2025-08-08 20:00:30 UTC**](http://www.wolframalpha.com/input/?i=2025-08-08%2020:00:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/cardano/comments/1mk2u1z/axo_protocol_vested_ada_return_to_participants/n7h7wrl/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fcardano%2Fcomments%2F1mk2u1z%2Faxo_protocol_vested_ada_return_to_participants%2Fn7h7wrl%2F%5D%0A%0ARemindMe%21%202025-08-08%2020%3A00%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201mk2u1z)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
    ],
    [
      "n7kj7il",
      "2025-08-08T09:10:02",
      "its quite possible that you cant sign from trust wallet and will have to transfer your cardano to one of the few wallets supported."
    ],
    [
      "n7mfckn",
      "2025-08-08T16:05:49",
      "Governance is different from staking. If you're interested in reading the full story, head [here](https://cardano.org/governance/).\n\nOtherwise just go into your Yoroi wallet and click on the Governance tab on the left. Since Voltaire we have decentralized governance on Cardano, and you are required to make a choice in order to withdraw rewards. This is mandatory.\n\n* You can choose to Abstain, meaning you won't partake in governance.\n* You can choose a DRep, someone who will represent you in upcoming governance decisions - this will require you to look into some of the DRep options to make an informed decision.\n* You can choose to become your own DRep. This option is not really recommended, since you pay a pretty hefty sum for that, and you would be expected to get involved in the voting process.\n\n?governance"
    ],
    [
      "n7mfcm1",
      "2025-08-08T16:05:49",
      "# Cardano Governance: Community Decision-Making\n\nCardano aims for decentralised governance, allowing the community (ADA holders) to shape the future of the network through **On-Chain Governance (Voltaire)** and manage ecosystem funding via **Project Catalyst**.\n\nLearn how governance works and how you can participate in our detailed wiki guide:\n*   **Start Here:** [**VI. Cardano Governance: Shaping the Future**](https://www.reddit.com/r/cardano/wiki/index/governance) (Main Index)\n\nThe guide covers key topics:\n*   [**A. Introduction to Decentralised Governance**](https://www.reddit.com/r/cardano/wiki/index/governance/introduction): Why community control matters.\n*   [**B. Project Catalyst: Cardano's Innovation Engine**](https://www.reddit.com/r/cardano/wiki/index/governance/project-catalyst): How ecosystem projects get funded and how to participate (voting, proposing, reviewing).\n*   [**C. On-Chain Governance: The Voltaire Framework**](https://www.reddit.com/r/cardano/wiki/index/governance/on-chain-governance): How protocol rules and Cardano core development is decided, DReps, SPOs, CC, and how to delegate/vote.\n*   [**D. The Cardano Constitution**](https://www.reddit.com/r/cardano/wiki/index/governance/constitution): The foundational document for Cardano's governance.\n\nYour participation helps ensure Cardano remains a truly community-driven platform!\n\n*Use `?help` to see all available commands.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cardano) if you have any questions or concerns.*"
    ],
    [
      "n7ms8b2",
      "2025-08-08T17:07:12",
      "What you're saying really interests me, but I sadly don't get it. Could you please give me an example?\n\nIf I have a dapp on Eth and want to use Midnight network for privacy, then when exactly does ada come into play through babel fees? I thought only $night was relevant for this purpose, since SPOs also get night as rewards"
    ],
    [
      "n7n4x26",
      "2025-08-08T18:06:47",
      "Cardano and Midnight tech is next level in cryptoverse. Carypto is doing great!"
    ]
  ],
  "Chainlink": [
    [
      "n7hjddu",
      "2025-08-07T20:55:58",
      "Current reserve amount = 3 LINK. But the transactions also show 65K LINK coming in. Where are the missing LINKs? http://reserve.chain.link"
    ],
    [
      "n7lqfa6",
      "2025-08-08T14:07:14",
      "You're almost there, just use the last 2 of your brain cells and it'll hopefully all come together! Hint: chainlink has a ton of employees and a strong executive team that oversees the budget and capex strategy"
    ]
  ]
}