{
  "Bitcoin": [
    [
      "n73vdd6",
      "2025-08-05T19:57:37",
      "It’ll go up, but you can always go up faster with well timed trades."
    ],
    [
      "n73veox",
      "2025-08-05T19:57:37",
      "It's simple, but not easy."
    ],
    [
      "n73vfjw",
      "2025-08-05T19:57:37",
      "How many current holders of Bitcoin you think really understand what they have?\n\nSame question, but 10 years ago?\n\nNumber go up tourists will always outnumber those who have deep understanding. Those who understand the potential of a successfully bootstrapped monetary network for a digital bearer asset also understand the tourists, and how they'll always be back next season."
    ],
    [
      "n73vqc6",
      "2025-08-05T19:57:37",
      "putting malware on a hard drive and selling it at a garage sale"
    ],
    [
      "n73vrj7",
      "2025-08-05T19:58:29",
      "Honnest awnser. I was too lazy to sell. And by the time it dropped 60 percent, i was like wtv might as well just ride to 0."
    ],
    [
      "n73vusg",
      "2025-08-05T19:58:29",
      "Why does it need to be apocalyptic?  It would be more like 2008 with a different asset classes.  Instead mainstream holding massive mortgage debt with a crashed asset, you might get ETF holders backed by no BTC while ETF issuers who get hypothetically bailed out from the excursions they made with your ETF money."
    ],
    [
      "n73vvtw",
      "2025-08-05T19:58:29",
      "Ok that is what I was expecting and why I have not done anything about this.  Thought it was worth the question.   Thanks"
    ],
    [
      "n73vyis",
      "2025-08-05T20:00:58",
      "circa, not via"
    ],
    [
      "n73w16j",
      "2025-08-05T20:00:58",
      "No. I got the card as a gift. My hydro was included in the rent that my welfare was paying. Justify it however you want but labor is not needed as much in the future, think bigger. I've been creating industrial automation for 15 plus years, labor is not as valuable as you may think. Engineering and automation can greatly reduce or even eliminate labor in most cases. The skilled labor that goes into it is not as intensive and not fulfilling to all people's purpose, so we must think bigger. \nSome of us will labor even though we don't need to cause we want to but not laboring and being consistent and dedicated can be just as prosperous in life and with that we should rejoice. The shackles are removed and we are truly free. Have zero fear and go out and live your best life cause that's all that matters. Do what you love, cause nothing else matters."
    ],
    [
      "n73wc3m",
      "2025-08-05T20:00:58",
      "Take your seed phrase to your grave as an offering to the community."
    ],
    [
      "n73wccg",
      "2025-08-05T20:02:01",
      "Why wouldn’t it be taxable?  If want to spend $1,000 from one of my investments, I’d have to sell the stocks/gold/etc and convert it USD.  I’d get taxed for that depending on my cost basis. Paying *directly* with the asset just skips a step (liquidation), but I still reap the same benefits of a gain on my investment. I don’t understand why anyone would expect it to be non-taxable."
    ],
    [
      "n73wfzb",
      "2025-08-05T20:02:01",
      "He's most likely referring to IRA and Roth IRA accounts which give you tax advantages."
    ],
    [
      "n73wk0w",
      "2025-08-05T20:02:54",
      "Probably referring to investing via retirement accounts"
    ],
    [
      "n73wkdo",
      "2025-08-05T20:02:54",
      "Tbh no it almost certainly won’t increase as much as it did in the past. But that’s not why I started buying bitcoin. I did it because I believe it will keep outperforming the market in the long run. So as long as I am seeing 13% YoY returns or better I will keep buying. Although I am expecting much higher but only time will tell."
    ],
    [
      "n73worp",
      "2025-08-05T20:02:54",
      "2030-2035 for a million is my guess"
    ],
    [
      "n73wrs7",
      "2025-08-05T20:03:26",
      "\"considers\"\n\n  \nWeak clickbait language. Do or do not."
    ],
    [
      "n73ws3l",
      "2025-08-05T20:03:26",
      "You are a wholer. Won’t be many of us in the future"
    ],
    [
      "n73ws7x",
      "2025-08-05T20:03:26",
      "Fuck all, in red and green."
    ],
    [
      "n74croa",
      "2025-08-05T21:28:56",
      "He posted a chart so it must be true."
    ],
    [
      "n74ctgj",
      "2025-08-05T21:28:56",
      "https://youtu.be/Pef22g53zsg"
    ],
    [
      "n74ctyu",
      "2025-08-05T21:28:56",
      "Who hurt you bro?"
    ],
    [
      "n74cv19",
      "2025-08-05T21:28:56",
      "Watch this^"
    ],
    [
      "n74u415",
      "2025-08-05T23:03:47",
      "Such wow"
    ],
    [
      "n74u4xj",
      "2025-08-05T23:03:47",
      "Nvm I have forgotten robinhood is non custodial"
    ],
    [
      "n74u4yn",
      "2025-08-05T23:03:47",
      "The more wealth you have, the more you stand to lose in Bitcoin terms if you don't hold Bitcoin."
    ],
    [
      "n74u5ri",
      "2025-08-05T23:03:47",
      "I have the current Bitcoin value on the face of my phone. Always gotta know, all day, sometimes at night. Check value of house every couple weeks or so."
    ],
    [
      "n750l48",
      "2025-08-05T23:39:25",
      "Thank you, that is exactly what i do, creative industries required creativity which oftens drive the artist to burn out, easier said than done just to get \"more clients\" and such haha. But here i'm consistently updating my portofolio and keep working on personal project until i got another clients, some times when there's company, one deal could easily worth $5K-$10K. But yeah, life."
    ],
    [
      "n75875t",
      "2025-08-06T00:22:47",
      "Yeah, well, whatever they are choosing to do seems to work out for them. \n\nIf you’re shocked and appalled, maybe you should try to listen to them.  Gain some comprehension.  Don’t just look at one thing.\n\nHell, if they put it in PALANTIR it would be even more by double.\n\nNo one knows. \n\nAnd when you have that much money to swing around… you kinda artificially screw up the market on what you’re buying."
    ],
    [
      "n758bfj",
      "2025-08-06T00:22:47",
      "Well put."
    ],
    [
      "n758c19",
      "2025-08-06T00:22:47",
      "ETF = selling covered calls strategically to juice my returns even more. Plus I'm dumb and would absolutely screw up holding my own BTC."
    ],
    [
      "n75kxzi",
      "2025-08-06T01:35:49",
      "Now we know how they build houses in 6 hours"
    ],
    [
      "n75l34y",
      "2025-08-06T01:36:39",
      "well now 120k will never cross ur mind lmfao"
    ],
    [
      "n75l7kx",
      "2025-08-06T01:36:39",
      "Fiat bros be like “but if I can’t buy pizzas with it then it’s useless”"
    ],
    [
      "n75l7lf",
      "2025-08-06T01:36:39",
      "It is also good to remember the price multiplier done by Bitcoin."
    ],
    [
      "n75l7w6",
      "2025-08-06T01:36:39",
      "no"
    ],
    [
      "n764vuk",
      "2025-08-06T03:36:10",
      "Pretend to be Italian, \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDo you know yet????\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFORGETTA BOUT IETTTTT"
    ],
    [
      "n76bkvt",
      "2025-08-06T04:23:36",
      "People would sell it take profits when it hits 1 dollars not a lot would hold til 10k or 100k but for real I wish I could get some because I saw some random IT channel in my country talk about how bitcoin would replace card payment and such in 2009😂😂"
    ],
    [
      "n76vjz2",
      "2025-08-06T07:11:05",
      "Cus cash flow is king. Even Saylor is using debt as torque. We should do the same."
    ],
    [
      "n76vl1a",
      "2025-08-06T07:11:05",
      "U can buy one like trezor which is the safest or others and then u put it on (don’t forget the 24 seed words) and after you transfer from your current one to the new one"
    ],
    [
      "n771nvn",
      "2025-08-06T08:08:42",
      "I see the same question come by every single day. Answers are also always the same. Trezor > Ledger. At least 20 videos with reviews on youtube plus AI. No people are lazy as f* nowadays."
    ],
    [
      "n771p58",
      "2025-08-06T08:08:42",
      "As a millennial, I’d prefer a trade and barter system or gold, instead of a digital device being slugged around. Shut the powergrid down on these basement dwellers!!!!!"
    ],
    [
      "n771pre",
      "2025-08-06T08:08:42",
      "😄 the nightmares"
    ],
    [
      "n77lno4",
      "2025-08-06T11:07:35",
      "Updateme!"
    ],
    [
      "n77lo2i",
      "2025-08-06T11:07:35",
      "Personally I think a dip under 100k will happen."
    ],
    [
      "n77lrbb",
      "2025-08-06T11:07:35",
      "Erm, I’ve been buying and holding since $800…"
    ],
    [
      "n77lt8x",
      "2025-08-06T11:07:35",
      "buy ledger"
    ],
    [
      "n77uwuf",
      "2025-08-06T12:10:53",
      "Updateme!"
    ],
    [
      "n77uzrf",
      "2025-08-06T12:10:53",
      "Please update us on what you found..."
    ],
    [
      "n77v11m",
      "2025-08-06T12:10:53",
      "Holding it."
    ],
    [
      "n786tud",
      "2025-08-06T13:19:57",
      "Updateme!"
    ],
    [
      "n786ujx",
      "2025-08-06T13:19:57",
      "Updateme!"
    ],
    [
      "n786wch",
      "2025-08-06T13:19:57",
      "80k is veterans? 🤣\n\nThat was so recent wtf"
    ],
    [
      "n786yne",
      "2025-08-06T13:19:57",
      "Imho, just looking at the 80KB of the wallet.dat file, it most likely is the default file size with no bitcoins."
    ],
    [
      "n786zlg",
      "2025-08-06T13:20:38",
      "I'd bet anything that the source (if there is one) is like a small startup trying to convince a big french company to mine Bitcoin using nuclear or simply a french guy saying something."
    ],
    [
      "n787183",
      "2025-08-06T13:20:38",
      "Updateme!"
    ],
    [
      "n78736e",
      "2025-08-06T13:20:38",
      "Updateme!"
    ],
    [
      "n78shd8",
      "2025-08-06T15:08:41",
      "Exactly. Like if Jesus showed up...having fun. You seem like you're a blast"
    ],
    [
      "n78si3q",
      "2025-08-06T15:08:41",
      "Updateme!"
    ],
    [
      "n78snf9",
      "2025-08-06T15:08:41",
      "Grim outlook for ETH here, solid thread from Alex\n\nhttps://x.com/intangiblecoins/status/1953068611045576945\n\nCentralized L2s (such as Base) run on ETH , extract millions in fees off the top while only paying a tiny fraction of that back in gas fees to ETH holders. 🤣"
    ],
    [
      "n795at4",
      "2025-08-06T16:07:40",
      "Isnt it one in 800,000?"
    ],
    [
      "n795bi2",
      "2025-08-06T16:07:40",
      "It is still what triggers the start of the bullrun."
    ],
    [
      "n795czu",
      "2025-08-06T16:08:53",
      "I’ve been in since 30k"
    ],
    [
      "n79idn9",
      "2025-08-06T17:08:43",
      "Don't forget to a least link one single source.\n\nhttps://interestingengineering.com/energy/france-nuclear-powered-crypto-mining"
    ],
    [
      "n79idyg",
      "2025-08-06T17:08:43",
      "And the most butthurt award goes to..."
    ],
    [
      "n79ig28",
      "2025-08-06T17:09:31",
      "So you think no one should go the college since you can't find a job?"
    ],
    [
      "n79iign",
      "2025-08-06T17:09:31",
      "Back then bitties were around $600 +/- good luck to OP 🤞🍀"
    ],
    [
      "n79ika3",
      "2025-08-06T17:09:31",
      "More buyers than sellers, pretty sure.."
    ],
    [
      "n79vcn6",
      "2025-08-06T18:08:09",
      "Fuck don’t make me cry"
    ],
    [
      "n79vdu9",
      "2025-08-06T18:08:09",
      "I asked a guy if a $1m bitcoin was possible in 2013. He said \"No. If we hit $1m, I'll be a billionaire\".\n\n\nI hope you held bro."
    ],
    [
      "n79vek1",
      "2025-08-06T18:08:09",
      "GAAAAH IM BUYING SHIT ITS AT 115k"
    ],
    [
      "n79vf1e",
      "2025-08-06T18:08:09",
      "When I first hear about bitcoin in 2011 I thought it was one of those payment tokens on over 18 sites"
    ],
    [
      "n79vlc7",
      "2025-08-06T18:08:59",
      "What? Bitcoin always had value.. bitcoins value was the same at $1 as it is at $100,000 it’s literally the same product from then to now, the only thing that’s changed is more and more people realize/understand its value."
    ],
    [
      "n7a809f",
      "2025-08-06T19:07:53",
      "I used these 5 yrs ago to teach my teenage niece what to do if i die. She knows btc, wallets, storage and recovery of seed phrase, has her own stack. Shes driving now and will be in college soon. We recover her wallet once a year and make it a day. \n\nhttps://youtube.com/playlist?list=PLcCmNeBoE6Jit0CblKlykxrI1g9-L2swZ&si=-Sgx_udyq-sRn7uq"
    ],
    [
      "n7a80pd",
      "2025-08-06T19:08:32",
      "Bitcoin appreciates more than property \n\nSo, selling Bitcoin and buying property is essentially a way to become poorer\n\nPeople do it to afford their first home, and that's great for some, but as an investment, you don't want to sell Bitcoin for any other asset."
    ],
    [
      "n7a81rv",
      "2025-08-06T19:08:32",
      "Café the Roemer in Haarlem? It's possible to pay with bitcoin since 2021."
    ],
    [
      "n7a84to",
      "2025-08-06T19:08:32",
      "Cafe de roemer"
    ],
    [
      "n7a85da",
      "2025-08-06T19:08:32",
      "I am not ready for pay tax gains, property tax, and property insurance yet."
    ]
  ],
  "btc": [
    [
      "n73vec9",
      "2025-08-05T19:57:37",
      "Yay you’re my hero"
    ],
    [
      "n764rj3",
      "2025-08-06T03:36:10",
      "this is probable spam\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/btc) if you have any questions or concerns.*"
    ],
    [
      "n76bo3e",
      "2025-08-06T04:23:36",
      "The way $WHITENET handles governance and community voice is something other projects should study."
    ],
    [
      "n771moy",
      "2025-08-06T08:08:42",
      "Believe whatever you wanna foo."
    ],
    [
      "n786yyb",
      "2025-08-06T13:20:38",
      "Use a portion of these gains to help p2p cash win."
    ],
    [
      "n7akksj",
      "2025-08-06T20:07:55",
      "Well you gotta train your mind to enter low and have exit strategy. Things I mostly learned at precisioncircle.online\nThey do free live calls and post educational content"
    ],
    [
      "n7akmag",
      "2025-08-06T20:07:55",
      "I want your fortune-telling ball"
    ],
    [
      "n7bjw8b",
      "2025-08-06T23:06:38",
      "There are more Miners now.  Hashrate is at a high.   (Although, Just a rough proxy for mining activity.)\n\nBut most importantly - HashPrice is at an all time low.    *Hash Price*.  \n\nMiners are free to do whatever they please.  But the existence of miners does not prove they are all profitable.  \nSome are burning investor money.  Not selling any mined BTC.  \nFree to do as they see fit.    \n.   \n\nMiners that I invest in are completely ready to pivot :     \n1. AI Computer & 2. Sell massive power hookups to AI Data Centers.     \nIt’s literally in their investor docs - build large power infrastructure; ride out BTC mining while it’s attractive.  Then sell to AI Data.    \n\nWe’ve all recently seen how companies pivot - even when times *should* be okay for mining.  But they know where this is headed.  \nBTBT, BMNR, BTCT, & others all dropping BTC mining - now, when it’s opportune.   Others will be forced to drop it in next bear market; and especially after the 2028 Halving.    \n\nOver time … next decade or so … you cannot escape the fact that Miner Revenue decays exponentially."
    ]
  ],
  "solana": [
    [
      "n73vtq4",
      "2025-08-05T19:58:29",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73vz09",
      "2025-08-05T20:00:58",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wc82",
      "2025-08-05T20:00:58",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wl15",
      "2025-08-05T20:02:54",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n73wpli",
      "2025-08-05T20:03:26",
      "\nYour post has been automatically removed for violating our community guidelines on promotional content and meme coin spam. \n\nPromotion of Telegram groups, Discord servers, NFT projects, new sales, IDOs, referral links, meme coins, etc., is not permitted on r/Solana; therefore, your post has been REMOVED.\n\nIf you want to ASK or TALK about NFTs, meme coins, or promote referral links, there are other subreddits \"Unaffiliated With Solana\" dedicated to NFTs or Meme Coins like r/Memecoins, r/SolCoins, or r/SolanaMemeCoins (Use Them At Your Own Risk).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n750kd1",
      "2025-08-05T23:39:25",
      "Insane amount of institutional money incoming in next 5 years.\nCongratulations to all SOL hodlers"
    ],
    [
      "n75l1xa",
      "2025-08-06T01:35:49",
      "Happy cake day"
    ],
    [
      "n764ueo",
      "2025-08-06T03:36:10",
      "Just get more $WHITE and stop all that yapping and typing. GET MORE WHITE TODAY"
    ],
    [
      "n76bllc",
      "2025-08-06T04:23:36",
      "2.9 sol"
    ],
    [
      "n76visi",
      "2025-08-06T07:11:05",
      "Correct. I loose some weeks to overview all ways to get in this and finally i get out with same tougts"
    ],
    [
      "n77uwas",
      "2025-08-06T12:10:53",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79icld",
      "2025-08-06T17:08:43",
      "Your post has been removed because your account does not meet the subreddit requirements:\n- Your account must be at least 30 days old.\n- You must have at least 15 comment karma and non-negative link karma (>= 0) to post.\nPlease participate more in discussions and try again later.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79icox",
      "2025-08-06T17:08:43",
      "WARNING:\n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)!\n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n5) Keep Price Talk and chatter about specific meme coins to the \"Stickied\" Weekly Thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
    ],
    [
      "n79vi64",
      "2025-08-06T18:08:59",
      "What does it do?"
    ],
    [
      "n7a7v98",
      "2025-08-06T19:07:53",
      "Jupiter: best DEX, worst price chart. It’s giving ‘utility without love."
    ],
    [
      "n7bjtdi",
      "2025-08-06T23:06:38",
      "Not entirely. The recent bills that have passed, requires compliance, that Ethereum and others can't provide on their own. ChainLink provide those services, along with bridges to all major chains.\nWhy would you choose Ethereum over Solana to get the same result, whilst using the same api?"
    ],
    [
      "n7bjwh0",
      "2025-08-06T23:06:38",
      "Phantom"
    ],
    [
      "n7bjy5s",
      "2025-08-06T23:06:38",
      "I ain’t reading all that but Solana is the way."
    ],
    [
      "n7bk2l5",
      "2025-08-06T23:07:20",
      "The real question is how big a slice will Solana take? I think Solana will play a role but will it be 51%? Hard to say right now."
    ]
  ],
  "ethereum": [
    [
      "n73vty4",
      "2025-08-05T19:58:29",
      "Maybe I just misunderstood the goal, but I assumed it was to make sure no bugs (or fewer than 8) made it to the bottom of the screen."
    ],
    [
      "n73wen2",
      "2025-08-05T20:02:01",
      "Monday trading day activity a reflection of Fridays job report? Perhaps a delayed response to see sentiment before doing that big ol ETF dump?"
    ],
    [
      "n75l4pq",
      "2025-08-06T01:36:39",
      "༼ つ ◕_◕ ༽つ ETH TAKE MY ENERGY ༼ つ ◕_◕ ༽つ"
    ],
    [
      "n764upv",
      "2025-08-06T03:36:10",
      "The value is tied to that but the business operations & what they do is all onchain. They run a computer that runs an open-source software - it's nothing like a real business on a stock exchange in regard to disclosure of business activities."
    ],
    [
      "n795c18",
      "2025-08-06T16:07:40",
      "who would have guessed, finance guys aren't reading the repos to figure out where to bet, just waiting for another shillbro to lead the way."
    ],
    [
      "n79veyn",
      "2025-08-06T18:08:09",
      "I have to confess I do actually know that we will hit $3700, call me crazy all you want but it’s going to happen"
    ],
    [
      "n7akaxm",
      "2025-08-06T20:07:55",
      "Exactly. Amazed it even had to be said."
    ]
  ],
  "dogecoin": [
    [
      "n73wg6o",
      "2025-08-05T20:02:01",
      "And my dad will finally come back with the milk."
    ],
    [
      "n74u35k",
      "2025-08-05T23:03:47",
      "I look at the month to month and 3 month to 3 month."
    ],
    [
      "n758bnh",
      "2025-08-06T00:22:47",
      "They also sell for what the cool kids call fiat currency"
    ],
    [
      "n75kzp9",
      "2025-08-06T01:35:49",
      "Feels good to buy, but isn’t it foolishness when the price will soon drop by more than 30%?"
    ],
    [
      "n764waw",
      "2025-08-06T03:36:10",
      "Oh, you need clarification after 6 months of it playing out in front of your face and proving my statement 100% correct?"
    ],
    [
      "n76bkro",
      "2025-08-06T04:23:36",
      "You’re not bullish enough"
    ],
    [
      "n76ble3",
      "2025-08-06T04:23:36",
      "📈📈"
    ],
    [
      "n771mu7",
      "2025-08-06T08:08:42",
      ".069 maybe lol"
    ],
    [
      "n786txe",
      "2025-08-06T13:19:57",
      "I will be messaging you in 1 month on [**2025-09-17 13:18:21 UTC**](http://www.wolframalpha.com/input/?i=2025-09-17%2013:18:21%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/dogecoin/comments/1miv110/690_within_weeks/n786o4m/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fdogecoin%2Fcomments%2F1miv110%2F690_within_weeks%2Fn786o4m%2F%5D%0A%0ARemindMe%21%202025-09-17%2013%3A18%3A21%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201miv110)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
    ],
    [
      "n78spul",
      "2025-08-06T15:08:41",
      "These types of post is trolling"
    ],
    [
      "n795983",
      "2025-08-06T16:07:40",
      "airplanes are down from their highs 99% of the time, when they are on the ground. Means they will never manage to fly again because... 99% below ATH... that's so bad and means that airplanes can't fly. of course."
    ],
    [
      "n7959w4",
      "2025-08-06T16:07:40",
      "My grandma always said if you’re good at something you never do it for free. And I’m not getting paid to draw more lines"
    ],
    [
      "n795g7z",
      "2025-08-06T16:08:53",
      "what cost you $1 in 1920 cost you $137 in 2020. \n\nThe only chance that doge will not hit a dollar is if it loses more than 99.9% of its value over the next 100 years."
    ],
    [
      "n79ida1",
      "2025-08-06T17:08:43",
      "No it was ony gonna be wasted on silly things like food bills and pension, at least now its doing something worthwhile"
    ],
    [
      "n79ie62",
      "2025-08-06T17:09:31",
      "Ill still have my legs kicked up with out any worries. My bills are paid"
    ],
    [
      "n7a814o",
      "2025-08-06T19:08:32",
      "Maybe you’re doing too much buying and selling."
    ],
    [
      "n7akaly",
      "2025-08-06T20:07:55",
      "When 2 trillion USD gets liquidated from the market.  Cycles over."
    ],
    [
      "n7aklkt",
      "2025-08-06T20:07:55",
      "\"Gonna\" is also a Low IQ way to say it.  Why not just type properly?  "
    ],
    [
      "n7bk2na",
      "2025-08-06T23:07:20",
      "Fuck me mate, 244 days to late"
    ]
  ],
  "CryptoCurrency": [
    [
      "n73wixt",
      "2025-08-05T20:02:01",
      "People who are in profit"
    ],
    [
      "n73wm37",
      "2025-08-05T20:02:54",
      "Yes, post office has to open and scan each letter to make sure nobody is sending child pix with it."
    ],
    [
      "n73wrw2",
      "2025-08-05T20:03:26",
      "The ruling class are certainly treating it like one"
    ],
    [
      "n74ct08",
      "2025-08-05T21:28:56",
      "You stupid fuckhead who FUD off this shit. You're either too ignorant about the entire ripple/XRP process or you are just working for ulterior motives which surely are for your own benefit. \n\nEVERY FUCKING MONTH Ripple does this. It's written into their protocol and they must. \n\nThis is taking coins out of circulation and it is not selling of any type. \n\nThe number of ass wipes that want to shit on crypto to pump their own interests is disgusting. \n\nIt doesn't matter if you're a ripple fan or not, at least know what the hell you're talking about when you give people you're fucked up investment advice that you just blew out of your ass."
    ],
    [
      "n750fg6",
      "2025-08-05T23:39:25",
      "Alright, back @ $36XX ETH. Let's build on this."
    ],
    [
      "n750gai",
      "2025-08-05T23:39:25",
      "We going back to pencil and paper boys!"
    ],
    [
      "n750lvw",
      "2025-08-05T23:39:25",
      "If you hold $ADA don‘t forget to claim your midnight airdrop! Cardano gets the biggest allocation but other chains are also eligible. (f.e. $ETH, $SOL, $XRP, $BTC …)"
    ],
    [
      "n758afm",
      "2025-08-06T00:22:47",
      "I get usdc on coinbase with 0 fees in and out. It can be transferred using base or stellar for almost no cost."
    ],
    [
      "n75l076",
      "2025-08-06T01:35:49",
      "This happened to me on binance when btc was below 10k.\n\nSwitched to huobi ( htx now ) \n\nNever looked back"
    ],
    [
      "n75l2t7",
      "2025-08-06T01:35:49",
      "I‘m sure everyone is in crypto for the gains, but realistically the risks nowadays simply outweigh the potential gains"
    ],
    [
      "n76vlha",
      "2025-08-06T07:11:05",
      "It's not working with mobile wallets either, for me. I tried with Yoroi and Lace, same thing."
    ],
    [
      "n77lp4n",
      "2025-08-06T11:07:35",
      "Your [comment](https://www.reddit.com/r/CryptoCurrency/comments/1minliw/cardano_midnight_glacier_just_went_live_claimable/n77lgpt/?context=3) was automatically removed because you [linked](https://www.reddit.com/r/CryptoCurrency/comments/1minliw/cardano_midnight_glacier_just_went_live_claimable/n77lgpt/?context=3) to an external subreddit without using an NP subdomain for no-participation mode. When linking to external subreddits, please change the subdomain from `https://www.reddit.com` to `https://np.reddit.com`. This simple change substantially reduces [brigading](https://www.reddithelp.com/en/categories/rules-reporting/account-and-community-restrictions/what-constitutes-vote-cheating-or). \n\n**NOTE:** The AutoModerator will not reapprove your content if you fix a URL. However, if it was a post which had considerable activity in its comment section, you can message the modmail to request manual reapproval. If it was a comment, just make a new comment. \n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"
    ],
    [
      "n77v1fl",
      "2025-08-06T12:10:53",
      "Thank you for submitting to /r/CryptoCurrency,\n\nYour post has been removed because there are already 2 posts about Politicians in the top 50. You may post it again when the topic is no longer at the limit.\n\n---[**Click here for a link to view the current limits**](https://www.reddit.com/r/CryptoCurrency/wiki/topic_limits)---\n\n*I am a bot, and this action was performed automatically. Please contact the [moderators of this subreddit](https://www.reddit.com/message/compose?to=%2Fr%2Fcryptocurrency) if you have any questions or concerns.*"
    ],
    [
      "n786z6v",
      "2025-08-06T13:20:38",
      "I didn’t say a 15% tariff will raise the price 50%, but a 50% tariff can ;)\n\nHence why I wrote 10-50%.  Because right now this is the range of what’s been applied to imported goods"
    ],
    [
      "n78spz9",
      "2025-08-06T15:08:41",
      "Nah man I'm destitute because of this massive dip"
    ],
    [
      "n795chx",
      "2025-08-06T16:08:53",
      "BTC looks strong"
    ],
    [
      "n795h1c",
      "2025-08-06T16:08:53",
      "bull run continues"
    ],
    [
      "n795lbu",
      "2025-08-06T16:08:53",
      "Buy high and sell low always, otherwise folks need to gtfo of this subreddit\n\n(/s in case)"
    ],
    [
      "n79ih6c",
      "2025-08-06T17:09:31",
      "Oh trust me, I know, I despise the guy. I'm simply saying, if he keeps bullshitting about fake numbers he's actually hurting his own chances of a rate cut, which he's been begging for all year. I don't think he even realizes how dumb his position is right now.\n\nIf you want to pretend the job market is strong and everything is perfect, why cut rates as you demand? So stupid lol."
    ],
    [
      "n79viok",
      "2025-08-06T18:08:59",
      ">“OTC trade desks’ collective balances are **down to around 155,000 BTC.** As the OTC desks run low, the demand on the public exchanges will increase, and that is what will uncork BTC’s price.”\n\nStrategy alone will probably buy this up by the end of the year."
    ],
    [
      "n79vj74",
      "2025-08-06T18:08:59",
      "Trump finally gets the thing he needs to convince J to cut and he loses his shit over it. What fucking world are we living in"
    ],
    [
      "n79vjvk",
      "2025-08-06T18:08:59",
      "![gif](giphy|fan78Laj0Lm5I5OlM6|downsized)"
    ],
    [
      "n7a7w12",
      "2025-08-06T19:07:53",
      "use Brave browser. Be plagued by pop-ups and re-directs no more"
    ],
    [
      "n7a7xlr",
      "2025-08-06T19:07:53",
      "wtf"
    ],
    [
      "n7a80f3",
      "2025-08-06T19:07:53",
      "Crazy how bullish Tom Lee is on ETH.  Of course he chairs an ETH treasury company so take with a grain of salt I suppose."
    ],
    [
      "n7bjx89",
      "2025-08-06T23:06:38",
      "Bro, bonk guy is extremely legit ... *extreeeeemely legit*. I call him Uni, sometimes because i noticed many of his friends on CT did. He explained that his username came from Uniswap and Pancakeswap.  \"The Uniswap and Pancakeswap guy\" isn't near as cool as BONK GUY.  Hence, his infamous trade you now know about. I mean dude called it too. And CT faded him. \n\nI have been following Uni on the solana blockchain and on CT (aka crypto twitter).  Twitter attacked his ass, everyone faded and kept fading, and fading.  And $bonk went on a absolute fucking tear! \"Bonk Guy was right\" - they all said. Holy shit man go and check for yourself. That's what makes crypto so damn much fun. And i know you know crypto, I'm speaking in generalities in case any normies are in here. They NEED to hear this too. \n\nUnfortunately (and fortunately) my situation with crypto didn't really start until Q3 of 2024. What bonk guy did drew me in.  And i was a bit skeptical at first, but all the data is there. All provable, on chain!!! Dude's a legend! \n\n  \nAND THIS IS WHY I AM HERE TYPING THIS RESPONSE.  *I BELIEVE IN BONK GUY!* MANY ALREADY DO!\n\nLook up any big \"crypto KOL\" on twitter and see if they have comments about Bonk Guy.  The fud spreaders are usually just paid attacks, sincerely. It's crypto for crying out loud - anything goes really in the wild west.   \nAnyway, check out, hell *ASK*, people like Ansem ([@blknoiz06](https://x.com/blknoiz06)).  He is a clear Bonk Guy supporter on the CT timeline.  I mean, it's fucking Ansem! Dude is a legend. Both bonk guy and Ansem have proven themeselves and their trades on chain and have mad respect for each other.  In crypto these dudes are a big mf-ing deal. \n\nAnyway. #USELESS coin is my ticket out of here. It should be yours too. It should be everyones.  But that's the beauty of Useless coin. There's no bullshit. Like EVERYTHING OTHER THAN BTC. i mean come on. BTC is gold. The rest are companies. Companis come and go. Let's ride teh golden memecoin. THE #USELESS COIN.  \n\n  \nAnd dude, i write. Im a shitty ass trader. Hence why i follow Uni / Bonk Guy.  Dude is so damn legit and his TA is spot on.  But again, im a writer. Not a trader.  Get it yet?\n\nHIGHER!!!"
    ],
    [
      "n7bk09n",
      "2025-08-06T23:07:20",
      "United the Devided States of America."
    ],
    [
      "n7bk1od",
      "2025-08-06T23:07:20",
      " Do you guys think trump will put tarrifs on etherium or solana????"
    ],
    [
      "n7bk3jh",
      "2025-08-06T23:07:20",
      "Bitpoopex"
    ]
  ],
  "eth": [
    [
      "n76vhmg",
      "2025-08-06T07:11:05",
      "Scam"
    ]
  ]
}